[
  {
    "id": "026da9a56412b18006bb",
    "title": "VP of Marketing",
    "company": "Endear",
    "location": "Remote",
    "salary": "Great compensation package with stock options and 401(k) access",
    "description": "Lead a small but mighty team to improve demand generation, brand recognition, and market penetration for a leading CRM for omnichannel brands. Apply your SaaS experience to build a comprehensive strategy and team, focusing on top-of-funnel capabilities and data-driven decision making.",
    "requirements": [
      "8+ years of marketing experience with 3+ years in senior roles at b2b SaaS companies",
      "Experience scaling marketing orgs from early-stage to growth phase",
      "Passionate about leveraging data to iterate quickly",
      "Experience building and managing high-performing teams of 5-15 people",
      "Well-versed in Hubspot",
      "Excited about remote work opportunities",
      "Curious and eager to find novel solutions"
    ],
    "responsibilities": [
      "Develop and execute a comprehensive marketing strategy",
      "Lead and grow a high-performing marketing team",
      "Own marketing budget and metrics, focusing on pipeline generation and ROI",
      "Hone brand voice and positioning in the market",
      "Work closely with cross-functional teams",
      "Drive thought leadership through content strategy and market education",
      "Present regularly to leadership on marketing org’s performance"
    ],
    "about_company": "Endear is the leading CRM for omnichannel brands, helping global retail teams drive more revenue across in-store and online channels. Launched in 2019, it stands out for its modern SaaS approach to clienteling, ensuring success for brands from day one.",
    "benefits": "Healthcare package including dental and vision\nStipend for co-working space or home office equipment\nFlexible time off with unlimited vacation days",
    "raw_content": "<p><strong>About Us</strong></p><p>Endear is the leading CRM for omnichannel brands, helping global retail teams drive more revenue for their companies across in-store and online channels. Today, thousands of retail salespeople count on Endear to connect with customers at scale without compromising on personalization. Through a combination of segmentation, data analytics, and AI, Endear empowers the only remaining category of salespeople who have never been given the power of a CRM to increase their value and gain recognition for their work.</p><p>Launched in 2019, Endear stands out in the market for its modern SaaS approach to clienteling, and has proven that retail tech can be simple to deploy and easy to use, ensuring brands like Gorjana, Glossier, Frame and Allbirds see success from day one.</p><p></p><p><strong>The Opportunity</strong></p><p>As VP of marketing, you’ll have the opportunity to take an incredible product and share it with the world. You’ll take on leading a small but mighty team that is eager to follow your guidance on how we can rapidly improve demand generation, brand recognition, and overall market penetration in order to engage and convert the world’s leading retail brands. You'll apply your tenured history in SaaS to build the right comprehensive strategy and team for Endear’s unique offering and ICP. With a focus on honing our top-of-funnel capabilities, you know how to draw attention to what makes us special. You’ll be deeply involved in our overall funnel dynamics and guide both forecast and budget based on executive leadership’s overall growth goals, with a strong emphasis on data-driven decision making and measurable results.</p><p></p><p>The ideal candidate will be both strategic and hands-on, able to think big while executing on day-to-day priorities. You should be comfortable operating in a fast-paced, sometimes ambiguous environment, and have conviction around the power of marketing to make amazing products shine even brighter.</p><p>If you're excited about leading marketing at a high-growth SaaS company and want to make a significant impact, we'd love to hear from you.</p><p><strong>What We're Looking For</strong></p><ul> <li>You have a rich career (8+ years) of marketing experience with 3+ years in senior roles at b2b SaaS companies. You understand the most important growth channels and relevant benchmarks but also know that one playbook doesn’t fit every company.</li> <li>You’re willing to get your hands dirty and take on a player-coach mentality; we’re still a small team and we are looking for someone who’s willing to tackle challenges directly along with directing the team.</li> <li>Track record of scaling marketing orgs from early-stage to growth phase. You’ve done this before and are excited for a new challenge.</li> <li>You’re passionate about the numbers and leveraging data to iterate quickly. You’re eager to test out new ideas and find quick wins to keep things moving forward.</li> <li>You’ve worked at a company with fewer than 20 people and have experience building and managing high-performing teams of 5-15 people; early career in top-of-funnel growth a plus</li> <li>Well-versed in Hubspot; generally nerdy about how software can give us an edge over everyone else</li> <li>You are excited about remote work opportunities. You thrive under the flexibility afforded by work-from-home and embrace empowering your team to work independently</li> <li>You are a curious person. We want people that can see challenges coming and are eager to find novel solutions.</li> </ul><p></p><p><strong>What You'll Do</strong></p><ul> <li>Develop and execute a comprehensive marketing strategy aligned with our growth targets and product roadmap</li> <li>Lead and grow a high-performing marketing team across demand generation, content, product, and lifecycle marketing.</li> <li>Own our marketing budget and metrics, with a focus on pipeline generation and ROI</li> <li>Continue to hone our brand voice and positioning in the market, differentiating us from competitors</li> <li>Work closely with cross-functional teams, including sales, product, and customer success to ensure alignment across company objectives</li> <li>Drive thought leadership through content strategy and market education</li> <li>Present regularly to leadership and company at large on marketing org’s performance across KPI’s and org’s impact on company’s overall success</li> </ul><p></p><ul> <li>Great compensation package with stock options and 401(k) access</li> <li>Healthcare package including dental and vision</li> <li>Stipend for co-working space or home office equipment</li> <li>Flexible time off with unlimited vacation days</li> </ul><p></p><p><strong>Why Endear?</strong></p><p>Join a company of people who embrace doing things differently — retail is a huge market with very few tech products to choose from, especially that influence sales, so we think we have the opportunity to build a big business, but we believe in building a real business too. Since inception, we have brought the company to profitability on numerous occasions. We make measured, high-conviction decisions at every milestone to ensure that we exist for the next 5+ years while realizing our massive potential.</p>",
    "url": "https://app.joinrise.co/jobs/endear-vp-of-marketing-sdxe",
    "created_at": "2025-01-23T12:34:09.961309+00:00"
  },
  {
    "id": "1404a16d0cef01ea8398",
    "title": "Director, Partner Marketing Growth",
    "company": "ActiveCampaign",
    "location": "Not specified (remote status not mentioned)",
    "salary": "$164,000 - $225,500 a year (base rate only, excluding bonus, equity, or sales incentives)",
    "description": "Play a key role in driving revenue growth through ActiveCampaign’s partner marketing programs, managing partner marketing, and working closely with the channel sales team to acquire new partners and grow existing relationships.",
    "requirements": [
      "12+ years of marketing experience, including 4+ years as a partner marketing leader",
      "Experience with SaaS partner programs",
      "Experience managing partner marketing programs, including partner events, partner enablement, and MDF",
      "Experience with content creator partnerships is preferred",
      "Expert communication skills",
      "Revenue-oriented, with the objective of driving growth through strong relationships across multiple types of partner programs"
    ],
    "responsibilities": [
      "Collaborate with the channel revenue team to acquire and grow solutions partners",
      "Develop ActiveCampaign’s comprehensive to, with, and through partner strategies",
      "Coordinate assets and programs to grow revenue from existing ActiveCampaign partners",
      "Bring ActiveCampaign’s partner programs to market",
      "Manage and grow ActiveCampaign’s affiliate program",
      "Partner with content creator affiliates to create and distribute sponsored content",
      "Monitor and report on performance of ActiveCampaign’s affiliate and content creator programs"
    ],
    "about_company": "ActiveCampaign helps small teams power big businesses with the must-have platform for intelligent marketing automation. It is a global multicultural company proud of its inclusive culture which embraces diverse voices, backgrounds, and perspectives. ActiveCampaign holds the highest customer satisfaction rating among Marketing Automation, E-Commerce Personalization, Landing Page Builders, and CRM solutions on G2.com and is one of only a handful of software solutions with over 10,000 positive reviews.",
    "benefits": "Comprehensive health and wellness benefits including a High Deductible Health Plan (HDHP) fully covered by ActiveCampaign, complimentary access to telehealth and tele-mental health resources, and a complimentary membership to Calm\nOpen paid time off\nGenerous 401(k) matching program with immediate vesting\nQuarterly Path Perks with options for commuter and lunch benefits or a remote home office stipend\nAccess to professional development resources through LinkedIn Learning\nAfter five years of service, eligibility for a four-week paid sabbatical leave and a sabbatical leave bonus",
    "raw_content": "<p>As ActiveCampaign’s Director, Partner Marketing Growth, you’ll play a key role in driving revenue growth through ActiveCampaign’s partner marketing programs. You’ll manage partner marketing and work closely with our channel sales team to drive both acquisition of new partners and growth in existing partner relationships. ActiveCampaign has a large solutions partner and affiliate ecosystem, and is looking to expand and modernize these programs; you’ll also have the opportunity to help shape a critical, company-level strategic initiative.&nbsp;&nbsp;</p>\\n<p></p><p><br></p><b> What your day could consist of: </b><ul><li>Collaborate with the channel revenue team to acquire and grow solutions partners with top-line revenue acceleration as the primary goal</li><li>Develop ActiveCampaign’s comprehensive to, with, and through partner strategies</li><li>Coordinate assets and programs to grow revenue from existing ActiveCampaign partners, including MDF, whitelabel content, private events, and to/with/through marketing&nbsp;&nbsp;</li><li>Bring ActiveCampaign’s partner programs to market, managing acquisition of new partners across partner programs (in collaboration with sales teams)</li><li>Manage and grow ActiveCampaign’s affiliate program, inclusive of traditional affiliate partnerships and content creator partnerships</li><li>Partner with content creator affiliates to create and distribute sponsored content across their channels, in collaboration with other marketing functions</li><li>Monitor and report on performance of ActiveCampaign’s affiliate and content creator programs</li></ul><p><br></p><b>What is needed: </b><ul><li>12+ years of marketing experience, including 4+ years as a partner marketing leader and a clear track record managing partner and affiliate programs.&nbsp;</li><li>Experience with SaaS partner programs is required&nbsp;</li><li>Experience managing partner marketing programs, including partner events, partner enablement, and MDF</li><li>Experience with content creator partnerships is preferred</li><li>Expert communication skills, spanning collaboration with internal teams and ability to interface with and build relationships with partners</li><li>Revenue-oriented, with the objective of driving growth through strong relationships across multiple types of partner programs</li></ul><p><br></p><p></p>\\n<div>$164,000 - $225,500 a year</div><small><div>Compensation details listed in this posting reflect the base rate only and do not include bonus, equity or sales incentives, if applicable.</div><div><br></div><div>ActiveCampaign believes in and is committed to equitable compensation practices.&nbsp; The salary range provided above is a good faith estimate of the pay range determined by the location associated with the job posting. The actual salary depends on a candidate’s skills, experience, and work location. Candidates may also be eligible for other role-specific compensation such as equity, an annual performance bonus, or other incentive compensation depending on the role.</div></small>\\n<p><b>About ActiveCampaign:</b></p><p>ActiveCampaign helps small teams power big businesses with the must-have platform for intelligent marketing automation. Customers from over 170 countries depend on ActiveCampaign’s mix of pre-built automations and integrations (including Facebook, Google, WordPress, Salesforce, Shopify, and Square) to power personalized marketing, transactional emails, and one-to-one CRM interactions throughout the customer lifecycle.&nbsp;</p><p><br></p><p>As a global multicultural company, we are proud of our inclusive culture which embraces diverse voices, backgrounds, and perspectives. We don’t just celebrate our differences, we believe our diversity is what empowers our innovation and success. You can find out more about our DEI initiatives <span class=\"postings-link\">here</span>.&nbsp;</p><p><br></p><p>ActiveCampaign holds the highest customer satisfaction rating among Marketing Automation, E-Commerce Personalization, Landing Page Builders, and CRM solutions on <span class=\"postings-link\">G2.com</span> and is one of only a handful of software solutions with over 10,000 positive reviews. ActiveCampaign has also been named the Top Rated Email Marketing Software on TrustRadius. Learn more and start your free trial at <span class=\"postings-link\">ActiveCampaign.com</span>.</p><p><br></p><p><b>Perks and benefits:</b></p><p>ActiveCampaign is an employee-first culture. We take care of our employees at work and outside of work. You can see more of the details <span class=\"postings-link\">here</span>, but some of our most popular benefits include:</p><p><br></p><p>-Comprehensive health and wellness benefits that includes a High Deductible Health Plan (HDHP) fully covered by \tActiveCampaign, complimentary access to telehealth and tele-mental health resources, and a complimentary membership to Calm</p><p>-Open paid time off</p><p>-Generous 401(k) matching program with immediate vesting</p><p>-Quarterly Path Perks with options for commuter and lunch benefits (for those reporting to a Hub), or a remote home office stipend</p><p>-Access to professional development resources through LinkedIn Learning</p><p>-After five years of service, you’ll be eligible for a four-week paid sabbatical leave and a sabbatical leave bonus</p><p><br></p><p>ActiveCampaign is an equal opportunity employer. We recruit, hire, pay, grow and promote no matter of gender, race, color, sexual orientation, religion, age, protected veteran status, physical and mental abilities, or any other identities protected by law. </p><p><br></p><p>Our Employee Resource Groups (ERGs) strive to foster a diverse inclusive environment by supporting each other, building a strong sense of belonging, and creating opportunities for mentorship and professional growth for their members.</p>",
    "url": "https://jobs.lever.co/activecampaign/2c247eef-23c6-4f54-bc08-78c28acc942e",
    "created_at": "2025-01-27T15:51:32.513423+00:00"
  },
  {
    "id": "392fc302a197ef301b05",
    "title": "Head of Demand Generation",
    "company": "App0",
    "location": "United States",
    "salary": "Competitive compensation with base salary, bonus and equity",
    "description": "As our Head of Demand Generation, you’ll own all things demand gen - with a specific focus on content. From strategy to execution, you’ll be responsible for creating programs and campaigns that bring in high-quality leads, drive revenue, and help us grow sustainably.",
    "requirements": [
      "Experience selling into eCommerce in the US (Mid-Market and up)",
      "Strong content generation inclination",
      "Startup mentality- be scrappy and ready to roll up your sleeves",
      "Drive inbound and outbound lead generation efforts",
      "Strong network of contractors who can help get things done quickly",
      "Extremely comfortable rolling up your sleeves as you are setting strategy",
      "Strong experience with running outbound email campaigns",
      "Solid understanding of the eCommerce industry and its segmentation",
      "Fluent in SaaS unit economics and with Sales led SaaS",
      "Knowledge of the latest and greatest AI tools like Clay, Instantly, Apollo, etc."
    ],
    "responsibilities": [
      "Create programs and campaigns that bring in high-quality leads, drive revenue, and help grow sustainably",
      "Build, experiment, and scale in a startup environment",
      "Achieve aggressive targets"
    ],
    "about_company": "App0 is transforming eCommerce by creating the most advanced AI based shopping experiences. Our AI Agents are a critical part of a brand's online identity and connect with customers wherever they engage - email, web, chat, PDPs, FAQs etc. Our mission is to empower eCommerce brands with the best customer experience that generates higher revenue by converting and retaining more shoppers. We are repeat entrepreneurs and are funded by the same investors who were early investors in Google, Uber and Salesforce.",
    "benefits": "Excellent benefits",
    "raw_content": "Skip to main content Head of Demand Generation App0 United States 3 weeks ago Over 200 applicants See who App0 has hired for this role Apply Save About App0:App0 is transforming eCommerce by creating the most advanced AI based shopping experiences. Our AI Agents are a critical part of a brand's online identity and connect with customers wherever they engage - email, web, chat, PDPs, FAQs etc. Our mission is to empower eCommerce brands with the best customer experience that generates higher revenue by converting and retaining more shoppers. We are repeat entrepreneurs and are funded by the same investors who were early investors in Google, Uber and Salesforce.What You’ll Do:As our Head of Demand Generation, you’ll own all things demand gen - with a specific focus on content. From strategy to execution, you’ll be responsible for creating programs and campaigns that bring in high-quality leads, drive revenue, and help us grow sustainably. This is a hands-on role where you’ll get to build, experiment, and scale in a startup environment. We have aggressive targets to achieve next year and you are going to make it happen!What We’re Looking For:Experience: Must have experience selling into eCommerce in the US (Mid-Market and up). Shopify is useful but not the only platform we're interested in.Content Marketing: Must have strong content generation inclination. You'll be a perfect fit for this role, if you are an expert at content.Startups: You should have startup mentality- be scrappy and ready to roll up your sleeves.Lead Generation: Drive inbound and outbound lead generation efforts, ensuring a steady flow of qualified leads to the sales team.Strong Network: You have a string network of contractors who can help get things done quickly- think content writers, creatives, ads etc.Hands-On: You’re extremely comfortable rolling up your sleeves as you are setting strategy.Outbound email campaigns: Strong experience required with running outbound email campaignseCommerce Know-How (Second time, so must be very important): A solid understanding of the eCommerce industry and its segmentation. We can't teach you the market.SaaS Expertise: You’re fluent in SaaS unit economics and with Sales led SaaS. Our product is sales led.Tech-Savvy: You must know the latest and greatest AI tools like Clay, Instantly, Apollo, etc.Competitive compensation with base salary, bonus and equity and excellent benefits. Show more Show less Director Full-time Marketing and Sales Technology, Information and Internet Referrals increase your chances of interviewing at App0 by 2x See who you know Similar jobs Director, Demand Marketing Director, Demand Marketing Wrike United States 2 days ago Director of Growth Director of Growth Synergy Pet Group United States 16 hours ago Director, Partner Marketing Growth Director, Partner Marketing Growth ActiveCampaign United States $164,000.00 - $225,500.00 1 week ago Director, Demand Generation Director, Demand Generation Coalition, Inc. United States $160,000.00 - $200,000.00 2 weeks ago Director, Demand Generation Director, Demand Generation Veracode Burlington, MA 2 weeks ago Director, Demand Generation Director, Demand Generation Avtex Solutions United States 1 week ago Director of Demand Generation Director of Demand Generation Foley Florida, United States $135,000.00 - $150,000.00 1 month ago Director of Growth Marketing + Engagement Director of Growth Marketing + Engagement CINQCARE United States $155,000.00 - $165,000.00 2 days ago Director of Demand Generation Director of Demand Generation Quiq United States 1 week ago Director of Demand Generation Director of Demand Generation Foley Georgia, United States $135,000.00 - $150,000.00 1 month ago Director of Demand Generation Director of Demand Generation Foley Hartford, CT $135,000.00 - $150,000.00 1 month ago Director of Growth Marketing Director of Growth Marketing Smalls United States $150,000.00 - $170,000.00 2 days ago Director of Demand Generation Director of Demand Generation Foley South Carolina, United States $135,000.00 - $150,000.00 1 month ago Director, Demand Generation Director, Demand Generation TTEC Digital United States 1 week ago Director of Growth, Integrated Marketing Campaigns Director of Growth, Integrated Marketing Campaigns Hyperscience United States 1 week ago US Marketing Director US Marketing Director Morght California, United States $150,000.00 - $200,000.00 6 hours ago Marketing Director Marketing Director yoobi United States 2 days ago Growth Marketing Director - USA Growth Marketing Director - USA Distillery United States 2 weeks ago Founding Director of Demand Generation Founding Director of Demand Generation Pivotal Partners United States $200,000.00 - $240,000.00 2 hours ago Director of Marketing Director of Marketing Viscadia United States 1 day ago Director, Marketing Director, Marketing Alloy United States 1 month ago Director, Marketing Director, Marketing Alloy United States 1 month ago Director, Growth Marketing Director, Growth Marketing Included Health United States $149,450.00 - $242,770.00 2 weeks ago Marketing Director, Rosetta Stone Marketing Director, Rosetta Stone IXL Learning United States 2 days ago Head of Demand Generation Head of Demand Generation Strativ Group United States $120,000.00 - $140,000.00 1 week ago ITC Vegas Marketing Director ITC Vegas Marketing Director Clarion Events Inc. - North America United States 2 days ago Demand Generation Director Demand Generation Director Foley United States $135,000.00 - $150,000.00 1 week ago Show more jobs like this Show fewer jobs like this People also viewed Director of B2B Marketing Director of B2B Marketing CINQCARE United States $180,000.00 - $190,000.00 2 days ago Marketing Director Marketing Director Versatile United States 1 day ago Performance Marketing Director - Canada (Remote in USA) Performance Marketing Director - Canada (Remote in USA) PetLab Co. United States $140,000.00 - $175,000.00 3 weeks ago Director, Strategic Growth Team Director, Strategic Growth Team Spark New York, NY $130,000.00 - $260,000.00 2 months ago Director, Lifecycle Marketing Director, Lifecycle Marketing GoGuardian United States $175,000.00 - $200,000.00 3 weeks ago Director of Growth & Ecommerce Director of Growth & Ecommerce KenkoTech Futures United States 3 days ago Director, Growth Creative Strategy Director, Growth Creative Strategy Seed Health United States $170,000.00 - $190,000.00 1 month ago Director of Growth Marketing Director of Growth Marketing Tremendous United States $230,000.00 - $270,000.00 2 weeks ago Director, Demand Generation (US) Director, Demand Generation (US) Vidyard United States 1 week ago Director of Marketing Director of Marketing Ringmaster Technologies, Inc. United States 1 week ago Explore collaborative articles We’re unlocking community knowledge in a new way. Experts add insights directly into each article, started with the help of AI. Explore More",
    "url": "https://www.linkedin.com/jobs/view/head-of-demand-generation-at-app0-4112143984/",
    "created_at": "2025-01-24T11:50:24.345322+00:00"
  },
  {
    "id": "41c94578f3ef24aa7aa0",
    "title": "VP of Marketing",
    "company": "Futuri",
    "location": "Remote",
    "salary": "Competitive compensation (commensurate with experience)",
    "description": "Seeking a bold, visionary, and results-driven VP of Marketing to reimagine and elevate brand and marketing strategies across SaaS products. Drive measurable outcomes aligning with business goals.",
    "requirements": [
      "Proven ability to lead bold, strategic initiatives that disrupt markets and drive significant growth",
      "8+ years in marketing with at least 3 years in a leadership role, preferably in SaaS",
      "Proven ability to develop strategies backed by data and analytics to drive sales and customer engagement",
      "Demonstrated success in creating innovative marketing strategies that deliver value and enhance brand visibility",
      "Proficiency in marketing technologies such as HubSpot, Salesforce, and analytics platforms",
      "Deep understanding of SEO, digital marketing principles, and lead generation best practices",
      "Strong presentation and storytelling skills, with the ability to inspire internal teams and external audiences",
      "Bachelor’s degree in Marketing, Communications, Business, or a related field (MBA preferred)",
      "Experience working cross-functionally with sales, product, and customer success teams to align marketing strategies with business objectives"
    ],
    "responsibilities": [
      "Lead team of product marketers to ensure company alignment on solutions positioning",
      "Develop and execute cohesive brand strategy to strengthen market presence",
      "Ensure consistency in brand messaging and visuals across all marketing channels",
      "Act as advocate for Futuri in industries served, building relationships and positioning as thought leader",
      "Identify and capitalize on emerging marketing trends and technologies",
      "Partner with sales leaders to create tools and campaigns impacting sales performance",
      "Develop Account-Based Marketing strategies for high-value accounts",
      "Build, mentor, and manage a high-performing marketing team",
      "Collaborate with product and customer success teams for campaign design",
      "Design and execute lead generation strategies",
      "Monitor and optimize lead generation efforts through detailed analytics",
      "Develop KPIs linking marketing performance to business outcomes",
      "Provide regular performance updates to executive leadership"
    ],
    "about_company": "",
    "benefits": "Competitive compensation (commensurate with experience)\nExcellent benefits, including health, dental, and vision insurance\nGenerous FTO policy\nFlexible remote work\n401(k) retirement plan with company match",
    "raw_content": "<p>Description:</p><ul><li> Seeking a bold, visionary, and results-driven VP of Marketing to reimagine and elevate brand and marketing strategies across SaaS products</li><li> Drive measurable outcomes aligning with business goals</li><li> Lead team of product marketers to ensure company alignment on solutions positioning</li><li> Develop and execute cohesive brand strategy to strengthen market presence</li><li> Ensure consistency in brand messaging and visuals across all marketing channels</li><li> Act as advocate for Futuri in industries served, building relationships and positioning as thought leader</li><li> Identify and capitalize on emerging marketing trends and technologies</li><li> Partner with sales leaders to create tools and campaigns impacting sales performance</li><li> Develop Account-Based Marketing strategies for high-value accounts</li><li> Build, mentor, and manage a high-performing marketing team</li><li> Collaborate with product and customer success teams for campaign design</li><li> Design and execute lead generation strategies</li><li> Monitor and optimize lead generation efforts through detailed analytics</li><li> Develop KPIs linking marketing performance to business outcomes</li><li> Provide regular performance updates to executive leadership</li></ul><p>Requirements:</p><ul><li> Proven ability to lead bold, strategic initiatives that disrupt markets and drive significant growth</li><li> 8+ years in marketing with at least 3 years in a leadership role, preferably in SaaS</li><li> Proven ability to develop strategies backed by data and analytics to drive sales and customer engagement</li><li> Demonstrated success in creating innovative marketing strategies that deliver value and enhance brand visibility</li><li> Proficiency in marketing technologies such as HubSpot, Salesforce, and analytics platforms</li><li> Deep understanding of SEO, digital marketing principles, and lead generation best practices</li><li> Strong presentation and storytelling skills, with the ability to inspire internal teams and external audiences</li><li> Bachelor’s degree in Marketing, Communications, Business, or a related field (MBA preferred)</li><li> Experience working cross-functionally with sales, product, and customer success teams to align marketing strategies with business objectives</li></ul><p>Benefits:</p><ul><li> Competitive compensation (commensurate with experience)</li><li> Excellent benefits, including health, dental, and vision insurance</li><li> Generous FTO policy</li><li> Flexible remote work</li><li> 401(k) retirement plan with company match</li></ul>",
    "url": "https://www.remoterocketship.com/company/futurimedia/jobs/vp-of-marketing-united-states",
    "created_at": "2025-01-28T20:47:04.275733+00:00"
  },
  {
    "id": "43dfe326f90c121ef5cf",
    "title": "Director of Demand Generation",
    "company": "OfferFit",
    "location": "100% remote work environment with flexible hours",
    "salary": "Base salary range: $197,000-$234,000 per year, plus eligibility for additional bonus ranging $29,000-$34,000; Eligibility for an additional end of year performance bonus, commissions (when applicable) and/or equity options",
    "description": "The Director of Demand Generation will take ownership of developing and executing strategies that drive pipeline growth, working closely with the CMO and leading a skilled team focused on engaging prospects at the earliest stages of their journey.",
    "requirements": [
      "SaaS Extraordinaire: Experience in driving demand and marketing SaaS products.",
      "Problem solver: Ability to recognize patterns, synthesize information, and come up with creative solutions.",
      "Structured and organized: Ability to structure a plan, align stakeholders, and see it through to execution.",
      "Collaborative and empathetic partner: Works well with internal stakeholders, understanding their needs and building solutions that match.",
      "Clear communicator: Able to express clearly and persuasively, both in writing and speech.",
      "Entrepreneurial: Proactively identifies opportunities and risks, works around obstacles, and seeks creative ways to improve processes and outcomes.",
      "Up to 10-15% travel for company-wide quarterly gatherings, team offsite workshops, customer meetings, and industry-related events.",
      "Ability to primarily overlap with North America time zones.",
      "Strong fluency in English, both written and verbal."
    ],
    "responsibilities": [
      "Lead strategic demand generation initiatives.",
      "Optimize marketing automation systems.",
      "Develop targeted nurture programs.",
      "Develop process for multi-touch attribution.",
      "Align sales and marketing for revenue impact.",
      "Build and mentor a high-performing team."
    ],
    "about_company": "OfferFit was founded by ex-McKinsey and BCG math PhDs, and is funded by leading Silicon Valley VCs. It replaces A/B testing with AI testing, powered by reinforcement learning AI, allowing lifecycle marketers to test & improve the performance of their campaigns much faster than before. Customers include leading brands like Brinks Home, Yelp, Chime, Engie, and MetLife, among many others.",
    "benefits": "Generous PTO (starting at 25 days PTO per year) and Parental Leave policy (12 weeks paid).\n100% remote work environment with flexible hours.\nQuarterly gatherings in different cities to work together, bond as a team, and celebrate progress.\nWeekly team events (lunch and learns, trivia, virtual escape rooms, town hall and team health 'barometer' meetings).\nAbility to learn and develop from an experienced leadership team.\nDedication to building a strong culture (e.g., team resource groups, weekly recognitions, major life event celebrations, mental health/sustainability days off, etc.).\n[US Only] Competitive benefits (major medical, vision, dental and LTD) and 401K matching program.",
    "raw_content": "<div> <p><span>OfferFit was founded by ex-McKinsey and BCG math PhDs, and we’re funded by leading Silicon Valley VCs. <a href=\"http://www.offerfit.ai/\">OfferFit</a> replaces A/B testing with AI testing, powered by reinforcement learning AI. This allows lifecycle marketers to test &amp; improve the performance of their campaigns much faster than before. Customers include leading brands like Brinks Home, Yelp, Chime, Engie, and MetLife, among many others.</span></p> <p><span><strong>Note for Applicants: </strong></span></p> <p><span><span><a href=\"https://hbr.org/2022/07/apply-to-a-job-even-if-you-dont-meet-all-criteria\"><span><span>Data shows that men on average apply for a role if they meet 6/10 requirements while women often only do so if it’s 10/10</span></span></a></span><span>. We work hard to be clear and specific about what our roles require, and we encourage you to apply even if you don’t check all the boxes! </span>Applying gives you the opportunity to be considered and we look forward to reviewing your application!</span></p> </div><p><span>Our Marketing team is expanding, and we’re excited to bring on a Director of Demand Generation to take ownership of developing and executing strategies that drive pipeline growth. In this role, you’ll work closely with the CMO and lead a skilled, high-potential team focused on engaging prospects at the earliest stages of their journey, creating a strong foundation for long-term success and sales impact.</span></p> <p><span><strong>In particular, you will:</strong></span></p> <ul> <li><span><strong>Lead strategic demand generation initiatives:</strong> Define, execute, and continuously optimize multi-channel marketing campaigns (including email, paid media, content syndication, webinars, and more) to drive brand awareness, lead acquisition, and sales pipeline growth.</span></li> <li><span><strong>Optimize marketing automation systems:</strong> Oversee the selection, implementation, and optimization of a marketing automation platform (e.g., Marketo, HubSpot) to segment audiences, deliver personalized campaigns, automate lead scoring, and track performance through comprehensive data analysis and reporting.</span></li> <li><span><strong>Develop targeted nurture programs:</strong> Create and manage end-to-end lead nurturing strategies to engage prospects, accelerate pipeline movement, and improve conversion and win rates, ensuring a seamless transition between marketing and sales.</span></li> <li><span><strong>Develop process for multi-touch attribution:</strong> Partner with RevOps to design and implement a multi-touch attribution model, ensuring that marketing efforts are effectively measured and aligned with sales outcomes, facilitating data-driven decision-making.</span></li> <li><span><strong>Align sales and marketing for revenue impact:</strong> Work closely with sales and marketing leadership to ensure alignment on lead quality, timely follow-up strategies, and continuous feedback loops that optimize pipeline velocity and drive toward shared revenue targets.</span></li> <li><span><strong>Build and mentor a high-performing team:</strong> Develop, coach, and scale the Demand Generation team, fostering a culture of accountability, creativity and results-driven performance.</span></li> </ul> <p><span><strong>Why it’s great:</strong></span></p> <ol> <li><span>You'll have a direct impact on OfferFit’s revenue growth, leading a critical function that sits at the intersection of marketing, sales, and RevOps. This is a high-visibility role with the potential to shape the future of the company’s go-to-market strategies.</span></li> <li><span>OfferFit is at the forefront of AI decisioning technology, providing a unique opportunity to work with cutting-edge solutions that are transforming the way businesses approach customer engagement and marketing.</span></li> <li><span>You'll be joining a fast-paced, collaborative environment that values innovation, learning, and continuous improvement. </span></li> </ol> <p><span><strong>Who's a fit?</strong></span></p> <ul> <li><span><strong>SaaS Extraordinaire:</strong> you’ve spent time in your driving demand and marketing SaaS products (MarTech or adjacent industries a plus)!</span></li> <li><span><strong>Problem solver:</strong> you recognize patterns, synthesize information and come up with creative, simple, and practical solutions</span></li> <li><span><strong>Structured and organized:</strong> you can structure a plan, align stakeholders, and see it through to execution</span></li> <li><span><strong>Collaborative and empathetic partner:</strong> you work well with internal stakeholders, understanding their needs and building solutions that match</span></li> <li><span><strong>Clear communicator: </strong>you are able to express yourself clearly and persuasively, both in writing and speech </span></li> <li><span><strong>Entrepreneurial:</strong> you proactively identify opportunities and risks, work around obstacles, and always seek creative ways to improve processes and outcomes</span></li> </ul> <p><span><strong>Additional Requirements: </strong></span></p> <ul> <li><span>Up to<strong> </strong>10-15% travel for company-wide quarterly gatherings, team offsite workshops, customer meetings, and industry-related events</span></li> <li><span>Ability to primarily overlap with North America time zones</span></li> <li><span>Strong fluency in English, both written and verbal</span></li> </ul> <p><span>The base salary range for this position in the United States is $197,000-$234,000 per year, plus eligibility for additional bonus ranging $29,000-$34,000; Eligibility for an additional end of year performance bonus, commissions (when applicable) and/or equity options may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, depending on the position offered. Please note that we adjust compensation for non–US countries using a relative cost of labor adjustment between the US and your country of residence. Applicants should apply via OfferFit’s internal or external careers site.</span></p> <p><span><strong>Company Benefits and Perks</strong></span></p> <ul> <li><span>Generous PTO (starting at 25 days PTO per year) and Parental Leave policy (12 weeks paid)</span></li> <li><span>100% remote work environment with flexible hours </span></li> <li><span>Quarterly gatherings where we meet in person in a different city to work together, bond as a team and celebrate our progress</span></li> <li><span>Weekly team events (lunch and learns, trivia, virtual escape rooms, town hall and team health “barometer” meetings)</span></li> <li><span>Ability to learn and develop from an experienced leadership team (ex-Amazon, McKinsey, BCG, and IBM, among others) who are focused on building a talented, diverse, and inclusive team</span></li> <li><span>Dedication to building a strong culture (e.g., team resource groups, weekly recognitions, major life event celebrations, mental health/sustainability days off, etc.)</span></li> <li><span>[US Only] Competitive benefits (major medical, vision, dental and LTD) and 401K matching program</span></li> </ul><div><p><span>OfferFit is committed to a diverse and inclusive workplace. OfferFit is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.</span></p></div>",
    "url": "https://jobs.av.vc/companies/offerfit/jobs/41748633-director-of-demand-generation",
    "created_at": "2025-01-24T10:15:14.209831+00:00"
  },
  {
    "id": "4b4b792d12ec9981fbcb",
    "title": "Head of Growth",
    "company": "Adaptive Teams",
    "location": "Multiple locations · Fully Remote",
    "salary": "Not specified",
    "description": "Drive growth, optimize revenue, and 10x ROI as our Head of Growth! Own experimentation, scale strategies, and make a direct impact with tangible results in a fast-paced e-commerce environment.",
    "requirements": [
      "Proven track record of driving growth and scaling revenue in e-commerce or digital marketing. Advanced skills in performance marketing",
      "paid media",
      "and optimization. Strong analytical mindset; expert in A/B testing",
      "experimentation",
      "and ROI tracking. Technical know-how with tools like Google Analytics",
      "CRM systems",
      "and ad platforms (Amazon PPC is a plus). Strategic thinker with the ability to operate independently",
      "yet collaboratively. Agile and iterative—comfortable in fast-moving",
      "experimental environments."
    ],
    "responsibilities": [
      "Design and execute growth strategies across acquisition",
      "retention",
      "and monetization to maximize ROI. Launch and manage rapid",
      "data-driven experiments to uncover high-impact growth levers. Lead performance marketing",
      "growth hacking",
      "and partnership efforts to scale revenue streams. Analyze metrics and identify trends to drive decision-making and strategy pivots. Collaborate with leadership to align growth initiatives with the company’s upmarket vision. Own the entire growth funnel—identify gaps",
      "drive optimizations",
      "and deliver results."
    ],
    "about_company": "At Adaptive Teams, we don’t just fill positions – we create pathways to success. Whether you’re a seasoned pro or just starting out, we’re here to help you grow, innovate, and make an impact. If you’re looking for exciting opportunities and, a team that’s as passionate as you are, this is the place to be.",
    "benefits": "Working completely remote, Location independence, 15 paid leave days, Quarterly bonus, Annual (performance-based) salary increase policy, Great opportunity to grow, You’ll be joining a high-level and fast-paced team, working with exciting businesses and projects",
    "raw_content": "{ \"@context\": \"http://schema.org/\", \"@type\": \"JobPosting\", \"title\": \"Head of Growth\", \"description\": \"&lt;p&gt;&lt;em&gt;&lt;/em&gt;Drive growth, optimize revenue, and 10x ROI as our Head of Growth! Own experimentation, scale strategies, and make a direct impact with tangible results in a fast-paced e-commerce environment.&lt;/p&gt;&lt;hr&gt;&lt;p&gt;&lt;strong&gt;Your Mission: Day to Day Responsibilities&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt; &lt;li&gt;Design and execute growth strategies across acquisition, retention, and monetization to maximize ROI.&lt;/li&gt; &lt;li&gt;Launch and manage rapid, data-driven experiments to uncover high-impact growth levers.&lt;/li&gt; &lt;li&gt;Lead performance marketing, growth hacking, and partnership efforts to scale revenue streams.&lt;/li&gt; &lt;li&gt;Analyze metrics and identify trends to drive decision-making and strategy pivots.&lt;/li&gt; &lt;li&gt;Collaborate with leadership to align growth initiatives with the company’s upmarket vision.&lt;/li&gt; &lt;li&gt;Own the entire growth funnel—identify gaps, drive optimizations, and deliver results.&lt;/li&gt; &lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Your Toolbox: Skills to be Successful&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt; &lt;li&gt;Proven track record of driving growth and scaling revenue in e-commerce or digital marketing.&lt;/li&gt; &lt;li&gt;Advanced skills in performance marketing, paid media, and optimization.&lt;/li&gt; &lt;li&gt;Strong analytical mindset; expert in A/B testing, experimentation, and ROI tracking.&lt;/li&gt; &lt;li&gt;Technical know-how with tools like Google Analytics, CRM systems, and ad platforms (Amazon PPC is a plus).&lt;/li&gt; &lt;li&gt;Strategic thinker with the ability to operate independently, yet collaboratively.&lt;/li&gt; &lt;li&gt;Agile and iterative—comfortable in fast-moving, experimental environments.&lt;/li&gt; &lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Your Perks: What&#39;s in it for you&lt;br&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt; &lt;li&gt;Working completely remote&lt;/li&gt; &lt;li&gt;Location independence&lt;/li&gt; &lt;li&gt;15 paid leave days&lt;/li&gt; &lt;li&gt;Quarterly bonus&lt;/li&gt; &lt;li&gt;Annual (performance-based) salary increase policy&lt;/li&gt; &lt;li&gt;Great opportunity to grow&lt;/li&gt; &lt;li&gt;You’ll be joining a high-level and fast-paced team, working with exciting businesses and projects&lt;/li&gt; &lt;/ul&gt;&lt;hr&gt;&lt;p&gt;&lt;strong&gt;Why Adaptive Teams?&lt;/strong&gt;&lt;br&gt;&lt;strong&gt;&lt;/strong&gt;At Adaptive Teams, we don’t just fill positions – we create pathways to success. Whether you’re a seasoned pro or just starting out, we’re here to help you grow, innovate, and make an impact. If you’re looking for exciting opportunities and, a team that’s as passionate as you are, this is the place to be.&lt;br&gt;&lt;/p&gt;&lt;hr&gt;&lt;p&gt;&lt;strong&gt;What to Expect from Our Application Process?&lt;/strong&gt;&lt;br&gt;Once you apply, you’ll &lt;strong&gt;receive an email&lt;/strong&gt; guiding you through the next steps, including an assessment tailored to the role. &lt;br&gt;&lt;br&gt;After that, we’ll ask you a few brief questions about your experiences and work style—this is your opportunity to showcase what makes you unique and how you approach challenges. Be sure to &lt;strong&gt;check your inbox&lt;/strong&gt; (and &lt;strong&gt;your spam folder&lt;/strong&gt;, just in case) for further instructions.&lt;br&gt;&lt;br&gt;We understand &lt;strong&gt;your time is valuable&lt;/strong&gt;, so we strive to keep the assessments &lt;strong&gt;under 45 minutes&lt;/strong&gt; whenever possible, though some roles may require a slightly longer time investment.&lt;br&gt;&lt;br&gt;Once selected, you’ll have the chance to &lt;strong&gt;schedule an interview&lt;/strong&gt; with our team. We aim to make the process as smooth and transparent as possible, so you’ll always know where you stand.&lt;/p&gt;\", \"identifier\": { \"@type\": \"PropertyValue\", \"name\": \"Adaptive Teams\", \"value\": \"5465333\" }, \"datePosted\": \"2025-01-22T10:16:26Z\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": { \"@type\": \"Organization\", \"name\": \"Adaptive Teams\", \"logo\": \"https://images.teamtailor-cdn.com/images/s3/teamtailor-production/logotype-v3/image_uploads/e3fb91f2-d6ca-4b7e-acde-78a772dfebb2/original.png\", \"sameAs\": \"https://adaptiveteams.teamtailor.com\" }, \"jobLocationType\": \"TELECOMMUTE\", \"jobLocation\": [{\"@type\":\"Place\",\"address\":{\"streetAddress\":null,\"addressLocality\":\"Tirana\",\"postalCode\":null,\"addressCountry\":\"AL\",\"addressRegion\":\"EMEA\",\"@type\":\"PostalAddress\"}},{\"@type\":\"Place\",\"address\":{\"streetAddress\":null,\"addressLocality\":\"Sarajevo\",\"postalCode\":null,\"addressCountry\":\"BA\",\"addressRegion\":\"EMEA\",\"@type\":\"PostalAddress\"}},{\"@type\":\"Place\",\"address\":{\"streetAddress\":null,\"addressLocality\":\"Zagreb\",\"postalCode\":null,\"addressCountry\":\"HR\",\"addressRegion\":\"EMEA\",\"@type\":\"PostalAddress\"}},{\"@type\":\"Place\",\"address\":{\"streetAddress\":null,\"addressLocality\":\"Kyiv\",\"postalCode\":\"02000\",\"addressCountry\":\"UA\",\"addressRegion\":\"EMEA\",\"@type\":\"PostalAddress\"}},{\"@type\":\"Place\",\"address\":{\"streetAddress\":null,\"addressLocality\":\"Amsterdam\",\"postalCode\":null,\"addressCountry\":\"NL\",\"addressRegion\":\"EMEA\",\"@type\":\"PostalAddress\"}},{\"@type\":\"Place\",\"address\":{\"streetAddress\":null,\"addressLocality\":\"Budapest\",\"postalCode\":null,\"addressCountry\":\"HU\",\"addressRegion\":\"EMEA\",\"@type\":\"PostalAddress\"}},{\"@type\":\"Place\",\"address\":{\"streetAddress\":null,\"addressLocality\":\"Bucharest\",\"postalCode\":null,\"addressCountry\":\"RO\",\"addressRegion\":\"EMEA\",\"@type\":\"PostalAddress\"}},{\"@type\":\"Place\",\"address\":{\"streetAddress\":\"United States\",\"addressLocality\":\"Austin\",\"postalCode\":null,\"addressCountry\":\"US\",\"addressRegion\":\"North America\",\"@type\":\"PostalAddress\"}},{\"@type\":\"Place\",\"address\":{\"streetAddress\":null,\"addressLocality\":\"Sofia\",\"postalCode\":null,\"addressCountry\":\"BG\",\"addressRegion\":\"EMEA\",\"@type\":\"PostalAddress\"}},{\"@type\":\"Place\",\"address\":{\"streetAddress\":null,\"addressLocality\":\"Belgrade\",\"postalCode\":null,\"addressCountry\":\"RS\",\"addressRegion\":\"EMEA\",\"@type\":\"PostalAddress\"}},{\"@type\":\"Place\",\"address\":{\"streetAddress\":\"United Kingdom\",\"addressLocality\":\"London\",\"postalCode\":null,\"addressCountry\":\"GB\",\"addressRegion\":\"EMEA\",\"@type\":\"PostalAddress\"}},{\"@type\":\"Place\",\"address\":{\"streetAddress\":null,\"addressLocality\":\"Warsaw\",\"postalCode\":\"03\",\"addressCountry\":\"PL\",\"addressRegion\":\"EMEA\",\"@type\":\"PostalAddress\"}}] } Marketing · Multiple locations · Fully Remote Ready to 10x growth? 🚀 We’re hiring a Head of Growth to own strategy, experiments, and ROI for an Amazon-focused e-commerce agency. Data-driven, agile, and impactful? Apply now! Apply Now! Drive growth, optimize revenue, and 10x ROI as our Head of Growth! Own experimentation, scale strategies, and make a direct impact with tangible results in a fast-paced e-commerce environment.Your Mission: Day to Day Responsibilities Design and execute growth strategies across acquisition, retention, and monetization to maximize ROI. Launch and manage rapid, data-driven experiments to uncover high-impact growth levers. Lead performance marketing, growth hacking, and partnership efforts to scale revenue streams. Analyze metrics and identify trends to drive decision-making and strategy pivots. Collaborate with leadership to align growth initiatives with the company’s upmarket vision. Own the entire growth funnel—identify gaps, drive optimizations, and deliver results. Your Toolbox: Skills to be Successful Proven track record of driving growth and scaling revenue in e-commerce or digital marketing. Advanced skills in performance marketing, paid media, and optimization. Strong analytical mindset; expert in A/B testing, experimentation, and ROI tracking. Technical know-how with tools like Google Analytics, CRM systems, and ad platforms (Amazon PPC is a plus). Strategic thinker with the ability to operate independently, yet collaboratively. Agile and iterative—comfortable in fast-moving, experimental environments. Your Perks: What's in it for you Working completely remote Location independence 15 paid leave days Quarterly bonus Annual (performance-based) salary increase policy Great opportunity to grow You’ll be joining a high-level and fast-paced team, working with exciting businesses and projects Why Adaptive Teams?At Adaptive Teams, we don’t just fill positions – we create pathways to success. Whether you’re a seasoned pro or just starting out, we’re here to help you grow, innovate, and make an impact. If you’re looking for exciting opportunities and, a team that’s as passionate as you are, this is the place to be.What to Expect from Our Application Process?Once you apply, you’ll receive an email guiding you through the next steps, including an assessment tailored to the role. After that, we’ll ask you a few brief questions about your experiences and work style—this is your opportunity to showcase what makes you unique and how you approach challenges. Be sure to check your inbox (and your spam folder, just in case) for further instructions.We understand your time is valuable, so we strive to keep the assessments under 45 minutes whenever possible, though some roles may require a slightly longer time investment.Once selected, you’ll have the chance to schedule an interview with our team. We aim to make the process as smooth and transparent as possible, so you’ll always know where you stand. Department Marketing Role Head of Growth Locations Multiple locations Remote status Fully Remote Employment type Full-time Adaptive Teams is proud to be part of a group of companies founded by Nate Ginsburg, built with a two-fold mission: to discover and empower amazing talent while building strong, connected communities all around the world. This vision drives everything we do, from the way we recruit to how we encourage collaboration across global teams. It’s not just about finding the right people for the job; it’s about creating meaningful work that contributes to something bigger.When you join Adaptive Teams, you’re stepping into a network that believes in the power of talent and community. We seek out individuals who are passionate, skilled, and ready to contribute to a larger purpose. Our projects allow you to showcase your abilities while making real connections across industries and geographies.Working with us means being part of a company that is committed to your growth and building thriving communities worldwide. If you’re looking to advance your career in an environment that values innovation and collaboration, Adaptive Teams is where you can truly flourish. Founded in 2023 Apply Now! Marketing · Multiple locations · Fully Remote Ready to 10x growth? 🚀 We’re hiring a Head of Growth to own strategy, experiments, and ROI for an Amazon-focused e-commerce agency. Data-driven, agile, and impactful? Apply now! Loading application form Let’s recruit together and find your next colleague. gopremiermedia.com adaptiveteams.co function trackPageView(url) { var searchParams = new URLSearchParams(window.location.search); var utmSource = searchParams.get('utm_source'); window.referrer = window.referrer || utmSource || document.referrer var payload = { ed: 'qLlcjsFxSxqW7tF+Wun9fMc8Jy9Nj2hebI7N1dCdlRAWXOo5kC+YjJCDtQKl1hhuThmvEPoCPqH7C2/U+ZAz8jYqQTjoPj9lN9QRkfzFB4RAHuUxSSY2QY6sS7RBgHCZgmpWWiDf2BN5znQ7qM+7xUE9n19RCu9MeDIxRy+enzpWWg3Sqcbkkwl1ia5sjGdtMbQtVWU6TvKRE2y/ckW3d7/9C8eL3ZHNyjwdMHMK3C7ab46pUBE2KsLBfVxhMrLlBqFoHAc6qTory6lC6fwwjD762w8ngyX8V9KXEBN3hZJ3Fw/ERl48rLi6WlrahCkMhwro6S0HVvruPAQLhx+5l9zkEL2Dmw654sEc83yd4xJCrpoU11/xjo42LjwWcd0AMQwuGQ==--W8SdHeX7XFVK7KCN--6BAn51yGIOOKNT+1d/GO4Q==', visitor_uuid: window.visitor_uuid, referrer: window.referrer, data: { ua: navigator.userAgent, }, url: url, }; var xmlhttp = new XMLHttpRequest(); xmlhttp.open('POST', '/pageview', true); xmlhttp.setRequestHeader('Content-Type', 'application/json;charset=UTF-8'); xmlhttp.withCredentials = true; xmlhttp.addEventListener('readystatechange', function () { if (xmlhttp.readyState === XMLHttpRequest.DONE) { const status = xmlhttp.status; if (status === 0 || (status >= 200 && status < 400)) { window.visitor_uuid = xmlhttp.responseText; } } }) xmlhttp.send(JSON.stringify(payload)); } window.trackPageView = trackPageView; if (!window.analyticsPageviewCallback) { window.analyticsPageviewCallback = true; window.addEventListener('turbo:load', function(data){ window.trackPageView(); }); }",
    "url": "https://adaptiveteams.teamtailor.com/jobs/5465333-head-of-growth",
    "created_at": "2025-01-23T13:44:01.623284+00:00"
  },
  {
    "id": "53866cbda64306acddd6",
    "title": "Vice President of Corporate Marketing",
    "company": "Arcesium",
    "location": "Remote eligible states include: NY, NJ, MA, MN, IL, FL, TX, OH, PA, CT, NC, CA, GA",
    "salary": "$170,000.00 - $220,000.00 annual base salary, including variable compensation in the form of a year-end bonus, guaranteed in the first year of hire, benefits including medical and prescription drug coverage, and 401k contribution matching",
    "description": "Lead marketing communications efforts and drive strategic initiatives across multiple channels to enhance brand awareness and support revenue growth.",
    "requirements": [
      "Bachelor's degree in Marketing, Communications, Journalism, or a related field; MBA preferred",
      "10+ years of progressive experience in corporate marketing roles, with at least 5 years in a leadership position",
      "Strong writing and communication skills",
      "Proven track record of developing and executing successful marketing communication strategies",
      "Experience in public relations, media relations, analyst relations, partner marketing, customer marketing, events management, and social media marketing",
      "Exceptional strategic thinking and analytical skills",
      "Demonstrated leadership capabilities",
      "Outstanding communication and interpersonal skills",
      "Experience working at an Enterprise SaaS company required; experience in the Financial Technology industry is a plus",
      "Results-oriented mindset"
    ],
    "responsibilities": [
      "Develop and execute comprehensive marketing communication strategies",
      "Drive thought leadership initiatives",
      "Manage the company's blog",
      "Oversee public relations and media relations activities",
      "Cultivate and maintain relationships with industry analysts",
      "Collaborate with partners to develop joint marketing programs",
      "Develop and execute customer marketing programs",
      "Plan and oversee all corporate events",
      "Lead social media marketing efforts"
    ],
    "about_company": "Arcesium is a global financial technology firm that solves complex data-driven challenges faced by some of the world’s most sophisticated financial institutions. The company values intellectual curiosity, proactive ownership, and collaboration with colleagues, empowering employees to meaningfully contribute from day one and accelerate professional development.",
    "benefits": "Variable compensation in the form of a year-end bonus, guaranteed in the first year of hire, benefits including medical and prescription drug coverage, and 401k contribution matching",
    "raw_content": "Back to jobs Company Overview Arcesium is a global financial technology firm that solves complex data-driven challenges faced by some of the world’s most sophisticated financial institutions. We constantly innovate our platform and capabilities to meet tomorrow’s challenges, anticipate the risks our clients encounter, and design advanced solutions to help our clients achieve transformational business outcomes. Financial technology is a high-growth industry as change and innovation continue to disrupt the status-quo and prompt major transformation. Arcesium is at a particularly interesting time in our own growth as we look to leverage our successfully established market position and expand operations in pursuit of strategic new business opportunities. We value intellectual curiosity, proactive ownership, and collaboration with colleagues, and we empower you to meaningfully contribute from day one and accelerate your professional development.Position Summary We are seeking an experienced and dynamic Vice President of Corporate Marketing to lead our marketing communications efforts and drive strategic initiatives across multiple channels. The ideal candidate will possess exceptional writing and communication skills, with a proven track record of developing compelling content, thought leadership pieces, and engaging marketing campaigns. The VP of Corporate Marketing will be responsible for overseeing marketing communications, thought leadership, blog management, public relations, analyst relations, partner marketing, customer marketing, events management, and social media marketing to enhance brand awareness, and support revenue growth.Responsibilities Develop and execute comprehensive marketing communication strategies to effectively convey the company's value proposition, key messages, and thought leadership content to target audiences. Drive thought leadership initiatives by identifying industry trends, conducting market research, and collaborating with subject matter experts to develop insightful content and establish the company as a trusted authority in the industry. Manage the company's blog, including content strategy, editorial calendar, and contributor outreach, to drive website traffic, increase brand visibility, and nurture leads. Oversee public relations and media relations activities, including press releases, media pitches, and interview opportunities, to secure media coverage and enhance brand reputation. Cultivate and maintain relationships with industry analysts to ensure positive market perception, drive analyst coverage, and support sales and marketing efforts. Collaborate with partners to develop joint marketing programs that drive awareness, generate leads, and accelerate sales cycles. Develop and execute customer marketing programs, including testimonials, case studies, and user-generated content, to drive retention, advocacy, and upsell opportunities. Plan and oversee all corporate events, including conferences, trade shows, webinars, and customer events, to maximize brand exposure and lead generation. Lead social media marketing efforts to increase engagement, expand reach, and amplify the company's message across relevant platforms. Qualifications Bachelor's degree in Marketing, Communications, Journalism, or a related field; MBA preferred. 10+ years of progressive experience in corporate marketing roles, with at least 5 years in a leadership position and a focus on marketing communications, content marketing, and digital marketing. Strong writing and communication skills, with the ability to craft compelling narratives, thought leadership pieces, and marketing content that resonates with target audiences. Proven track record of developing and executing successful marketing communication strategies, thought leadership initiatives, and content marketing campaigns. Experience in public relations, media relations, analyst relations, partner marketing, customer marketing, events management, and social media marketing. Exceptional strategic thinking, analytical skills, and the ability to translate marketing objectives into actionable plans. Demonstrated leadership capabilities, including the ability to inspire and motivate cross-functional teams to achieve common goals. Outstanding communication and interpersonal skills, with the ability to influence and build relationships at all levels of the organization. Experience working at an Enterprise SaaS company required and experience in the Financial Technology industry is a plus. Results-oriented mindset with a strong focus on driving measurable business outcomes. The expected annual base salary for this position is $170,000.00 - $220,000.00. Our compensation package includes variable compensation in the form of a year-end bonus, guaranteed in the first year of hire, benefits including medical and prescription drug coverage, and 401k contribution matching. The applicable annual base salary paid to a successful applicant will be determined based on multiple factors including without limitation the nature and extent of prior experience and educational background. Remote eligible states include: NY, NJ, MA, MN, IL, FL, TX, OH, PA, CT, NC, CA, GA Arcesium's Personal Data Privacy Notice for Candidates is linked here. #LI-HM1#LI-RemoteArcesium and its affiliates do not discriminate in employment matters on the basis of race, color, religion, gender, gender identity, pregnancy, national origin, age, military service eligibility, veteran status, sexual orientation, marital status, disability, or any other category protected by law. Note that for us, this is more than just a legal boilerplate. We are genuinely committed to these principles, which form an important part of our corporate culture, and are eager to hear from extraordinarily well qualified individuals having a wide range of backgrounds and personal characteristics.",
    "url": "https://job-boards.greenhouse.io/arcesiumllc/jobs/4621276007",
    "created_at": "2025-01-23T11:29:20.115431+00:00"
  },
  {
    "id": "63061fd5a1f06b3c3266",
    "title": "Brand Strategy Leader",
    "company": "Penta Group",
    "location": "Not specified (Remote status not mentioned)",
    "salary": "Not specified",
    "description": "Penta Group is seeking a Brand Strategy Leader with extensive experience in brand strategy, marketing, advertising, or a related creative field. The role involves leading, mentoring, and motivating multiple teams, prioritizing multiple competing priorities, and embracing new challenges. The candidate will work within Penta Brand Strategy, the firm's in-house advertising and creative agency, blending analytical and communications expertise with storytelling, design, and technology.",
    "requirements": [
      "15+ years of professional experience in brand strategy, marketing, advertising, or a related creative field, including 10+ years of personnel management experience.",
      "Demonstrated ability to lead, mentor, and motivate multiple talented, high-achieving teams at once, empowering different types of personalities with a team-first mentality.",
      "Excellent verbal and written communication and presentation skills.",
      "Demonstrated ability to prioritize multiple, competing priorities.",
      "Willingness to learn new skills and participate in new projects, leading by example and embracing new challenges.",
      "Proficiency in Microsoft Office Suite to include Word, Excel, and PowerPoint.",
      "Experience working in a client service environment under a multi-client support model.",
      "Previous work on public affairs or public awareness campaigns, or on complex campaigns surrounding issues like healthcare, finance, agriculture, or technology is preferred.",
      "Previous work experience in a professional services organization is preferred.",
      "Experience working on, and managing, remote teams is preferred."
    ],
    "responsibilities": [
      "Not explicitly listed in the provided job posting."
    ],
    "about_company": "Penta Group is the world's first comprehensive stakeholder solutions firm that provides data-driven solutions for stakeholder strategy and engagement. Penta works with clients solving complex global challenges across a variety of industries. Penta Brand Strategy is the firm's in-house advertising and creative agency, blending analytical and communications expertise with storytelling, design, and technology.",
    "benefits": "Excellent health care, vision, and dental coverage provided by United Healthcare with the majority of individual employee premiums and 50% of dependent premiums covered by Penta Group.\nCompetitive retirement benefits with a 401(k) match of 100% up to 3% of an employee’s deferred salary, and 50% of the next 2% deferred.\nEmployer paid short term disability, long term disability, and life insurance, with the option to buy additional coverage.\nTwelve weeks paid parental leave.\nMonthly stipend for cell phone.\nGenerous paid time off and holiday schedule.\nFrequent firm-wide social events and activities.\nExcellent environment for learning and growth.",
    "raw_content": "<p>Description:</p><ul><li> Penta Group is the world's first comprehensive stakeholder solutions firm that provides data-driven solutions for stakeholder strategy and engagement.</li><li> Penta works with clients solving complex global challenges across a variety of industries.</li><li> Penta Brand Strategy is the firm's in-house advertising and creative agency, blending analytical and communications expertise with storytelling, design, and technology.</li></ul><p>Requirements:</p><ul><li> 15+ years of professional experience in brand strategy, marketing, advertising, or a related creative field, including 10+ years of personnel management experience.</li><li> Demonstrated ability to lead, mentor, and motivate multiple talented, high-achieving teams at once, empowering different types of personalities with a team-first mentality.</li><li> Excellent verbal and written communication and presentation skills.</li><li> Demonstrated ability to prioritize multiple, competing priorities.</li><li> Willingness to learn new skills and participate in new projects, leading by example and embracing new challenges.</li><li> Proficiency in Microsoft Office Suite to include Word, Excel, and PowerPoint.</li><li> Experience working in a client service environment under a multi-client support model.</li><li> Previous work on public affairs or public awareness campaigns, or on complex campaigns surrounding issues like healthcare, finance, agriculture, or technology is preferred.</li><li> Previous work experience in a professional services organization is preferred.</li><li> Experience working on, and managing, remote teams is preferred.</li></ul><p>Benefits:</p><ul><li> Excellent health care, vision, and dental coverage provided by United Healthcare with the majority of individual employee premiums and 50% of dependent premiums covered by Penta Group.</li><li> Competitive retirement benefits with a 401(k) match of 100% up to 3% of an employee’s deferred salary, and 50% of the next 2% deferred.</li><li> Employer paid short term disability, long term disability, and life insurance, with the option to buy additional coverage.</li><li> Twelve weeks paid parental leave.</li><li> Monthly stipend for cell phone.</li><li> Generous paid time off and holiday schedule.</li><li> Frequent firm-wide social events and activities.</li><li> Excellent environment for learning and growth.</li></ul>",
    "url": "https://www.remoterocketship.com/company/penta-group/jobs/managing-director-brand-strategy-united-states",
    "created_at": "2025-01-27T16:27:24.731028+00:00"
  },
  {
    "id": "63b551b703f7ed612546",
    "title": "Director of eCommerce",
    "company": "Blueprint",
    "location": "Not explicitly stated (assume remote or flexible based on context)",
    "salary": "$160k- $200K/year",
    "description": "The Director of eCommerce will be responsible for building an accretive and growth-driving direct-to-consumer (D2C) eCommerce business for Blueprint. This includes developing and executing a plan to establish a best-in-class D2C business, focusing on priority brand and market combinations, demand creation, website technology implementation, and leveraging KPIs and data for continuous improvement.",
    "requirements": [
      "An extensive proven track-record of strategic development",
      "either with a comparable brand or in a FMCG environment. Commercial experience and sound business and finance understanding. Ecommerce/CMS platform experience is essential",
      "with ability to troubleshoot and problem solve if necessary. Minimum 7 years DTC",
      "CRM and marketplace experience. Experience in optimizing Performance Marketing strategies and campaigns across Search",
      "Affiliate",
      "Retargeting",
      "Paid Social",
      "Programmatic",
      "and SEO channels to maximize ROI. Experience in content creation for digital channels. Experience of managing and directing website Technical Structure",
      "Design & Aesthetics",
      "Content",
      "Navigation",
      "Information Architecture",
      "Branding/Marketing",
      "Performance",
      "and Functionality efforts to positively impact e-commerce efforts. Dynamic presentation skills and ability to collaborate effectively at all levels. Experience of mentoring",
      "developing and managing exceptional teams. Instinctive commercial flair to drive decisions that improve KPIs and performance. Enthusiasm",
      "energy",
      "determination and a passion for ecommerce and all things digital. Strong diplomacy and interpersonal skills",
      "able to influence across a cross-section of disciplines",
      "stakeholders",
      "external partners and talent. Proven leadership skills & performance driven through people. Ability / experience of working in different countries and/or business models. Understanding/ appreciation of retail and/or salon professional environments. Self-starter",
      "comfortable with leading tasks from the outset and working around roadblocks. Highly organized multi-tasker who is capable of juggling a number of priorities with the ability to work effectively under pressure within deadlines."
    ],
    "responsibilities": [
      "Be the Owner and Creator of the Blueprint Direct-to-Consumer E-Commerce Business. KPI and Analytics Obsessed: Drive business profitability with a focus on first-touch attribution while integrating second and third-touch metrics for deeper insights. Customer Experience Leadership: Own and manage the end-to-end customer experience",
      "including design and aesthetics",
      "content",
      "navigation",
      "information architecture",
      "branding/marketing",
      "performance",
      "and functionality of the site. Acquisition and Retention Strategy: Develop and execute comprehensive customer acquisition and retention strategies to grow the business sustainably. Digital Marketing Expertise: Provide thought leadership and innovation in SEO",
      "SEM",
      "CRM",
      "PPC",
      "and internet marketing",
      "driving continuous process improvement. Website Management: Oversee user experience",
      "including site navigation",
      "content development",
      "checkout funnel optimization",
      "and promotional campaigns. Content Execution: Plan",
      "QA",
      "and execute website content and online marketing campaigns to ensure efficiency",
      "accuracy",
      "and timeliness of all web content publishing. Digital Content Creation: Drive the development of digital content across web",
      "paid social",
      "influencer marketing",
      "affiliate programs",
      "and email channels. Brand Collaboration: Work closely with the Marketing team to amplify the brand through best-in-class creative initiatives and brand awareness strategies. Web Analytics Oversight: Manage all aspects of e-commerce web analytics and communicate insights to team members",
      "executive leadership",
      "and cross-functional partners. Cross-Functional Partnerships: Collaborate with key teams to ensure e-commerce projects align with company goals and strategies. Team and Agency Management: Build and lead a cohesive team of internal and external personnel/agencies to develop and implement effective e-commerce solutions. Sales and Marketing Innovation: Generate and execute new sales and marketing initiatives to boost e-commerce sales and profitability. Opportunity Identification: Explore and identify new e-commerce opportunities beyond current organizational strategies. Referral Program: Oversee the execution and optimization of the 'Refer a Friend' program to drive customer acquisition and engagement."
    ],
    "about_company": "Blueprint is an endeavor to stop aging and evolve from H. sapiens to H. evolutis. Founded by Bryan Johnson, who has become the world's most measured human, Blueprint is methodically built on science. Bryan freely shares his protocol, learnings, and data with everyone to use. Blueprint has also developed a family of nutritional products to make the benefits of the Blueprint protocol affordable and available to all. We’re a small, tight-knit team that works together to solve big problems. We innovate quickly, work efficiently, and have a lot of fun.",
    "benefits": "Not explicitly stated beyond salary range.",
    "raw_content": "Blueprint is an endeavor to stop aging and evolve from H. sapiens to H. evolutis. Blueprint was founded by Bryan Johnson, who has become the world's most measured human. On Blueprint, Bryan has achieved the cardiovascular health equal to the top 1.5% of 18 year olds, has slowed his speed of aging so that now he accumulates aging damage slower than 88% of 18 year olds and has over 50 optimal biomarkers. Blueprint is methodically built on science. Bryan freely shares his protocol, learnings and data with everyone to use. Blueprint has also developed a family of nutritional products to make the benefits of the Blueprint protocol affordable and available to all. We’re a small, tight-knit team that works together to solve big problems. We innovate quickly, work efficiently, and have a lot of fun. The Director of eCommerce, reporting to the Chief Growth Officer, will be responsible for building an accretive and growth -driving direct-to-consumer (D2C) eCommerce business for Blueprint. They will develop and execute a plan to establish a best-in-class D2C business, focusing on priority brand and market combinations. This includes demand creation, website technology implementation, and leveraging KPIs and data for continuous improvement. We have ambitious goals for this business, aiming to build a $500 million enterprise over the next five years. Requirements Position Responsibilities: Be the Owner and Creator of the Blueprint Direct-to-Consumer E-Commerce Business KPI and Analytics Obsessed: Drive business profitability with a focus on first-touch attribution while integrating second and third-touch metrics for deeper insights. Customer Experience Leadership: Own and manage the end-to-end customer experience, including design and aesthetics, content, navigation, information architecture, branding/marketing, performance, and functionality of the site. Acquisition and Retention Strategy: Develop and execute comprehensive customer acquisition and retention strategies to grow the business sustainably. Digital Marketing Expertise: Provide thought leadership and innovation in SEO, SEM, CRM, PPC, and internet marketing, driving continuous process improvement. Website Management: Oversee user experience, including site navigation, content development, checkout funnel optimization, and promotional campaigns. Content Execution: Plan, QA, and execute website content and online marketing campaigns to ensure efficiency, accuracy, and timeliness of all web content publishing. Digital Content Creation: Drive the development of digital content across web, paid social, influencer marketing, affiliate programs, and email channels. Brand Collaboration: Work closely with the Marketing team to amplify the brand through best-in-class creative initiatives and brand awareness strategies. Web Analytics Oversight: Manage all aspects of e-commerce web analytics and communicate insights to team members, executive leadership, and cross-functional partners. Cross-Functional Partnerships: Collaborate with key teams to ensure e-commerce projects align with company goals and strategies. Team and Agency Management: Build and lead a cohesive team of internal and external personnel/agencies to develop and implement effective e-commerce solutions. Sales and Marketing Innovation: Generate and execute new sales and marketing initiatives to boost e-commerce sales and profitability. Opportunity Identification: Explore and identify new e-commerce opportunities beyond current organizational strategies. Referral Program: Oversee the execution and optimization of the \"Refer a Friend\" program to drive customer acquisition and engagement. Skills & Qualifications: An extensive proven track-record of strategic development, either with a comparable brand or in a FMCG environment Commercial experience and sounds business and finance understanding A creative thinker - ready to push boundaries and make decisions based on tangible facts and information Ecommerce/CMS platform experience is essential, with ability to troubleshoot and problem solve if necessary. Experience with - must have: Minimum 7 years DTC, CRM and market place, nice to have: B2C or B2B2C e-commerce depending on your focus. Experience in optimizing Performance Marketing strategies and campaigns across Search, Affiliate, Retargeting, Paid Social, Programmatic, and SEO channels to maximize ROI Experience in content creation for digital channels Experience of managing and directing website Technical Structure, Design & Aesthetics, Content, Navigation, Information Architecture, Branding/Marketing, Performance, and Functionality efforts to positively impact e-commerce efforts Dynamic presentation skills and ability to collaborate effectively at all levels Experience of mentoring, developing and managing exceptional teams Instinctive commercial flair to drive decisions that improve KPIs and performance Enthusiasm, energy, determination and a passion for ecommerce and all things digital Strong diplomacy and interpersonal skills, able to influence across a cross-section of disciplines, stakeholders, external partners and talent Proven leadership skills & performance driven through people Ability / experience of working in different countries and/or business models Understanding/ appreciation of retail and/or salon professional environments Self-starter, comfortable with leading tasks from the outset and working around roadblocks Highly organized multi-tasker who is capable of juggling a number of priorities with the ability to work effectively under pressure within deadlines Benefits Salary Range: $160k- $200K/year",
    "url": "https://www.simplyhired.com/job/DgeJCfenAuXryVKYHFpClga-u3tSjpDq5PZ4LIAVfbjghTXaz1U2wA",
    "created_at": "2025-01-29T22:49:44.985517+00:00"
  },
  {
    "id": "6bee23ed33409b795de6",
    "title": "Head of Partnerships",
    "company": "OfferFit",
    "location": "100% remote work environment with flexible hours",
    "salary": "Base salary range in the United States is $156,700-$193,300 per year, plus eligibility for additional commission/bonus ranging $78,000-$97,000, with an overall OTE of $234,700-$290,300; Eligibility for an additional end of year performance bonus, commissions (when applicable) and/or equity options may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, depending on the position offered. For non-US based candidates, base pay and overall compensation packages will be adjusted based on location.",
    "description": "The Head of Partnerships will work directly with the CFO to strategize, design, and scale the partnership function. This role involves owning the Channel Partnerships program end-to-end, building and implementing a prioritized roadmap to nurture and convert channel partner opportunities into active sales conversations, and developing strong relationships within partner organizations.",
    "requirements": [
      "Efficiency machine -- master of time management, able to self-prioritize, and have a bias for action",
      "Structured and organized -- can structure a plan, align stakeholders including c-level executives, and see it through to execution",
      "Clear communicator -- able to express yourself clearly and professionally with great detail, both verbally and through writing",
      "People person -- can build trusting relationships with stakeholders while getting things done, and combine empathy with a willingness to have direct, challenging conversations",
      "Data-driven -- move and make decisions with insights based on detailed research and data analysis. Resilient in collecting the data needed for analysis",
      "Willing to roll up sleeves – can effectively navigate between high-level strategic conversations and remain close to the details on the ground without skipping a beat",
      "Travel requirements - Up to 20% travel for company-wide quarterly gatherings, conferences, team offsite workshops, partner meetings, and industry-related events",
      "Can work during US time-zone friendly business hours",
      "Native English speaker"
    ],
    "responsibilities": [
      "Own our Channel Partnerships program end-to-end, including defining and executing our partnerships strategy",
      "Build and implement a prioritized roadmap to nurture and convert channel partner opportunities into active sales conversations, identify priority partners and generate sales pipeline",
      "Develop strong relationships within partner organizations to identify the right individuals to progress partnership work, unblock collaboration, etc."
    ],
    "about_company": "OfferFit is pioneering self-learning AI in marketing technology, a rapidly growing $120B industry. The company is known for its fast-paced, supportive, and professional team environment, with a strong focus on building a talented, diverse, and inclusive team. The leadership team has experience from Amazon, McKinsey, BCG, and IBM, among others.",
    "benefits": "Generous PTO (starting at 25 days PTO per year) and Parental Leave policy (12 weeks paid)\n100% remote work environment with flexible hours\nQuarterly gatherings where we meet in person in a different city to work together, bond as a team and celebrate our progress\nWeekly team events (lunch and learns, trivia, virtual escape rooms, town hall and team health “barometer” meetings)\nAbility to learn and develop from an experienced leadership team (ex-Amazon, McKinsey, BCG, and IBM, among others) who are focused on building a talented, diverse, and inclusive team\nDedication to building a strong culture (e.g., team resource groups, weekly recognitions, major life event celebrations, mental health/sustainability days off, etc.)\nCompetitive Employee benefits (major medical, vision, dental and LTD) and 401K matching program",
    "raw_content": "<p><span style=\"font-size: 12pt;\">We are excited to hire our first Head of Partnerships! You'll work directly with the CFO (ex-McKinsey, ex-Amazon) to strategize, design and scale our partnership function.</span></p>\n<p><span style=\"font-size: 12pt;\"><strong>In particular, you will:</strong></span></p>\n<ul>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Own our Channel Partnerships program end-to-end, including defining and executing our partnerships strategy</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Build and implement a prioritized roadmap to nurture and convert channel partner opportunities into active sales conversations, identify priority partners and generate sales pipeline</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Develop strong relationships within partner organizations to identify the right individuals to progress partnership work, unblock collaboration, etc.&nbsp;</span></li>\n</ul>\n<p><span style=\"font-size: 12pt;\"><strong>Why is it great?</strong></span></p>\n<ol>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Create large-scale impact and learn how to build out a company’s partnership engine -- this is one of the most crucial components of OfferFit’s long-term success both on the commercial as well as product side and directly contributes to our growth!</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Learn from senior advisors and McKinsey alumni -- gain firsthand experience working with our board of advisors, the CEO and CFO (both ex-McKinsey) to develop your professional and soft skills</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Be part of a category-creating company in an exciting field -- we are pioneering self-learning AI in marketing technology, a rapidly growing $120B industry</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Join OfferFit’s fast-paced, supportive, and professional team -- we work hard to ensure all our team members have a great experience and feel empowered</span></li>\n</ol>\n<p><span style=\"font-size: 12pt;\"><strong>Who’s a fit?</strong></span></p>\n<ul>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Efficiency machine -- you are a master of time management and make every minute count. You are able to self-prioritize and have a bias for action</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Structured and organized -- you can structure a plan, align stakeholders including c-level executives, and see it through to execution</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Clear communicator -- you are able to express yourself clearly and professionally with great detail, both verbally and through writing</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">People person -- you can build trusting relationships with stakeholders while getting things done, and combine empathy with a willingness to have direct, challenging conversations</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Data-driven -- you move and make decisions with insights based on detailed research and data analysis. You are resilient in collecting the data needed for analysis</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Willing to roll up sleeves – you can effectively navigate between high-level strategic conversations and remain close to the details on the ground without skipping a beat!</span></li>\n</ul>\n<p><span style=\"font-size: 12pt;\"><strong>Additional Requirements:&nbsp;</strong></span></p>\n<ul>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Travel requirements - Up to<strong> </strong>20% travel for company-wide quarterly gatherings, conferences, team offsite workshops, partner meetings, and industry-related events</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Can work during US time-zone friendly business hours</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Native English speaker</span></li>\n</ul>\n<p><span style=\"font-size: 12pt;\">The base salary range for this position in the United States is $156,700-$193,300 per year, plus eligibility for additional commission/bonus ranging $78,000-$97,000, with an overall OTE of $234,700-$290,300; Eligibility for an additional end of year performance bonus, commissions (when applicable) and/or equity options may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, depending on the position offered. For non-US based candidates, base pay and overall compensation packages will be adjusted based on location. Applicants should apply via OfferFit’s internal or external careers site.</span></p>\n<p><span style=\"font-size: 12pt;\"><strong>Company Benefits and Perks</strong></span></p>\n<ul>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Generous PTO (starting at 25 days PTO per year) and Parental Leave policy (12 weeks paid)</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">100% remote work environment with flexible hours&nbsp;</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Quarterly gatherings where we meet in person in a different city to work together, bond as a team and celebrate our progress</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Weekly team events (lunch and learns, trivia, virtual escape rooms, town hall and team health “barometer” meetings)</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Ability to learn and develop from an experienced leadership team (ex-Amazon, McKinsey, BCG, and IBM, among others) who are focused on building a talented, diverse, and inclusive team</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Dedication to building a strong culture (e.g., team resource groups, weekly recognitions, major life event celebrations, mental health/sustainability days off, etc.)</span></li>\n<li style=\"font-size: 12pt;\"><span style=\"font-size: 12pt;\">Competitive Employee benefits (major medical, vision, dental and LTD) and 401K matching program&nbsp;</span></li>\n</ul>",
    "url": "https://boards.greenhouse.io/offerfit/jobs/4512184005",
    "created_at": "2025-01-24T11:43:06.384093+00:00"
  },
  {
    "id": "6e878090eabe3cf85b7a",
    "title": "AVP of Workplace B2B Customer Engagement",
    "company": "Voya",
    "location": "Not specified",
    "salary": "Not specified",
    "description": "Responsible for the development and execution of lifecycle marketing strategy, driving Voya’s acquisition, adoption and retention strategy through B2B channels, spearheading transformation of channels and customer engagement to drive measurable ROI, and supporting Voya’s culture by attracting, retaining, and engaging a diverse workforce.",
    "requirements": [
      "15+ years of progressive experience in B2B or B2B2C marketing roles within financial services, insurance, or related industries.",
      "Experience in Retirement, Health/Group Benefits, and Retail Wealth Management is a plus.",
      "7+ years of experience in Email, Marketing Automation and CRM.",
      "Bachelor's degree in marketing, business administration, or a related field. MBA preferred.",
      "Proven experience in a similar senior marketing role, preferably in financial services or healthcare industry.",
      "Marketing agency experience also desirable.",
      "Proven track record of success in developing and executing strategic marketing initiatives that drive business growth and achieve revenue targets.",
      "Strong understanding of the B2B sales cycle for the retirement, group benefits, benefit administration and retail businesses and experience collaborating with distribution to drive lead generation, conversion, retention, and deeper share of wallet.",
      "Knowledge of CX methodologies and frameworks that help put the customer first.",
      "Demonstrated success in developing and executing comprehensive marketing strategies that drive business growth and enhance brand awareness.",
      "In-depth knowledge of marketing principles, market research, and data analysis.",
      "Proficiency in digital marketing techniques, including SEO, SEM, ABM, social media marketing, and content marketing.",
      "Excellent leadership skills with the ability to inspire and motivate cross-functional teams.",
      "Strategic thinker with a data-driven mindset and the ability to translate market insights into actionable marketing strategies.",
      "Exceptional communication skills with the ability to articulate complex concepts clearly and persuasively.",
      "Strong executive presence with excellent written and verbal communication skills.",
      "Adept at operating in a matrixed environment.",
      "Strong problem-solving skills.",
      "Demonstrated ability to thrive in a fast-paced, dynamic environment and effectively manage multiple priorities and deadlines.",
      "Track record of innovation and customer-centric solution building.",
      "Experience developing strategic vision for a function and prioritizing critical needs required to lead a team to best-in-class delivery.",
      "Inclusive leadership and commitment to developing strong, diverse teams."
    ],
    "responsibilities": [
      "Development and execution of lifecycle marketing strategy.",
      "Driving Voya’s acquisition, adoption and retention strategy through B2B channels.",
      "Spearheading transformation of channels and customer engagement to drive measurable ROI.",
      "Establishing meaningful metrics and KPIs, and driving detailed impact analyses with continuous improvement.",
      "Supporting Voya’s culture by attracting, retaining, and engaging a diverse workforce."
    ],
    "about_company": "Not specified",
    "benefits": "Health, dental, vision and life insurance plans.\n401(k) Savings plan – with generous company matching contributions (up to 6%).\nVoya Retirement Plan – employer paid cash balance retirement plan (4%).\nTuition reimbursement up to $5,250/year.\nPaid time off – including 20 days paid time off, nine paid company holidays and a flexible Diversity Celebration Day.\nPaid volunteer time — 40 hours per calendar year.",
    "raw_content": "<p>Description:</p><ul><li> As the AVP of Workplace B2B Customer Engagement, you will be responsible for the development and execution of lifecycle marketing strategy.</li><li> Reporting to the VP of Workplace B2B Marketing, you will drive Voya’s acquisition, adoption and retention strategy through B2B channels.</li><li> You will spearhead transformation of our channels and customer engagement to drive measurable ROI and successful go-to-market planning.</li><li> You’ll establish meaningful metrics and KPIs, and drive detailed impact analyses with continuous improvement.</li><li> You will also support Voya’s culture by attracting, retaining, and engaging a diverse workforce.</li></ul><p>Requirements:</p><ul><li> 15+ years of progressive experience in B2B or B2B2C marketing roles within financial services, insurance, or related industries.</li><li> Experience in Retirement, Health/Group Benefits, and Retail Wealth Management is a plus.</li><li> 7+ years of experience in Email, Marketing Automation and CRM</li><li> Bachelor's degree in marketing, business administration, or a related field. MBA preferred</li><li> Proven experience in a similar senior marketing role, preferably in financial services or healthcare industry.</li><li> Marketing agency experience also desirable.</li><li> Proven track record of success in developing and executing strategic marketing initiatives that drive business growth and achieve revenue targets.</li><li> Strong understanding of the B2B sales cycle for the retirement, group benefits, benefit administration and retail businesses and experience collaborating with distribution to drive lead generation, conversion, retention, and deeper share of wallet.</li><li> Knowledge of CX methodologies and frameworks that help put the customer first.</li><li> Demonstrated success in developing and executing comprehensive marketing strategies that drive business growth and enhance brand awareness.</li><li> In-depth knowledge of marketing principles, market research, and data analysis.</li><li> Proficiency in digital marketing techniques, including SEO, SEM, ABM, social media marketing, and content marketing.</li><li> Excellent leadership skills with the ability to inspire and motivate cross-functional teams.</li><li> Strategic thinker with a data-driven mindset and the ability to translate market insights into actionable marketing strategies.</li><li> Exceptional communication skills with the ability to articulate complex concepts clearly and persuasively.</li><li> Strong executive presence with excellent written and verbal communication skills.</li><li> Adept at operating in a matrixed environment.</li><li> Strong problem-solving skills.</li><li> Demonstrated ability to thrive in a fast-paced, dynamic environment and effectively manage multiple priorities and deadlines.</li><li> Track record of innovation and customer-centric solution building.</li><li> Experience developing strategic vision for a function and prioritizing critical needs required to lead a team to best-in-class delivery.</li><li> Inclusive leadership and commitment to developing strong, diverse teams.</li></ul><p>Benefits:</p><ul><li> Health, dental, vision and life insurance plans</li><li> 401(k) Savings plan – with generous company matching contributions (up to 6%)</li><li> Voya Retirement Plan – employer paid cash balance retirement plan (4%)</li><li> Tuition reimbursement up to $5,250/year</li><li> Paid time off – including 20 days paid time off, nine paid company holidays and a flexible Diversity Celebration Day.</li><li> Paid volunteer time — 40 hours per calendar year</li></ul>",
    "url": "https://www.remoterocketship.com/company/voya/jobs/avp-consumer-engagement-marketing-united-states",
    "created_at": "2025-01-24T12:22:29.482158+00:00"
  },
  {
    "id": "6f61d8286b25c9691bd7",
    "title": "Not specified",
    "company": "Blueprint",
    "location": "Not specified",
    "salary": "Not specified",
    "description": "Blueprint is a company founded by Bryan Johnson, who is recognized for having the world’s best comprehensive biomarkers and is quantitatively the healthiest person on the planet. The company is methodically built on science, and Bryan freely shares his protocol.",
    "requirements": [
      "Not specified"
    ],
    "responsibilities": [
      "Not specified"
    ],
    "about_company": "Blueprint was founded by Bryan Johnson, who has the world’s best comprehensive biomarkers. He is quantitatively the healthiest person on the planet. Blueprint is methodically built on science. Bryan freely shares his protocol.",
    "benefits": "Not specified",
    "raw_content": "Death is our only foe.Blueprint was founded by Bryan Johnson, who has the world’s best comprehensive biomarkers. He is quantitatively the healthiest person on the planet.Blueprint is methodically built on science. Bryan freely shares his protocol, lear...",
    "url": "https://apply.workable.com/blueprint-bryanjohnson/j/46641ABCEF/",
    "created_at": "2025-01-29T20:23:03.361063+00:00"
  },
  {
    "id": "71f833dd874a262cf63e",
    "title": "VP, Marketing",
    "company": "Big Sea",
    "location": "Fully-remote, with co-working spaces in St. Petersburg, FL or Asheville, NC",
    "salary": "Not specified",
    "description": "Lead the agency’s marketing delivery services, focusing on developing and executing high-impact strategies for nonprofits and purpose-driven organizations. Requires deep understanding of nonprofit fundraising, donor engagement, and mastery of HubSpot’s CRM and marketing automation capabilities.",
    "requirements": [
      "Strategic vision to align marketing services with company goals and industry trends.",
      "Conduct in-depth marketing research and strategy development.",
      "Craft and oversee execution of comprehensive marketing plans.",
      "Serve as a trusted advisor for clients, ensuring exceptional service.",
      "Client-centric leadership and collaboration on data-driven strategies.",
      "Empower a high-performing delivery team.",
      "Establish systems for tracking and analyzing campaign performance.",
      "Champion the implementation of modern marketing technology.",
      "Foster a culture of continuous improvement.",
      "Minimum 8 years experience in digital agency and non-profit marketing."
    ],
    "responsibilities": [
      "Ensure the agency is recognized as a leading provider of innovative marketing solutions.",
      "Help clients achieve measurable improvements in brand awareness, fundraising, and mission impact.",
      "Build a highly sought-after marketing delivery team.",
      "Develop scalable and adaptable marketing delivery processes.",
      "Attract top talent and drive sustainable growth through quality and innovation."
    ],
    "about_company": "Big Sea is a fully-remote digital marketing and web development agency founded in 2005, headquartered in St. Petersburg, Florida. They focus on magnifying purpose-driven clients' efforts to achieve their goals, believing in the transformative power of communication.",
    "benefits": "Creative, autonomous, and collaborative culture.\nProfessional Development Annual Stipend.\nRemote work environment with access to co-working spaces.\nHealth, Dental, and Vision Insurance (paid 100% for employee).\nShort-term and Long-term Disability Insurance.\nFlexible PTO.",
    "raw_content": "<p></p><div><p>Founded in 2005, Big Sea is a fully-remote digital marketing and web development agency headquartered in St. Petersburg, Florida. We believe in the transformative power of communication to move hearts and minds, and we dedicate ourselves to magnifying our purpose-driven clients&rsquo; efforts, enabling them to achieve their purpose.</p><p>\nThe VP, Marketing is responsible for leading the agency&rsquo;s marketing delivery services, with a focus on developing and executing high-impact strategies for nonprofits and purpose-driven organizations. This role requires a deep understanding of nonprofit fundraising, donor engagement, and the unique tools and platforms that drive success in the sector, including mastery of HubSpot&rsquo;s CRM and marketing automation capabilities.</p><p>\nThe VP, Marketing will craft strategic marketing plans that align with the clients&rsquo; needs and business objectives, ensuring seamless execution of campaigns that exceed client expectations. This role involves collaborating closely with purpose-driven clients to understand their goals, crafting data-driven strategies, and empowering internal teams to deliver measurable results. The ideal candidate is a client-focused leader with a proven track record of leveraging marketing technology to create integrated communications plans that serve both marketing and fundraising, optimize donor journeys, improve campaign performance, and drive long-term support for purpose-driven organizations (both for-profit and non-profit).</p><p></p><p><b>\nRequirements</b></p><p></p><ul>\n<li><b>Strategic vision:</b> Establish the vision and direction for the agency's marketing delivery services, ensuring alignment with the broader company goals and evolving industry trends.</li>\n<li><b>Marketing research &amp; strategy:</b> Conduct in-depth research into the competitive landscape, target personas, and relevant industry trends to inform strategic recommendations. Leverage data analytics to identify campaign strengths and weaknesses, guiding strategy refinement.</li>\n<li><b>Marketing planning and executional oversight:</b> Craft comprehensive marketing plans tailored to each client's specific needs. These plans should outline key marketing initiatives, timelines, budgets, success metrics, and technology recommendations (including optimal use of HubSpot features).</li>\n<li><b>Account management and success alignment:</b> Serve as the trusted advisor for clients, deeply understanding client objectives and unique challenges, advocating for their needs and ensuring exceptional service through seamless team collaboration.</li>\n<li><b>Client-centric leadership:</b> Work closely with the team practice leads to understand client pain points, goals, and target audiences. Collaborate on developing data-driven marketing strategies aligned with the broader fundraising and communication objectives.</li>\n<li><b>Team empowerment: </b>Build and empower a high-performing delivery team, fostering a culture of collaboration, creativity, innovation, and accountability.</li>\n<li><b>Data-driven optimization:</b> Establish a robust system for tracking and analyzing campaign performance metrics, providing actionable insights to continuously improve marketing programs.</li>\n<li><b>MarTech mastery:</b> Champion the implementation of modern marketing technology to create streamlined, effective solutions for client organizations, from automation to analytics.</li>\n<li><b>Quality champion:</b> Foster a culture of continuous improvement, encouraging team members to identify and implement solutions for enhancing efficiency and quality.</li>\n<li><b>Digital Agency and Non-Profit Marketing:</b> Minimum 8 Years experience in digital agency and non-profit-marketing or similar purpose driven organizations.</li>\n</ul><p></p><h3 class=\"jobSectionHeader\"><b>Outcomes Expected</b></h3><ul>\n<li>The agency is recognized as a leading provider of innovative, high-impact marketing solutions for nonprofits and purpose-driven organizations.</li>\n<li>Clients consistently achieve their marketing goals, experiencing measurable improvements in brand awareness, fundraising, and mission impact.</li>\n<li>The marketing delivery team is a highly sought-after group of experts, known for their strategic thinking, creative execution, and client-focused approach.</li>\n<li>The agency's marketing delivery processes are scalable, adaptable, and continuously evolving to meet the changing needs of clients and the industry.</li>\n<li>The agency's reputation for quality and innovation attracts top talent and drives sustainable growth.</li>\n</ul><p></p><h3 class=\"jobSectionHeader\"><b>Core Values</b></h3><p>\nWe are a values-based company. Our values define who we are as individuals and a team. Every decision we make is informed by our values and our performance as a team and as individuals are measured against these values.</p><p><b>\nLove the Who: </b>We thrive on forging strong relationships. Each connection we make &ndash; be it within our walls or with our clients &ndash; is a bridge to new opportunities and understanding. We seek clarity, act kindly, and aim to become the partner every client seeks and the team everyone wants to be part of.</p><p><i>\nAre you committed to ensuring every person on your team&mdash;and every client you serve&mdash;feels genuinely seen, heard, and valued?</i></p><p><b>\nPositively Impact:</b> We drive real change for our clients and our agency. We obsess over outcomes and actions and always focus on what matters. We value progress over perfection, and performance over process. Our success is shared with our client's success, so we're always seeking to better understand how the work we are doing is driving results.</p><p><i>\nDoes your enthusiasm for achieving tangible outcomes extend beyond the finish line, driving you to celebrate successes and also simultaneously find areas for improvement?</i></p><p><b>\nOwn It: </b>Owning it involves a tendency toward action; it means we are the initiators, the forward-marching force that keeps projects moving and goals within reach. Our expertise is not static; it's dynamic, growing with every challenge we meet head-on. We don't linger in the shadow of instruction; we shine in the spirit of action.</p><p><i>\nDo you instinctively take the lead when opportunities or challenges arise, trusting your capacity to learn and adapt along the way?</i></p><p><b>\nBe Brave: </b>Being brave means walking in confidence, embracing the full spectrum of who we are, and supporting one another. It's about resilience and vulnerability too. We know we&rsquo;re not perfect, that we make mistakes (and own them!), but we&rsquo;re confident in knowing that that&rsquo;s just what&rsquo;s expected of us.</p><p><i>\nWhen faced with tough conversations or challenging situations, do you willingly express your perspective even if it feels risky?</i></p><p></p><p><b>\nBenefits</b></p><p></p><ul>\n<li>Be part of a creative, autonomous, and collaborative culture of high-performing individuals focused on bringing the highest level of impact to clients who want to make a difference.</li>\n<li>Professional Development Annual Stipend</li>\n<li>Remote work environment with the ability to drop-in to one of co-working spaces in either St. Petersburg, FL or Asheville, NC</li>\n<li>Health, Dental and Vision Insurance (paid 100% for employee)</li>\n<li>Short-term and Long-term Disability Insurance</li>\n<li>Flexible PTO</li></ul></div>",
    "url": "https://www.simplyhired.com/job/rClBO5hScaR6hU-97gymt8w_QiBLSglPf0hu5KaUv7ZXvM9ohZACyQ",
    "created_at": "2025-01-28T20:28:44.058684+00:00"
  },
  {
    "id": "7d14f24753b1f10c63be",
    "title": "VP of Growth Marketing",
    "company": "Deepgram",
    "location": "Not specified (Remote status not mentioned)",
    "salary": "Not specified",
    "description": "Deepgram is seeking a VP of Growth Marketing to lead and execute a comprehensive growth strategy across all marketing channels, including Product-Led Growth (PLG), paid, organic, and enterprise sales efforts. This role involves strategic leadership in building brand awareness, demand generation, content marketing, SEO, PLG strategies, paid digital, and marketing operations, with a strong focus on performance analytics and data-driven decision-making.",
    "requirements": [
      "Proven leadership in growth marketing, with a strong background in both developer-focused and enterprise sales strategies, and in building a world-class team",
      "Expertise in marketing operations, performance analytics, and A/B testing to drive measurable results and optimize campaigns across multiple channels"
    ],
    "responsibilities": [
      "Lead and execute growth strategies across PLG, paid, organic, and enterprise sales channels, driving both developer and enterprise customer acquisition",
      "Collaborate with co-sell partners to develop joint marketing initiatives that drive enterprise sales and expand Deepgram’s reach",
      "Oversee demand generation, content marketing, SEO, PLG strategies, digital marketing, and marketing operations to ensure effective and scalable growth",
      "Utilize performance analytics, A/B testing, and data-driven insights to optimize marketing campaigns and drive continuous improvement across all channels",
      "Collaborate with senior executives, including CEO, COO, Chief Strategy Officer, VP of Product, and VP of Partners"
    ],
    "about_company": "Deepgram is the leading voice AI platform for developers building speech-to-text (STT), text-to-speech (TTS) and full speech-to-speech (STS) offerings. With over 200,000 developers building on its platform, Deepgram is known for its unmatched accuracy, latency, and pricing. The company has over 400 enterprise customers, has processed over 50,000 years of audio, and transcribed over 1 trillion words. Backed by prominent investors, Deepgram has raised over $85 million in total funding.",
    "benefits": "Not specified",
    "raw_content": "<h1><strong>Company Overview</strong></h1><p style=\"min-height:1.5em\">Deepgram is the leading voice AI platform for developers building speech-to-text (STT), text-to-speech (TTS) and full speech-to-speech (STS) offerings. 200,000+ developers build with Deepgram’s voice-native foundational models – accessed through APIs or as self-managed software – due to our unmatched accuracy, latency and pricing. Customers include software companies building voice products, co-sell partners working with large enterprises, and enterprises solving internal voice AI use cases. The company ended 2024 cash-flow positive with 400+ enterprise customers, 3.3x annual usage growth across the past 4 years, over 50,000 years of audio processed and over 1 trillion words transcribed. There is no organization in the world that understands voice better than Deepgram</p><p style=\"min-height:1.5em\"><strong>Opportunity:</strong></p><p style=\"min-height:1.5em\">Deepgram is looking for a VP of Growth Marketing to lead and execute a comprehensive growth strategy across all marketing channels, including Product-Led Growth (PLG), paid, organic, and enterprise sales efforts. This person will own the full customer acquisition funnel, focusing on both developer and enterprise-focused channels, while optimizing campaigns for maximum ROI. The role involves strategic leadership in building brand awareness, demand generation, content marketing, SEO, PLG strategies, paid digital, and marketing operations, while working closely with co-sell partners and the direct sales team to drive enterprise sales. A strong focus on performance analytics, A/B testing, and data-driven decision-making will be key to scaling growth.</p><p style=\"min-height:1.5em\"> </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What You’ll Do</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead and execute growth strategies across PLG, paid, organic, and enterprise sales channels, driving both developer and enterprise customer acquisition.</p></li><li><p style=\"min-height:1.5em\">Collaborate with co-sell partners to develop joint marketing initiatives that drive enterprise sales and expand Deepgram’s reach.</p></li><li><p style=\"min-height:1.5em\">Oversee demand generation, content marketing, SEO, PLG strategies, digital marketing, and marketing operations to ensure effective and scalable growth.</p></li><li><p style=\"min-height:1.5em\">Utilize performance analytics, A/B testing, and data-driven insights to optimize marketing campaigns and drive continuous improvement across all channels.</p></li><li><p style=\"min-height:1.5em\">Collaborate with senior executives, including CEO, COO, Chief Strategy Officer, VP of Product, and VP of Partners </p></li></ul><p style=\"min-height:1.5em\"><strong>You’ll Love This Role If You</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Enjoy working at the intersection of marketing, technology, and enterprise sales, driving growth for both developer and enterprise audiences.</p></li><li><p style=\"min-height:1.5em\">Are passionate about scaling growth through innovative marketing strategies and thrive in a collaborative, fast-paced environment.</p></li></ul><p style=\"min-height:1.5em\"><br /></p><p style=\"min-height:1.5em\"><strong>It’s Important To Us That You Have</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proven leadership in growth marketing, with a strong background in both developer-focused and enterprise sales strategies, and in building a world-class team</p></li><li><p style=\"min-height:1.5em\">Expertise in marketing operations, performance analytics, and A/B testing to drive measurable results and optimize campaigns across multiple channels.</p></li></ul><p style=\"min-height:1.5em\"><strong>It Would Be Great if You Had </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience working in or with enterprise SaaS companies, particularly in developer tools or AI/ML products.</p></li><li><p style=\"min-height:1.5em\">Familiarity with partner marketing and joint sales strategies to drive enterprise business growth and expand market presence.</p></li></ul><p style=\"min-height:1.5em\">Backed by prominent investors including Y Combinator, Madrona, Tiger Global, Wing VC and NVIDIA, Deepgram has raised over $85 million in total funding. If you're looking to work on cutting-edge technology and make a significant impact in the AI industry, we'd love to hear from you!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Deepgram is an equal opportunity employer. We want all voices and perspectives represented in our workforce. We are a curious bunch focused on collaboration and doing the right thing. We put our customers first, grow together and move quickly. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, gender identity or expression, age, marital status, veteran status, disability status, pregnancy, parental status, genetic information, political affiliation, or any other status protected by the laws or regulations in the locations where we operate.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We are happy to provide accommodations for applicants who need them.</p><p style=\"min-height:1.5em\"></p>",
    "url": "https://jobs.ashbyhq.com/deepgram/73785786-79ab-42b7-8dcd-f84cd239477a",
    "created_at": "2025-01-27T16:07:41.476629+00:00"
  },
  {
    "id": "86fe6320152bf3ff2a4a",
    "title": "Head of Business Development",
    "company": "Nillion",
    "location": "Fully remote",
    "salary": "Competitive compensation package",
    "description": "Lead the expansion of Nillion's web3 ecosystem by forging strategic partnerships. Utilize technical expertise, a crypto-native mindset, and strategic vision to position Nillion as a trusted leader in the market.",
    "requirements": [
      "At least 5 years of experience in business development, partnerships management, or ecosystem growth within the web3 industry.",
      "Strong technical expertise in blockchain and decentralized technologies, including Privacy Enhancing Technologies.",
      "Proven track record of sourcing and nurturing partnerships, consistently surpassing traction targets.",
      "Skills in inbound/outbound lead generation and pipeline management, utilizing tools like Pipedrive or Airtable.",
      "Exceptional communication skills with the ability to articulate complex concepts to diverse audiences.",
      "Proactive, self-motivated, and entrepreneurial, thriving in a fast-paced startup environment.",
      "Strong analytical skills to assess opportunities, evaluate synergies, and create growth strategies.",
      "Passion for web3 innovation and a commitment to driving meaningful impact through cutting-edge technology.",
      "Nice to Haves: Deep understanding of crypto-native concepts such as DeFi, NFTs, DAOs, smart contracts, and Dapps.",
      "Experience developing and managing grant or funding programs, including setting objectives and conducting due diligence.",
      "Familiarity with network effects and their role in shaping web3 ecosystems.",
      "Bachelor’s degree in a relevant field with a preference for a technical background."
    ],
    "responsibilities": [
      "Forge strategic partnerships to expand Nillion's web3 ecosystem.",
      "Utilize technical expertise and strategic vision to position Nillion as a market leader.",
      "Build a thriving network of partnerships to advance Nillion’s mission."
    ],
    "about_company": "Nillion is humanity’s first Blind Computer, powered by a decentralized network of nodes that enables 'Blind Computation'. It aims to become the internet’s base layer for all private data as Privacy Enhancing Technologies (PETs) continue to mature. Nillion has attracted a notable initial cohort of builders across various sectors.",
    "benefits": "Flexible working hours to accommodate lifestyles and a globally distributed team.\nCompetitive compensation package.\nMake a big impact as an early contributor to an incredible founding team.\nWork on new problems in an incredible emerging and dynamic field.\nLearn from world-class systems engineering, product, and marketing domain experts in a mentorship-oriented work culture.\nFully remote, with value placed on regular meet-ups.",
    "raw_content": "<p>Description:</p><ul><li> Nillion is humanity’s first Blind Computer.</li><li> It is powered by a decentralized network of nodes that enables “Blind Computation”</li><li> Nillion believes Blind Computation will become the internet’s base layer for all private data as PETs continue to mature.</li><li> Nillion has attracted a notable initial cohort of Blind Computation builders across AI, DeFi, medical data, custody, wallets, global identity, messaging and much more.</li><li> As Head of Business Development at Nillion, you will lead the expansion of our web3 ecosystem by forging strategic partnerships.</li><li> Your technical expertise, crypto-native mindset, and strategic vision will position Nillion as a trusted leader in the market.</li><li> By building a thriving network of partnerships, you will play a critical role in advancing Nillion’s mission.</li></ul><p>Requirements:</p><ul><li> At least 5 years of experience in business development, partnerships management, or ecosystem growth within the web3 industry.</li><li> Strong technical expertise in blockchain and decentralized technologies, including Privacy Enhancing Technologies (e.g., zero-knowledge proofs, homomorphic encryption, MPC).</li><li> Proven track record of sourcing and nurturing partnerships, consistently surpassing traction targets.</li><li> Skills in inbound/outbound lead generation and pipeline management, utilizing tools like Pipedrive or Airtable.</li><li> Exceptional communication skills with the ability to articulate complex concepts to diverse audiences.</li><li> Proactive, self-motivated, and entrepreneurial, thriving in a fast-paced startup environment.</li><li> Strong analytical skills to assess opportunities, evaluate synergies, and create growth strategies.</li><li> Passion for web3 innovation and a commitment to driving meaningful impact through cutting-edge technology.</li><li> Nice to Haves</li><li> Strong technical expertise in blockchain and decentralized technologies, including Privacy Enhancing Technologies (e.g., zero-knowledge proofs, homomorphic encryption, MPC).</li><li> Deep understanding of crypto-native concepts such as DeFi, NFTs, DAOs, smart contracts, and Dapps.</li><li> Experience developing and managing grant or funding programs, including setting objectives and conducting due diligence.</li><li> Familiarity with network effects and their role in shaping web3 ecosystems.</li><li> Bachelor’s degree in a relevant field (e.g., computer science, engineering, business) with a preference for a technical background.</li></ul><p>Benefits:</p><ul><li> Flexible working hours to accommodate lifestyles and a globally distributed team.</li><li> Competitive compensation package.</li><li> Make a big impact as an early contributor to an incredible founding team.</li><li> Work on new problems in an incredible emerging and dynamic field.</li><li> Learn from world class systems engineering, product and marketing domain experts in a mentorship-oriented work culture.</li><li> You don’t need to be in an office or at a desk to have an impact anymore! Nillion are fully remote, but value regular meet-ups.</li></ul>",
    "url": "https://www.remoterocketship.com/company/nillion/jobs/head-of-business-development-eu-us-netherlands",
    "created_at": "2025-01-28T21:11:48.089252+00:00"
  },
  {
    "id": "925afa79560aab0c355e",
    "title": "Director, Design Management",
    "company": "Insomniac Games",
    "location": "United States, Remote",
    "salary": "$189,100 - $283,700 USD",
    "description": "Responsible for building, managing, and mentoring a world-class Design Department to achieve Insomniac's vision of Best Developer. Ensures excellent on time in budget deliveries through strategic planning, team leadership, and collaboration with Department Heads, Design Leaders, and Project Leaders.",
    "requirements": [
      "Large team leadership, with experience navigating multiple simultaneous projects.",
      "Creative collaboration and problem solving within the design department and across all departments.",
      "Effective time management, with the ability to delegate tasks and focus on larger issues while monitoring critical smaller details.",
      "Detailed knowledge of all game production methods",
      "A strong critical eye for detail and the ability to communicate effectively with the team and other departments to resolve issues.",
      "Communication with both large groups and individuals, with excellent written and oral communication skills Deadline-oriented approach, with the ability to achieve results given constraints.",
      "Working knowledge with level editing tools (Radiant, Unreal, Hammer, or proprietary editors) and scripting.",
      "Working knowledge of Maya or other major 3D modeling programs.",
      "Advanced knowledge of Microsoft Word and Excel."
    ],
    "responsibilities": [
      "Responsible for ensuring project quality and the well-being of team members.",
      "Works with design leadership to establish consistent design philosophies, practices, and standards across all projects.",
      "Plays games in development to ensure that we are achieving our operational goals and meeting our quality bar.",
      "Responsible for enforcing project schedules in conjunction with Project Management.",
      "Provides budgeting for the Design department in conjunction with Finance.",
      "Directs the professional development of all Design employees.",
      "Reviews design direction for all projects through the coordinated efforts of design leadership team.",
      "Regularly reviews and provides design feedback for all titles to align with the established creative direction and design direction of each title.",
      "Works with design leadership to establish and coordinate production goals that intersect design and other production departments to achieve short and long-term project goals.",
      "Develops, plans, communicates, and ensures implementation of continuous improvements to the production pipeline.",
      "Implements and maintains a staffing pipeline to support production headcounts, budget, and skills needed.",
      "Participates and presents ideas clearly and concisely to senior management and other project stakeholders.",
      "Ensures that all complaints and concerns related to inappropriate or unprofessional conduct in the workplace are addressed immediately to foster a safe work environment."
    ],
    "about_company": "Insomniac Games is a leading video game developer known for creating engaging and innovative games. The company is committed to fostering a creative and inclusive work environment where employees can grow and excel in their careers.",
    "benefits": "SIE’s top-tier benefits package that includes medical, dental, vision, matching 401(k), paid time off, wellness program and coveted employee discounts for Sony products. This role also may be eligible for a bonus package.",
    "raw_content": "Back to jobsNewInsomniac is looking for a new Design Management Director. In this role, you will be responsible for building, managing, and mentoring a world-class Design Department to achieve Insomniac's vision of Best Developer. Ensures excellent on time in budget deliveries through strategic planning, team leadership, and collaboration with Department Heads, Design Leaders, and Project Leaders. Possesses a deep level of design knowledge and design craft skill to be able to manage and provide actionable feedback on design employee's output of work, quality, and timelines. If this is the opportunity you have been looking for, please read on: Essential Duties and Responsibilities include the following: Responsible for ensuring project quality and the well-being of team members. Works with design leadership to establish consistent design philosophies, practices, and standards across all projects. Plays games in development to ensure that we are achieving our operational goals and meeting our quality bar. Responsible for enforcing project schedules in conjunction with Project Management. Provides budgeting for the Design department in conjunction with Finance. Directs the professional development of all Design employees. Reviews design direction for all projects through the coordinated efforts of design leadership team. Regularly reviews and provides design feedback for all titles to align with the established creative direction and design direction of each title. Works with design leadership to establish and coordinate production goals that intersect design and other production departments to achieve short and long-term project goals. Develops, plans, communicates, and ensures implementation of continuous improvements to the production pipeline. Implements and maintains a staffing pipeline to support production headcounts, budget, and skills needed. Participates and presents ideas clearly and concisely to senior management and other project stakeholders. Ensures that all complaints and concerns related to inappropriate or unprofessional conduct in the workplace are addressed immediately to foster a safe work environment. Other duties may be assigned. ​Supervisory Duties: This job has supervisory responsibilities. Supervisory Duties Details: Directly supervises design directors and design managers and indirectly oversees the design department. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems. Qualifications: Large team leadership, with experience navigating multiple simultaneous projects. Creative collaboration and problem solving within the design department and across all departments. Effective time management, with the ability to delegate tasks and focus on larger issues while monitoring critical smaller details. Detailed knowledge of all game production methods A strong critical eye for detail and the ability to communicate effectively with the team and other departments to resolve issues. Communication with both large groups and individuals, with excellent written and oral communication skills Deadline-oriented approach, with the ability to achieve results given constraints. Computer Skills: Working knowledge with level editing tools (Radiant, Unreal, Hammer, or proprietary editors) and scripting. Working knowledge of Maya or other major 3D modeling programs. Advanced knowledge of Microsoft Word and Excel. We look forward to hearing from you. Please use the link below and apply. Thank you! Please refer to our Candidate Privacy Notice for more information about how we process your personal information, and your data protection rights. At SIE, we consider several factors when setting each role’s base pay range, including the competitive benchmarking data for the market and geographic location. Base pay is one component of our total compensation package. Please note that the base pay range may vary in line with our hybrid working policy and individual base pay will be determined based on job-related factors which may include knowledge, skills, experience, and location, as well as additional compensation components, such as annual bonus, profit sharing, and other incentive plans. In addition, this role is eligible for SIE’s top-tier benefits package that includes medical, dental, vision, matching 401(k), paid time off, wellness program and coveted employee discounts for Sony products. This role also may be eligible for a bonus package. Click here to learn more. Profit Sharing (PSS Only)$189,100 - $283,700 USD((STORAGE_KEY, restoreKey) => { if (!window.history.state || !window.history.state.key) { let key = Math.random().toString(32).slice(2); window.history.replaceState({ key }, \"\"); } try { let positions = JSON.parse(sessionStorage.getItem(STORAGE_KEY) || \"{}\"); let storedY = positions[restoreKey || window.history.state.key]; if (typeof storedY === \"number\") { window.scrollTo(0, storedY); } } catch (error) { console.error(error); sessionStorage.removeItem(STORAGE_KEY); } })(\"positions\", null)window.ENV = {\"ASSET_URL\":\"https://job-boards.cdn.greenhouse.io\",\"EMAIL_ADDRESS_VALIDATOR_HOST\":\"email-address-validator.us.greenhouse.io\",\"JBEN_URL\":\"https://boards.greenhouse.io\",\"LOCATION_CONTROL_PROVIDER\":\"pelias\",\"LOCATION_CONTROL_API_KEY\":\"ge-39f1178289d5d0c5\",\"LOCATION_CONTROL_BASE_URL\":\"https://api-geocode-earth-proxy.prod.use1.greenhouse.io/\",\"LOTUS_GIT_COMMIT\":\"91a7c4b2d11ec788424f5f2b75c724fa69dc5e14\",\"MAX_POSTS_PER_PAGE\":50,\"ROLLBAR_ENV\":\"production\",\"ROLLBAR_FE_ENABLED\":true,\"ROLLBAR_POST_CLIENT_ITEM_TOKEN\":\"fb557f59a5a84ab788801dd742eacf34\",\"ROLLBAR_FILTER_HYDRATION_ERRORS\":true,\"GOOGLE_PICKER_APP_ID\":\"594601915089\",\"GOOGLE_PICKER_DEVELOPER_KEY\":\"AIzaSyBeoz4WOjOsy8ZJFIkkQBvL8BZQCzLplHQ\",\"GOOGLE_PICKER_CLIENT_ID\":\"594601915089-7c2994029qkt5qu2tmbppujr9jqrqqrs.apps.googleusercontent.com\",\"DROPBOX_CHOOSER_API_KEY\":\"mh9jyh4mfwjnfhj\",\"GOOGLE_RECAPTCHA_INVISIBLE_KEY\":\"6LfmcbcpAAAAAChNTbhUShzUOAMj_wY9LQIvLFX0\",\"GOOGLE_RECAPTCHA_ENDPOINT\":\"https://www.recaptcha.net/recaptcha/enterprise.js\",\"JOB_SEEKERS_URL\":\"https://my.greenhouse.io\",\"SNOWPLOW_APP_ID\":\"job-board-renderer\",\"SNOWPLOW_ENABLED\":true,\"SNOWPLOW_ENDPOINT\":\"spl.greenhouse.io\",\"SNOWPLOW_NAMESPACE\":\"job-board-renderer-tracker\"}window.__remixContext = {\"basename\":\"/\",\"future\":{\"v3_fetcherPersist\":false,\"v3_relativeSplatPath\":false,\"v3_throwAbortReason\":false,\"v3_routeConfig\":false,\"v3_singleFetch\":false,\"v3_lazyRouteDiscovery\":false,\"unstable_optimizeDeps\":false},\"isSpaMode\":false,\"state\":{\"loaderData\":{\"root\":{\"internal\":false,\"preview\":false,\"locale\":\"en\",\"href\":\"http://job-boards.greenhouse.io/insomniac/jobs/5426164004\",\"ENV\":{\"ASSET_URL\":\"https://job-boards.cdn.greenhouse.io\",\"EMAIL_ADDRESS_VALIDATOR_HOST\":\"email-address-validator.us.greenhouse.io\",\"JBEN_URL\":\"https://boards.greenhouse.io\",\"LOCATION_CONTROL_PROVIDER\":\"pelias\",\"LOCATION_CONTROL_API_KEY\":\"ge-39f1178289d5d0c5\",\"LOCATION_CONTROL_BASE_URL\":\"https://api-geocode-earth-proxy.prod.use1.greenhouse.io/\",\"LOTUS_GIT_COMMIT\":\"91a7c4b2d11ec788424f5f2b75c724fa69dc5e14\",\"MAX_POSTS_PER_PAGE\":50,\"ROLLBAR_ENV\":\"production\",\"ROLLBAR_FE_ENABLED\":true,\"ROLLBAR_POST_CLIENT_ITEM_TOKEN\":\"fb557f59a5a84ab788801dd742eacf34\",\"ROLLBAR_FILTER_HYDRATION_ERRORS\":true,\"GOOGLE_PICKER_APP_ID\":\"594601915089\",\"GOOGLE_PICKER_DEVELOPER_KEY\":\"AIzaSyBeoz4WOjOsy8ZJFIkkQBvL8BZQCzLplHQ\",\"GOOGLE_PICKER_CLIENT_ID\":\"594601915089-7c2994029qkt5qu2tmbppujr9jqrqqrs.apps.googleusercontent.com\",\"DROPBOX_CHOOSER_API_KEY\":\"mh9jyh4mfwjnfhj\",\"GOOGLE_RECAPTCHA_INVISIBLE_KEY\":\"6LfmcbcpAAAAAChNTbhUShzUOAMj_wY9LQIvLFX0\",\"GOOGLE_RECAPTCHA_ENDPOINT\":\"https://www.recaptcha.net/recaptcha/enterprise.js\",\"JOB_SEEKERS_URL\":\"https://my.greenhouse.io\",\"SNOWPLOW_APP_ID\":\"job-board-renderer\",\"SNOWPLOW_ENABLED\":true,\"SNOWPLOW_ENDPOINT\":\"spl.greenhouse.io\",\"SNOWPLOW_NAMESPACE\":\"job-board-renderer-tracker\"},\"boardConfiguration\":{\"job_board_id\":4006123004,\"logo\":{\"href\":null,\"url\":\"https://s4-recruiting.cdn.greenhouse.io/external_greenhouse_job_boards/logos/400/612/300/original/Insomniac-Games-Logo-ds1-1340x1340.jpg?1639520366\"},\"filters\":{\"include_office_filter\":true,\"include_department_filter\":true,\"allow_custom_field_filters\":null},\"button_shape\":null,\"cta_text\":null,\"primary_font\":null,\"secondary_font\":null,\"dropdown_selection_color\":null,\"active_field_color\":null,\"link_color\":null,\"list_selection_color\":null,\"primary_font_color\":null,\"outside_label\":null,\"view_all_link\":true,\"button_color\":null,\"button_hover_color\":null,\"button_text_color\":null,\"banner_url\":null,\"board_layout\":null,\"display_department_hierarchy\":null,\"hide_app_description\":false,\"header_text\":null,\"job_board_public_url\":\"https://job-boards.greenhouse.io/insomniac\",\"secondary_font_color\":null,\"background_color\":null,\"disable_captcha\":false,\"disable_eeoc_quick_apply\":false,\"enable_recruitics\":false,\"appcast_tracking_code\":null,\"google_drive_enabled\":true,\"enable_dropbox\":true,\"allow_external_notifications\":null,\"display_job_trust_profiles\":null},\"urlToken\":\"insomniac\",\"embedded\":false,\"isJobPost\":true},\"routes/$url_token_.jobs_.$job_post_id\":{\"jobPost\":{\"post_type\":\"job_post\",\"language\":\"en\",\"title\":\"Director, Design Management\",\"hiring_plan_id\":4868354004,\"content\":\"\\u003cp\\u003eInsomniac is looking for a new Design Management Director. In this role, you will be responsible for building, managing, and mentoring a world-class Design Department to achieve Insomniac's vision of Best Developer.\\u0026nbsp; Ensures excellent on time in budget deliveries through strategic planning, team leadership, and collaboration with Department Heads, Design Leaders, and Project Leaders. Possesses a deep level of design knowledge and design craft skill to be able to manage and provide actionable feedback on design employee's output of work, quality, and timelines.\\u003c/p\\u003e\\n\\u003cp\\u003eIf this is the opportunity you have been looking for, please read on:\\u003c/p\\u003e\\n\\u003cp\\u003e\\u003cstrong\\u003eEssential Duties and Responsibilities include the following:\\u003c/strong\\u003e\\u003c/p\\u003e\\n\\u003cul\\u003e\\n\\u003cli\\u003eResponsible for ensuring project quality and the well-being of team members.\\u003c/li\\u003e\\n\\u003cli\\u003eWorks with design leadership to establish consistent design philosophies, practices, and standards across all projects.\\u003c/li\\u003e\\n\\u003cli\\u003ePlays games in development to ensure that we are achieving our operational goals and meeting our quality bar.\\u003c/li\\u003e\\n\\u003cli\\u003eResponsible for enforcing project schedules in conjunction with Project Management.\\u003c/li\\u003e\\n\\u003cli\\u003eProvides budgeting for the Design department in conjunction with Finance.\\u003c/li\\u003e\\n\\u003cli\\u003eDirects the professional development of all Design employees.\\u003c/li\\u003e\\n\\u003cli\\u003eReviews design direction for all projects through the coordinated efforts of design leadership team.\\u003c/li\\u003e\\n\\u003cli\\u003eRegularly reviews and provides design feedback for all titles to align with the established creative direction and design direction of each title.\\u003c/li\\u003e\\n\\u003cli\\u003eWorks with design leadership to establish and coordinate production goals that intersect design and other production departments to achieve short and long-term project goals.\\u003c/li\\u003e\\n\\u003cli\\u003eDevelops, plans, communicates, and ensures implementation of continuous improvements to the production pipeline.\\u003c/li\\u003e\\n\\u003cli\\u003eImplements and maintains a staffing pipeline to support production headcounts, budget, and skills needed.\\u003c/li\\u003e\\n\\u003cli\\u003eParticipates and presents ideas clearly and concisely to senior management and other project stakeholders.\\u003c/li\\u003e\\n\\u003cli\\u003eEnsures that all complaints and concerns related to inappropriate or unprofessional conduct in the workplace are addressed immediately to foster a safe work environment.\\u003c/li\\u003e\\n\\u003cli\\u003eOther duties may be assigned.\\u003c/li\\u003e\\n\\u003c/ul\\u003e\\n\\u003cp\\u003e\\u003cstrong\\u003e​\\u003c/strong\\u003e\\u003cstrong\\u003eSupervisory Duties:\\u003c/strong\\u003e\\u003c/p\\u003e\\n\\u003cp\\u003eThis job has supervisory responsibilities.\\u003c/p\\u003e\\n\\u003cp\\u003e\\u003cstrong\\u003eSupervisory Duties Details:\\u003c/strong\\u003e\\u003c/p\\u003e\\n\\u003cp\\u003eDirectly supervises design directors and design managers and indirectly oversees the design department. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.\\u003c/p\\u003e\\n\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\n\\u003cp\\u003e\\u003cstrong\\u003eQualifications:\\u003c/strong\\u003e\\u003c/p\\u003e\\n\\u003cul\\u003e\\n\\u003cli\\u003eLarge team leadership, with experience navigating multiple simultaneous projects.\\u003c/li\\u003e\\n\\u003cli\\u003eCreative collaboration and problem solving within the design department and across all departments.\\u003c/li\\u003e\\n\\u003cli\\u003eEffective time management, with the ability to delegate tasks and focus on larger issues while monitoring critical smaller details.\\u003c/li\\u003e\\n\\u003cli\\u003eDetailed knowledge of all game production methods\\u003c/li\\u003e\\n\\u003cli\\u003eA strong critical eye for detail and the ability to communicate effectively with the team and other departments to resolve issues.\\u003c/li\\u003e\\n\\u003cli\\u003eCommunication with both large groups and individuals, with excellent written and oral communication skills Deadline-oriented approach, with the ability to achieve results given constraints.\\u003c/li\\u003e\\n\\u003c/ul\\u003e\\n\\u003cp\\u003e\\u003cstrong\\u003eComputer Skills:\\u003c/strong\\u003e\\u003c/p\\u003e\\n\\u003cul\\u003e\\n\\u003cli\\u003eWorking knowledge with level editing tools (Radiant, Unreal, Hammer, or proprietary editors) and scripting.\\u003c/li\\u003e\\n\\u003cli\\u003eWorking knowledge of Maya or other major 3D modeling programs.\\u003c/li\\u003e\\n\\u003cli\\u003eAdvanced knowledge of Microsoft Word and Excel.\\u003c/li\\u003e\\n\\u003c/ul\\u003e\\n\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\n\\u003cp\\u003eWe look forward to hearing from you. Please use the link below and apply. Thank you!\\u003c/p\\u003e\",\"introduction\":null,\"conclusion\":null,\"enable_eeoc\":false,\"job_post_location\":\"United States, Remote\",\"public_url\":\"https://job-boards.greenhouse.io/insomniac/jobs/5426164004\",\"company_name\":\"Insomniac Games\",\"confirmation_message\":\"\\u003ch1\\u003eThank you for applying.\\u003c/h1\\u003e\\n\\u003cp\\u003eYour application has been received. If there is a fit, someone will be getting back to you.\\u003c/p\\u003e\",\"pay_ranges\":[{\"title\":\"Profit Sharing (PSS Only)\",\"description\":\"\\u003cp\\u003e\\u003c/p\\u003e\\n\\u003cp\\u003e\\u003cspan style=\\\"font-weight: 400;\\\"\\u003e\\u003cstrong\\u003e\\u003cem\\u003ePlease refer to our \\u003ca href=\\\"https://www.playstation.com/en-us/legal/careers-privacy-notice/\\\"\\u003eCandidate Privacy Notice\\u003c/a\\u003e\\u0026nbsp;for more information about how we process your personal information, and your data protection rights.\\u003c/em\\u003e\\u003c/strong\\u003e\\u003c/span\\u003e\\u003c/p\\u003e\\n\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\n\\u003cp\\u003eAt SIE, we consider several factors when setting each role’s base pay range, including the competitive benchmarking data for the market and geographic location.\\u0026nbsp;\\u003cbr\\u003e\\u003cbr\\u003eBase pay is one component of our total compensation package. Please note that the base pay range may vary in line with our hybrid working policy and individual base pay will be determined based on job-related factors which may include knowledge, skills, experience, and location, as well as additional compensation components, such as annual bonus, profit sharing, and other incentive plans. \\u003cbr\\u003e\\u003cbr\\u003eIn addition, this role is eligible for SIE’s top-tier benefits package that includes medical, dental, vision, matching 401(k), paid time off, wellness program and coveted employee discounts for Sony products. This role also may be eligible for a bonus package. \\u003cspan style=\\\"font-weight: 400;\\\"\\u003eClick\\u0026nbsp;\\u003c/span\\u003e\\u003ca href=\\\"https://www.playstation.com/en-us/corporate/playstation-careers/#:~:text=connections%20and%20culture.-,Career%20benefits,-Working%20at%20PlayStation\\\" target=\\\"_blank\\\"\\u003e\\u003cstrong\\u003ehere\\u003c/strong\\u003e\\u003c/a\\u003e\\u003cspan style=\\\"font-weight: 400;\\\"\\u003e to learn more.\\u003c/span\\u003e\\u003c/p\\u003e\\n\\u003cp\\u003e\\u003c/p\\u003e\",\"min\":\"$189,100\",\"max\":\"$283,700\",\"currency_type\":\"USD\"}],\"published_at\":\"2025-01-23T17:28:44-05:00\",\"employment\":\"hidden\",\"fingerprint\":\"12ea66ae14489c18a6d5b9c02ee1de1b6c08f79a\",\"redirect_to\":null,\"is_featured\":false,\"education_config\":{\"id\":5411135004,\"school_name\":\"hidden\",\"degree\":\"hidden\",\"discipline\":\"hidden\",\"start_month\":\"hidden\",\"start_year\":\"hidden\",\"end_month\":\"hidden\",\"end_year\":\"hidden\"},\"questions\":[{\"required\":true,\"label\":\"First Name\",\"description\":null,\"fields\":[{\"name\":\"first_name\",\"type\":\"input_text\"}]},{\"required\":true,\"label\":\"Last Name\",\"description\":null,\"fields\":[{\"name\":\"last_name\",\"type\":\"input_text\"}]},{\"required\":true,\"label\":\"Email\",\"description\":null,\"fields\":[{\"name\":\"email\",\"type\":\"input_text\"}]},{\"required\":true,\"label\":\"Phone\",\"description\":null,\"fields\":[{\"name\":\"phone\",\"type\":\"input_text\"}]},{\"required\":true,\"label\":\"Resume/CV\",\"description\":null,\"fields\":[{\"name\":\"resume\",\"type\":\"input_file\",\"allowed_filetypes\":[\"pdf\",\"doc\",\"docx\",\"txt\",\"rtf\"]},{\"name\":\"resume_text\",\"type\":\"textarea\"}]},{\"required\":false,\"label\":\"Cover Letter\",\"description\":null,\"fields\":[{\"name\":\"cover_letter\",\"type\":\"input_file\",\"allowed_filetypes\":[\"pdf\",\"doc\",\"docx\",\"txt\",\"rtf\"]},{\"name\":\"cover_letter_text\",\"type\":\"textarea\"}]},{\"required\":false,\"label\":\"LinkedIn Profile\",\"description\":null,\"fields\":[{\"name\":\"question_12495077004\",\"type\":\"input_text\"}],\"multi_select_style\":\"checkbox\"},{\"required\":false,\"label\":\"Website\",\"description\":null,\"fields\":[{\"name\":\"question_12495078004\",\"type\":\"input_text\"}],\"multi_select_style\":\"checkbox\"},{\"required\":true,\"label\":\"Have you ever worked for a Sony company previously?\",\"description\":null,\"fields\":[{\"name\":\"question_12495079004\",\"type\":\"multi_value_single_select\",\"values\":[{\"value\":1,\"label\":\"Yes\"},{\"value\":0,\"label\":\"No\"}]}],\"multi_select_style\":\"checkbox\"},{\"required\":true,\"label\":\"Are you authorized to work in the United States?\",\"description\":null,\"fields\":[{\"name\":\"question_12495080004\",\"type\":\"multi_value_single_select\",\"values\":[{\"value\":43792815004,\"label\":\"Yes\"},{\"value\":43792816004,\"label\":\"No\"}]}],\"multi_select_style\":\"checkbox\"},{\"required\":true,\"label\":\"Will you now, or in the future, require sponsorship to work in the United States?\",\"description\":null,\"fields\":[{\"name\":\"question_12495081004\",\"type\":\"multi_value_single_select\",\"values\":[{\"value\":1,\"label\":\"Yes\"},{\"value\":0,\"label\":\"No\"}]}],\"multi_select_style\":\"checkbox\"},{\"required\":false,\"label\":\"What salary range are you targeting for this role?\",\"description\":null,\"fields\":[{\"name\":\"question_12495082004\",\"type\":\"multi_value_single_select\",\"values\":[{\"value\":43792817004,\"label\":\"$40,000-$60,000\"},{\"value\":43792818004,\"label\":\"$60,000-$80,000\"},{\"value\":43792819004,\"label\":\"$80,000-$100,000\"},{\"value\":43792820004,\"label\":\"$100,000-$120,000\"},{\"value\":43792821004,\"label\":\"$120,000-$140,000\"},{\"value\":43792822004,\"label\":\"$140,000-$160,000\"},{\"value\":43792823004,\"label\":\"$160,000-$180,000\"},{\"value\":43792824004,\"label\":\"$180,000-$200,000\"},{\"value\":43792825004,\"label\":\"$200,000+\"}]}],\"multi_select_style\":\"checkbox\"},{\"required\":true,\"label\":\"Do you prefer to work in Burbank, CA, Durham, NC or remotely?\",\"description\":null,\"fields\":[{\"name\":\"question_12495083004\",\"type\":\"multi_value_single_select\",\"values\":[{\"value\":43792826004,\"label\":\"Burbank, CA\"},{\"value\":43792827004,\"label\":\"Durham, NC\"},{\"value\":43792828004,\"label\":\"Remotely\"}]}],\"multi_select_style\":\"checkbox\"},{\"required\":true,\"label\":\"Are you related to, or in a close personal relationship with, anyone who currently works for SIE or any SIE-affiliated studios? (This includes spouses, domestic partners, and significant others.)\",\"description\":null,\"fields\":[{\"name\":\"question_12495084004\",\"type\":\"multi_value_single_select\",\"values\":[{\"value\":1,\"label\":\"Yes\"},{\"value\":0,\"label\":\"No\"}]}],\"multi_select_style\":\"checkbox\"},{\"required\":false,\"label\":\"If yes, please state their name, the department or studio they work for, and their job title (if you know it).\",\"description\":null,\"fields\":[{\"name\":\"question_12495085004\",\"type\":\"input_text\"}],\"multi_select_style\":\"checkbox\"},{\"required\":true,\"label\":\"By selecting \\\"Yes\\\", I am certifying that, to the best of my knowledge, the information I have provided in this employment application is true and correct.\",\"description\":null,\"fields\":[{\"name\":\"question_12495086004\",\"type\":\"multi_value_single_select\",\"values\":[{\"value\":1,\"label\":\"Yes\"},{\"value\":0,\"label\":\"No\"}]}],\"multi_select_style\":\"checkbox\"}],\"demographic_questions\":{\"title\":\"US Voluntary Demographic Question\",\"description\":\"\\u003cp\\u003e\\u003c!--StartFragment--\\u003e\\u003c/p\\u003e\\n\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\n\\u003cp\\u003e\\u003cspan style=\\\"text-decoration: underline;\\\"\\u003e\\u003cstrong\\u003eVoluntary Self-Identification\\u003c/strong\\u003e\\u003c/span\\u003e\\u003c/p\\u003e\\n\\u003cp\\u003eOur vision at PlayStation is to bring out the best in our global team members by creating a sense of belonging, being a place where they can grow, and ensuring everyone feels valued, heard, and supported so we can push the boundaries of play. That vision begins our candidates, and we are working to better understand the diversity of our candidate population. \\u0026nbsp;\\u003cbr\\u003e\\u0026nbsp;\\u003cbr\\u003eThis data will also be aggregated and sent to the government for reporting purposes. Please know that the completion of this form is entirely voluntary. Your personally identifiable information (name, address, etc) will not be considered in the hiring process or thereafter. Any information that you choose to provide will be recorded and maintained in a confidential file for XX time.\\u003c/p\\u003e\\n\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\n\\u003cp\\u003e\\u003cspan style=\\\"text-decoration: underline;\\\"\\u003e\\u003cstrong\\u003eProtected Veteran\\u003c/strong\\u003e\\u003c/span\\u003e\\u003c/p\\u003e\\n\\u003cp\\u003eYou are a \\u0026ldquo;protected veteran\\u0026rdquo; under United States law if any of the following apply to you:\\u003c/p\\u003e\\n\\u003cul\\u003e\\n\\u003cli\\u003eDisabled Veteran: a veteran of the U.S. military who is entitled to compensation (or who would be entitled to compensation if not for the receipt of military retired pay) under the administration of the Secretary of Veterans Affairs and/or a person who was discharged or released from active duty because of a service-connected disability.\\u0026nbsp;\\u003c/li\\u003e\\n\\u003cli\\u003eRecently Separated Veteran: a veteran who has discharged or released from active duty in the U.S. military within the last three years.\\u003c/li\\u003e\\n\\u003cli\\u003eArmed Forces Service Medal Veteran: a veteran who, while serving on active duty in the U.S. military, participated in a U.S. military operation for which an Armed Forces Service Medal was awarded pursuant to Executive Order 12985.\\u003c/li\\u003e\\n\\u003c/ul\\u003e\\n\\u003cp\\u003e\\u0026nbsp;\\u003c/p\\u003e\\n\\u003cp\\u003e\\u003cspan style=\\\"text-decoration: underline;\\\"\\u003e\\u003cstrong\\u003eDisability\\u003c/strong\\u003e\\u003c/span\\u003e\\u003c/p\\u003e\\n\\u003cp\\u003eUnder U.S. law, you are considered to have a disability if you have a physical or mental impairment or medical condition that substantially limits a major life activity, or if you have a history or record of such an impairment or medical condition.\\u003c/p\\u003e\\n\\u003cp\\u003eIdentifying yourself as an individual with a disability is voluntary, and we hope that you will choose to do so. Your answer will be maintained confidentially and will not be seen by selecting officials or anyone else involved in making personnel decisions, nor will it be shared with our accommodations team . Completing the form will not negatively impact you in any way, regardless of whether you have self-identified in the past.\\u003c/p\\u003e\\n\\u003cp\\u003e\\u003c!--EndFragment--\\u003e\\u003c/p\\u003e\",\"questions\":[{\"id\":4024662004,\"name\":\"Gender\",\"required\":true,\"answer_type\":{\"id\":null,\"key\":\"SINGLE_SELECT\"},\"answer_options\":[{\"id\":4147150004,\"name\":\"Female\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147151004,\"name\":\"Male\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147152004,\"name\":\"I don't wish to answer\",\"free_form\":false,\"decline_to_answer\":true}]},{\"id\":4024663004,\"name\":\"Gender Identity\",\"required\":true,\"answer_type\":{\"id\":null,\"key\":\"SINGLE_SELECT\"},\"answer_options\":[{\"id\":4147153004,\"name\":\"Agender\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147154004,\"name\":\"Cisgender/Female\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147155004,\"name\":\"Cisgender/Male\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147156004,\"name\":\"Female\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147157004,\"name\":\"Genderqueer\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147158004,\"name\":\"Intersex\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147159004,\"name\":\"Male\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147160004,\"name\":\"Non-binary/Gender Non-Conforming/Gender Variant\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147161004,\"name\":\"Gender Identity Not Listed\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147162004,\"name\":\"Transgender\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147163004,\"name\":\"Two-Spirit\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147164004,\"name\":\"I don't wish to answer\",\"free_form\":false,\"decline_to_answer\":true}]},{\"id\":4024664004,\"name\":\"What are your personal pronouns? \",\"required\":true,\"answer_type\":{\"id\":null,\"key\":\"SINGLE_SELECT\"},\"answer_options\":[{\"id\":4147165004,\"name\":\"He/Him\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147166004,\"name\":\"He/They\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147167004,\"name\":\"She/Her\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147168004,\"name\":\"She/They\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147169004,\"name\":\"They/Them\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147170004,\"name\":\"Xe/Xem\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147171004,\"name\":\"Ze/Zir\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147172004,\"name\":\"Pronouns Not Listed\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147173004,\"name\":\"I don't wish to answer\",\"free_form\":false,\"decline_to_answer\":true}]},{\"id\":4024665004,\"name\":\"Sexual Orientation\",\"required\":true,\"answer_type\":{\"id\":null,\"key\":\"SINGLE_SELECT\"},\"answer_options\":[{\"id\":4147174004,\"name\":\"Asexual\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147175004,\"name\":\"Bisexual\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147176004,\"name\":\"Gay/Lesbian\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147177004,\"name\":\"Heterosexual\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147178004,\"name\":\"Sexual Orientation Not Listed\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147179004,\"name\":\"Pansexual\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147180004,\"name\":\"Queer\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147181004,\"name\":\"Questioning\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147182004,\"name\":\"I don't wish to answer\",\"free_form\":false,\"decline_to_answer\":true}]},{\"id\":4024666004,\"name\":\"Are you Hispanic/Latinx?\",\"required\":true,\"answer_type\":{\"id\":null,\"key\":\"SINGLE_SELECT\"},\"answer_options\":[{\"id\":4147183004,\"name\":\"Yes\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147184004,\"name\":\"No\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147185004,\"name\":\"I don't wish to answer\",\"free_form\":false,\"decline_to_answer\":true}]},{\"id\":4024667004,\"name\":\"Please identify your race/ethnicity\",\"required\":true,\"answer_type\":{\"id\":null,\"key\":\"SINGLE_SELECT\"},\"answer_options\":[{\"id\":4147186004,\"name\":\"American Indian or Alaskan Native\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147480004,\"name\":\"Asian\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147194004,\"name\":\"Black or African American\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147195004,\"name\":\"Native Hawaiian or Other Pacific Islander\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147196004,\"name\":\"Two or More Races\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147197004,\"name\":\"White\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147198004,\"name\":\"I don't wish to answer\",\"free_form\":false,\"decline_to_answer\":true}]},{\"id\":4024668004,\"name\":\"Are you a protected veteran? \",\"required\":true,\"answer_type\":{\"id\":null,\"key\":\"SINGLE_SELECT\"},\"answer_options\":[{\"id\":4147199004,\"name\":\"I identify as one or more of the above categories of “protected veteran”\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147200004,\"name\":\"I do not fall into one of the above categories of “protected veteran”\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147201004,\"name\":\"I previously served in the military (US), but none of the above apply to me.\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147202004,\"name\":\"I don't wish to answer\",\"free_form\":false,\"decline_to_answer\":true}]},{\"id\":4024669004,\"name\":\"Do you have a disability? \",\"required\":true,\"answer_type\":{\"id\":null,\"key\":\"SINGLE_SELECT\"},\"answer_options\":[{\"id\":4147203004,\"name\":\"Yes, I have a disability, or have a history/record of having a disability\",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147204004,\"name\":\"No, I don’t have a disability, or a history/record of having a disability \",\"free_form\":false,\"decline_to_answer\":false},{\"id\":4147205004,\"name\":\"I don't wish to answer\",\"free_form\":false,\"decline_to_answer\":true}]}]}},\"urlToken\":\"insomniac\",\"submitPath\":\"https://boards.greenhouse.io/insomniac/jobs/5426164004\",\"confirmationPath\":\"/insomniac/jobs/5426164004/confirmation\",\"quickApply\":{\"active\":true,\"magicActive\":true,\"url\":\"https://my.greenhouse.io\",\"metadata\":{\"jobPostId\":5426164004}},\"recentlyLiveDepartments\":[{\"id\":4037279004,\"value\":4037279004,\"name\":\"Insomniac Games\",\"label\":\"Insomniac Games\"}]}},\"actionData\":null,\"errors\":null}};import \"https://job-boards.cdn.greenhouse.io/assets/manifest-ad71b604.js\"; import * as route0 from \"https://job-boards.cdn.greenhouse.io/assets/root-BnCAUtWF.js\"; import * as route1 from \"https://job-boards.cdn.greenhouse.io/assets/_url_token_.jobs_._job_post_id-DoEtqtB1.js\"; window.__remixRouteModules = {\"root\":route0,\"routes/$url_token_.jobs_.$job_post_id\":route1}; import(\"https://job-boards.cdn.greenhouse.io/assets/entry.client-BAoPr4om.js\");",
    "url": "https://job-boards.greenhouse.io/insomniac/jobs/5426164004",
    "created_at": "2025-01-27T15:43:39.889779+00:00"
  },
  {
    "id": "997f3097a3627fedecb3",
    "title": "Director of Growth, Integrated Marketing Campaigns",
    "company": "Hyperscience",
    "location": "Not specified (Remote status not mentioned)",
    "salary": "$138,000 - $207,000 base compensation range",
    "description": "Lead the development and execution of high-impact integrated demand generation campaigns and Sales Plays to drive awareness, engagement, and revenue growth for Hyperscience. This role involves designing integrated campaigns that align with brand, messaging, and sales goals, collaborating across teams for multi-channel campaigns targeting specific customer segments and stages of the buyer journey.",
    "requirements": [
      "Bachelor's or Master's degree in Marketing, Business Analytics, Data Science, Operations, or a related field.",
      "Proven 10+ years of experience in marketing leadership experience managing $100M+ in revenue pipeline in high-growth companies.",
      "Proven track record of driving successful go-to-market strategies, managing integrated campaigns that drive incremental revenue.",
      "Previous experience managing and leading a team of campaign managers and webinar managers.",
      "Excellent analytical skills with the ability to interpret data and make data-driven decisions.",
      "Detail-oriented with a focus on maintaining data accuracy and integrity.",
      "Exceptional communication and collaboration skills to work effectively with cross-functional teams."
    ],
    "responsibilities": [
      "Campaign Strategy & Planning: Lead the development of the annual integrated campaign & sales play strategy, ensuring alignment with company revenue goals and target customer segments.",
      "Multi-Channel Campaign Execution: Develop and manage integrated campaigns strategy across multiple channels, including email marketing, digital advertising, social media, content syndication, SDR outbound, ABM, and webinars.",
      "Performance Analysis & Optimization: Monitor and analyze campaign performance metrics to measure ROI and inform data-driven decision-making.",
      "Senior Leadership & Management: Mentor and manage a team of senior campaign managers.",
      "Budget Management & Forecasting: Develop and manage campaign budgets effectively, allocating resources based on anticipated ROI and strategic priority."
    ],
    "about_company": "Hyperscience is a market leader in hyperautomation and a provider of enterprise AI infrastructure software. The Hyperscience Hypercell platform automates end-to-end processes and transforms complex documents into LLM and RAG-ready data to power enterprise GenAI experiences. Leading organizations across the globe rely on Hyperscience to drive their hyperautomation initiatives.",
    "benefits": "Top-notch healthcare for you and your family\nA 100% 401(k) match for up to 6% of your annual salary\nFlexible PTO with the approval of your manager\n12 weeks of parental leave and an additional 4 weeks for birthing parents\nStock options",
    "raw_content": "<p><b style=\"font-size: 18px\">Company Description</b></p><p><span style=\"font-size: 10pt;\">Hyperscience is a market leader in hyperautomation and a provider of enterprise AI infrastructure software. The Hyperscience Hypercell platform unlocks the value of an organization’s back office data through the automation of end-to-end processes, and transforms complex documents into LLM and RAG-ready data to power enterprise GenAI experiences. This enables organizations to transform manual, siloed processes into a strategic advantage, resulting in a faster path to decisions, actions, and revenue; positive and engaging customer, public, and patient experiences; and dramatic increases in productivity.&nbsp;</span></p><p><br></p><p><span style=\"font-size: 10pt;\">Leading organizations across the globe rely on Hyperscience to drive their hyperautomation initiatives, including American Express, Charles Schwab, Fidelity, HM Revenue and Customs, Mars, Stryker, The United States Social Security Administration, and The United States Veterans Affairs. The company is funded by top tier investors including Bessemer Venture Partners, Battery, FirstMark, Stripes, and Tiger Global.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">As the Director of Growth, Integrated Marketing Campaigns, you will be responsible for leading the development and execution of high-impact integrated demand generation campaigns and Sales Plays that drive awareness, engagement, and revenue growth for Hyperscience. As a key contributor to our revenue strategy, you will design integrated campaigns and Sales Plays that align closely with our brand, messaging, and sales goals. You will be responsible for collaborating across teams to create and execute multi-channel campaigns targeting specific customer segments and stages of the buyer journey. This role is ideal for a seasoned marketing professional who thrives on data, creativity, and delivering measurable results.</span></p>\\n<p></p><p><br></p><b>Responsibilities</b><ul><li><b>Campaign Strategy &amp; Planning</b></li><li>Lead the development of the annual integrated campaign &amp; sales play strategy, ensuring alignment with company revenue goals and target customer segments.</li><li>Define campaign objectives, KPIs, and key messages to drive awareness, engagement, and conversion across multiple buyer personas, use cases and target industry verticals.</li><li>Prioritize and allocate resources across campaigns to ensure maximum impact, balancing quick wins with long-term brand-building initiatives.</li><li>Collaborate with Sales, product marketing, content, and digital teams to ensure that all campaigns are customer-centric, value-driven, and tailored to specific stages of the buyer journey.</li></ul><div><br></div><ul><li><b>Multi-Channel Campaign Execution</b></li><li>Develop and manage integrated campaigns strategy across multiple channels, including email marketing, digital advertising, social media, content syndication, SDR outbound, ABM, and webinars.</li><li>Oversee the creation of campaign assets such as landing pages, email sequences, ads, and content in partnership with creative and content teams.</li><li>Coordinate omnichannel execution to maintain consistency across platforms, ensuring that messaging and user experience align seamlessly with the campaign theme and company branding.</li><li>Deploy Account-Based Marketing (ABM) strategies in collaboration with the sales team to personalize outreach and prioritize high-value accounts.</li><li>Own the framework for defining and executing Sales Plays in collaboration with Sales, CSM and SDR leadership.</li></ul><div><br></div><ul><li><b>Performance Analysis &amp; Optimization</b></li><li>Monitor and analyze campaign performance metrics (CTR, MQLs, SQLs, conversions, pipeline influence) to measure ROI and inform data-driven decision-making.</li><li>Optimize campaigns continuously by using A/B testing, multivariate testing, and audience segmentation to improve targeting, engagement, and conversion rates.</li><li>Provide weekly and monthly reporting to the VP of Growth, along with insights and recommendations for improvement and future planning.</li><li>Leverage customer insights and market trends to refine and adjust campaign strategies for greater impact, especially for key accounts and target industries.&nbsp;</li></ul><div><br></div><ul><li><b>Senior Leadership &amp; Management</b></li><li>Mentor and manage a team of senior campaign managers that will collaborate to drive aspirational strategy that captures global demand for our suite of products and services.</li><li>Leverage data from the analytics teams to assess campaign performance to guide the channel mix, content and timing of future integrated campaigns.</li><li>Optimize across channels and adjust strategies to improve engagement, conversion rates, and ROI. Communicate performance and opportunities across stakeholders to improve organization-wide.&nbsp;</li></ul><div><br></div><ul><li><b>Budget Management &amp; Forecasting</b></li><li>Develop and manage campaign budgets effectively, allocating resources based on anticipated ROI and strategic priority.</li><li>Forecast and track campaign expenses, ensuring alignment with the overall marketing budget and company financial goals.</li><li>Identify cost-effective campaign tactics and tools that deliver high impact without over/underspending.</li></ul><p><br></p><b>Requirements</b><ul><li>Bachelor's or Master's degree in Marketing, Business Analytics, Data Science, Operations, or a related field.</li><li>Proven 10+ years of experience in marketing leadership experience managing $100M+ in revenue pipeline in high-growth companies&nbsp;</li><li>Proven track record of driving successful go-to-market strategies, managing integrated campaigns that drive incremental revenue.</li><li>Previous experience managing and leading a team of campaign managers and webinar managers.</li><li>Excellent analytical skills with the ability to interpret data and make data-driven decisions.</li><li>Detail-oriented with a focus on maintaining data accuracy and integrity.</li><li>Exceptional communication and collaboration skills to work effectively with cross-functional teams.</li></ul><p><br></p><p></p>\\n<p><span style=\"font-size: 11pt;\">The target base compensation range for this role: $138,000 - $207,000.&nbsp; Actual compensation will be&nbsp;dependent upon the individuals skills, experience, qualifications, geographical location, and our&nbsp;business needs and objectives.&nbsp; Our overall compensation packages include base salary, equity and the benefits and perks listed below. </span><span style=\"font-size: 10.5pt;\">Our Talent Acquisition team will speak more about our Total Rewards philosophy and approach during the hiring process.</span></p><p><br></p><p><b style=\"font-size: 18px\">Benefits</b></p><p>- Top-notch healthcare for you and your family</p><p>- A 100% 401(k) match for up to 6% of your annual salary</p><p>- Flexible PTO with the approval of your manager</p><p>- 12 weeks of parental leave and an additional 4 weeks for birthing parents</p><p>- Stock options</p><p><br></p><p><i>We are an equal opportunity employer. We welcome people of different backgrounds, experiences, abilities and perspectives. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.</i></p><p><br></p><p>---</p><p><br></p><p>PLEASE BE AWARE of, and cautious about, potential recruitment fraud.&nbsp; All of our open jobs can be found directly on our careers page at:</p><p><a class=\"postings-link\" href=\"https://www.hyperscience.com/about-us/careers/open-positions/\">https://www.hyperscience.com/about-us/careers/open-positions/</a></p><p><br></p><p>We will never communicate with candidates except via our @hyperscience.com email domain. Any communication you receive outside of these parameters is potentially fraudulent.&nbsp;&nbsp;</p><p><br></p><p>Additionally, we never conduct interviews solely via online tests, nor do we make job offers without multiple cross functional live interviews via Zoom, phone or onsite.&nbsp; We only ask for personal information via our application process on our careers page or through a verifiable background check company during onboarding.</p>",
    "url": "https://jobs.lever.co/hyperscience/426d21f1-4350-42aa-8d48-37f464ca5587",
    "created_at": "2025-01-27T16:14:55.169023+00:00"
  },
  {
    "id": "99ae58650d5a24d76f53",
    "title": "Head of Demand Generation",
    "company": "Not specified",
    "location": "Not specified (remote status not mentioned)",
    "salary": "Competitive salary with equity options",
    "description": "Lead the demand generation strategy within the enterprise automation sector, focusing on innovative strategies, collaboration with specialized agencies, and leveraging Generative AI to enhance productivity and maintain competitive advantage.",
    "requirements": [
      "Strategic leadership with a deep understanding of enterprise B2B SaaS markets, especially in automation and AI.",
      "Ability to leverage the latest technology, particularly GenAI, for productivity enhancements in marketing.",
      "Proven track record in fast-paced environments with swift strategic planning and implementation.",
      "Skilled in managing relationships and outputs from specialized marketing agencies."
    ],
    "responsibilities": [
      "Ownership of lead generation goals and strategy.",
      "Versatile and creative approach to channel strategy.",
      "Collaboration and oversight of specialized agencies.",
      "Analytics and performance management to ensure campaign success.",
      "Leading the use of GenAI to transform content generation and distribution.",
      "Ensuring the brand's omnipresence in the target market's journey."
    ],
    "about_company": "A growing SaaS company at the forefront of marketing innovation, offering the opportunity to work with cutting-edge technology and top industry talent in a flexible work environment.",
    "benefits": "Role at the forefront of marketing innovation.\nOpportunity to work with cutting-edge technology and top industry talent.\nFlexible work environment valuing speed, creativity, and efficiency.\nCompetitive salary with equity options.",
    "raw_content": "<h1>Your mission</h1><p>Join our team as the Head of Demand Generation, reporting to the Chief Marketing Officer, and assume full responsibility for our lead generation objectives, devising cutting-edge strategies to stimulate demand within the enterprise automation sector. You'll shift seamlessly between high-level strategic planning and closely collaborating hands-on with specialised agencies to bring your vision to life, guaranteeing a cohesive approach to strategy, execution, and swift adaptation across a multitude of marketing channels. In this critical role, you will also direct our company toward embracing Generative AI to significantly boost productivity and preserve our competitive advantage through agility and swift execution.</p><br><h1>Your profile</h1><p><strong>Strategy:</strong><br><ul><li><strong>Ownership of Lead Gen Goals:</strong> Spearhead our lead generation strategy, taking full ownership of goals and deliverables, ensuring a steady pipeline of qualified leads.</li><li><strong>Versatility and Creativity:</strong> Bring a versatile and creative approach to channel strategy, avoiding a siloed focus on single channels or tactics to foster a dynamic and integrated marketing environment.</li><li><strong>Channel Strategy and Evaluation:</strong> Navigate the rapidly evolving landscape of marketing channels and platforms, always prepared to adjust and optimise strategies in response to algorithmic changes and platform updates.</li></ul><strong>Execution:</strong><br><ul><li><strong>Agency Collaboration and Oversight:</strong> Oversee and collaborate with top-tier, highly specialised agencies for each channel, ensuring that they are unlocking their full potential and leveraging GenAI to alleviate bottlenecks and focus on message distribution.</li><li><strong>Analytics &amp; Performance Management:</strong> Utilise your analytical prowess to critically assess and pivot strategies, ensuring that the campaigns deliver on performance metrics and contribute to the company’s rapid growth.</li></ul><strong>Qualifications:</strong><br><ul><li><strong>Strategic Leadership:</strong> Demonstrated ability to lead demand generation strategies with a keen understanding of enterprise B2B SaaS markets, especially in automation and with a strong AI focus.</li><li><strong>Technology Leveraging:</strong> Capacity to utilise the latest technology, especially GenAI, to achieve massive productivity enhancements in marketing efforts.</li><li><strong>Rapid Implementation:</strong> A proven track record in fast-paced environments, showcasing swift strategic planning and implementation to keep up with market dynamics.</li><li><strong>Agency Management:</strong> Skilled in managing relationships and outputs from specialised marketing agencies, ensuring they meet our ambitious demand generation targets.</li></ul><strong>Vision for the Team:</strong><br><ul><li><strong>Leveraging GenAI:</strong> You will lead the use of GenAI to revolutionise how our marketing teams operate, transforming content generation from a bottleneck to a strategic asset.</li><li><strong>Focus on Distribution:</strong> With content creation streamlined, your focus will be on crafting and supervising the distribution of messages across channels, ensuring our presence resonates throughout the enterprise customer journey.</li><li><strong>Staying Current:</strong> Keeping our strategies ahead of the curve by collaborating with agencies that specialise in staying up-to-date with the rapid changes of today’s marketing channels.</li></ul><strong>Your Role in Our Evolution:</strong><br><ul><li>This role demands a dynamic individual who can ensure that our brand maintains omnipresence in our target market's journey, capturing demand effectively when the time is right.</li><li>As marketing evolves with GenAI, you will be the leader who ensures that our marketing org and partners are fully harnessing its capabilities, positioning us as a forward-thinking player in the enterprise automation space.</li></ul></p><br><h1>What we offer</h1><p><ul><li>A role at the forefront of marketing innovation within a growing SaaS company.</li><li>The opportunity to work with cutting-edge technology and top industry talent.</li><li>A flexible work environment that values speed, creativity, and efficiency.</li><li>A competitive salary with equity options, reflecting your critical role in our growth.</li></ul></p>",
    "url": "https://deepopinion.jobs.personio.com/job/1546136",
    "created_at": "2025-01-24T12:01:17.372236+00:00"
  },
  {
    "id": "9f3634c40c0abbbe5657",
    "title": "Strategic Territory Owner",
    "company": "Winning by Design",
    "location": "Remote",
    "salary": "Not specified",
    "description": "The role involves establishing oneself as a trusted advisor to executive teams, becoming a brand champion for Winning by Design, leading with purpose to craft client solutions, forging strategic alliances, and mentoring team members.",
    "requirements": [
      "10+ years of success in leadership roles within marketing, sales, customer success, sales strategy, or revenue operations",
      "2-3 years of direct consulting experience",
      "Analytical and data-driven approach to analysis and decision-making",
      "Ability to establish rapport with C-suite executives",
      "Proficiency in modern revenue tech platforms and revenue enablement best practices"
    ],
    "responsibilities": [
      "Strategic Territory Ownership",
      "Brand Champion",
      "Lead with Purpose",
      "Forge Strategic Alliances",
      "Mentor and Inspire"
    ],
    "about_company": "Not specified",
    "benefits": "Comprehensive Benefits Package for US candidates including health and retirement benefits\nGlobal, Remote-First Team culture",
    "raw_content": "<p>Description:</p><ul><li> Strategic Territory Ownership: Establish yourself as a trusted advisor, guiding executive teams within key accounts toward long-term growth and measurable results.</li><li> Brand Champion: Become an influential voice for Winning by Design through public speaking, expert content creation, and active networking within your local business community.</li><li> Lead with Purpose: Collaborate with our world-class internal team to craft client solutions that excel in both strategy and execution.</li><li> Forge Strategic Alliances: Nurture valuable relationships with VCs, PE firms, and key industry organizations to open up a pipeline of high-potential opportunities.</li><li> Mentor and Inspire: Share your in-depth SaaS knowledge and revenue enablement insights, guiding team members on their journey to become top performers.</li></ul><p>Requirements:</p><ul><li> Seasoned SaaS Leader: You have 10+ years of demonstrated success in leadership roles within marketing, sales, customer success, sales strategy, or revenue operations, including 2-3 years of direct consulting experience.</li><li> Analytical Powerhouse: Your track record and case studies reveal an unwavering data-driven approach to analysis and decision-making.</li><li> Relationship Builder: You confidently establish rapport with C-suite executives, tailoring your recommendations to their specific business needs.</li><li> Tech-Forward Strategist: Your proficiency in modern revenue tech platforms and revenue enablement best practices empowers you to optimize sales processes and enhance team performance.</li></ul><p>Benefits:</p><ul><li> Comprehensive Benefits Package: US candidates have access to health and retirement benefits.</li><li> Global, Remote-First Team: Work alongside a talented team of innovators within a culture that embraces a distributed workforce.</li></ul>",
    "url": "https://www.remoterocketship.com/company/winningbydesign/jobs/managing-director-united-states",
    "created_at": "2025-01-27T16:37:19.242012+00:00"
  },
  {
    "id": "aa7f8c7eca556f5ba905",
    "title": "VP of Marketing, EMEA",
    "company": "Rimini Street, Inc.",
    "location": "Remote - U.K.",
    "salary": "Compensation, bonuses, and benefits to match the skills of top-performing team members",
    "description": "The VP of Marketing, EMEA, will evolve the theatre marketing strategy and plans to drive new logo acquisition and customer expansion by delivering on the opportunity of our expansive solution set. This role involves directing and managing a field marketing team across active markets in EMEA, reporting directly to the General Manager of EMEA with a tight alignment to the CMO.",
    "requirements": [
      "15+ years of cross marketing experience",
      "including Field",
      "Digital",
      "Event",
      "Partner",
      "Communications and Global. Solid integrated marketing function mastery",
      "excellent leadership and influencing skills",
      "strong project management and people management skills. Bachelor’s degree in Marketing or Communications preferred",
      "or equivalent professional experience. Master’s in marketing or business preferred."
    ],
    "responsibilities": [
      "Attract",
      "develop",
      "coach a remote",
      "and high performing marketing team. Create an inclusive",
      "dynamic working environment. Engage with internal stakeholders across a wide range of departments. Design",
      "plan and execute and measure effective lead generation campaigns. Develop and execute an integrated multi touch",
      "multi-channel marketing strategy and plan across the EMEA region. Ensure Rimini Street and 3rd party events are on brand and on message. Develop in region client stories. Track & Measure campaign effectiveness. Forecast",
      "and be accountable",
      "for quarterly lead and pipeline targets. Manage and review the marketing budget."
    ],
    "about_company": "Rimini Street, Inc. is a global provider of end-to-end enterprise software support and innovation solutions and the leading third-party support provider for Oracle, SAP and VMware software. The Company has signed thousands of contracts with Fortune Global 100, Fortune 500, midmarket, public sector and government organizations. Rimini Street is committed to creating a diverse and inclusive environment and is proud to be an Equal Employment Opportunity Employer.",
    "benefits": "Compensation, bonuses, and benefits to match the skills of top-performing team members. Opportunity to work in a fast-paced environment, grow together, and learn new skills. Challenging and meaningful work with a sense of achievement and purpose guided by core values: Company, Colleagues, Clients, Community.",
    "raw_content": "About Rimini Street, Inc. Rimini Street, Inc. (Nasdaq: RMNI), a Russell 2000® company, is a global provider of end-to-end enterprise software support and innovation solutions and the leading third-party support provider for Oracle, SAP and VMware software. The Company offers a comprehensive portfolio of united solutions to run, manage, support, customize, configure, connect, protect, monitor, and optimize enterprise application, database, and technology software. The Company has signed thousands of contracts with Fortune Global 100, Fortune 500, midmarket, public sector and government organizations who selected Rimini Street as their trusted, proven mission-critical enterprise software solutions provider and achieved better operational outcomes, realized billions of US dollars in savings and funded AI and other innovation investments. Position Summary The VP of Marketing, EMEA, will evolve the theatre marketing strategy and plans to drive new logo acquisition and customer expansion by delivering on the opportunity of our expansive solution set. As an active part of the EMEA Leadership Team, this person will help drive regional growth, building upon the Company’s strengths in existing markets as well as establishing Rimini Street expansion into new markets in conjunction with the global marketing team to extend and localize global programs. This position will direct and manage a field marketing team across our active markets in EMEA, and report directly to the General Manager of EMEA with a tight alignment to the CMO. The ideal candidate will have a proven track record of leading a marketing function across EMEA with experience in one or more of the countries where we operate, and highly capable of operating in a matrixed organization, balancing the needs of both Corporate and Regional parties. Success in this role will require the ability to both think strategically, execute locally, both individually and through the team. Essential Duties and Responsibilities Team Leadership Attract, develop, coach a remote, and high performing marketing team Create an inclusive, dynamic working environment that motivates the team and creates a path for growth Keep up to date on market trends &amp; competitor strategies Engage with internal stakeholders across a wide range of departments from Marketing, Revenue Teams, Global Client Engagement, Product and Global Operations Demand Generation &amp; Pipeline Design, plan and execute and measure effective lead generation campaigns to fuel pipeline growth focusing on net new, acquisition and industry Develop and execute an integrated multi touch, multi-channel marketing strategy and plan across the EMEA region focused on the correct target segments with the most effective messaging and CTAs to reach decision makers in the region Ensure Rimini Street and 3rd party events are on brand and on message, well executed, promotes the brand, and generate leads Developing an executive level program that include, executive networking events, roundtables, and integrated programs Develop in region client stories Track &amp; Measure Work closely with Global Campaigns and Marketing Operations to implement metrics to measure campaign effectiveness Conduct regular regional marketing and sales reviews – present impact of marketing efforts on sales pipeline, identify gaps in strategy, and revise marketing strategies to fill gaps Forecast, and be accountable, for quarterly lead and pipeline targets Generate and achieve marketing created pipeline targets for each active region in EMEA Manage and review the marketing budget with a disciplined focus on the key outcomes for your regions Education Bachelor’s degree in Marketing or Communications preferred, or equivalent professional experience Master’s in marketing or business preferred Location Remote - U.K. Experience   15+ years of cross marketing experience, including Field, Digital, Event, Partner, Communications and Global Qualifications &amp; Skills Solid integrated marketing function mastery, excellent leadership and influencing skills, strong project management and people management skills, especially around promoting cross-functional collaboration in a matrix environment, while driving a discipline of data-driven marketing ROI tracking and measurement. Cultural fit is critical, motivation to work at a fast-moving company that focuses on clients, excellence, teamwork, and success Strong executive presence, solid track record of strategic accomplishments in companies experiencing rapid growth and expansion where constant challenges are the norm. Extensive experience running marketing at a high-tech or services company within EMEA Expertise across marketing, including demand generation, client acquisition, industry marketing, digital marketing &amp; performance marketing Excellent written &amp; verbal communication skills with the ability to effectively convey Rimini Street offerings and value propositions in a clear manner through written and verbal means A self-motivated strategic thinker, a problem solver, and enjoys executing autonomously in a hands-on manner Demonstrated ability to interface with all levels of senior management and working collaboratively with multiple stakeholders in a fast-paced, matrix environment Proven ability to build strong relationships with revenue organizations Demonstrable experience of building and motivating high-functioning remote teams Ability to lead across cross-functional teams, ability to multi-task and proactively manage expectations of regional leadership team and collaborating with corporate marketing Cheerful with an attention to detail, and the ability to meet tight timelines Why Rimini Street? We are looking for talented, passionate people to help us build our future at Rimini Street. We hire only the best, the most extraordinary professionals and provide compensation, bonuses, and benefits to match the skills of our top-performing team members. Do you thrive in a fast-paced environment, enjoy growing together, and get excited about learning new skills? Are you looking for an opportunity to make a true impact as part of a team of extraordinary professionals? This is the place for you. Our work is challenging and meaningful. We start and end each day with a sense of achievement and purpose guided by our core values, the Four Cs: Company We dream big and innovate boldly. Colleagues We work with extraordinary people who create a culture of mutual respect and collaboration. Clients We relentlessly pursue solutions that help clients achieve their goals. Our unmatched client care is rooted in our passion for exceptional service. Community We believe in leaving the world a better place than we found it. With the Rimini Street Foundation, we’ve made positive impacts in six continents for over 425 charities. Accelerating Company Growth Nasdaq-listed under ticker symbol RMNI since October 2017 Over 5,800 signed contracts to date, including Fortune 500 and Global 100 companies Over 2,000 team members in 23 countries US and international recognition for industry leadership and philanthropic efforts. See all of our awards and recognitions here: https://www.riministreet.com/company/awards/ Rimini Street is committed to creating a diverse and inclusive environment and is proud to be an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, national origin, sexual orientation, gender or gender identity, disability, protected veteran status, or any other characteristic protected by law. To learn more about how Rimini Street is redefining the enterprise software support industry, visit http://www.riministreet.com Please Note: Rimini Street does not accept resumes submitted by recruiting/staffing firms unless specifically requested by Human Resources. Unsolicited resumes will be ineligible for referral fees. In 2005, we disrupted the industry by pioneering extraordinary enterprise software support powered by extraordinary people. Our work is challenging and meaningful, allowing everyone at Rimini Street to start and end each day with a sense of achievement and purpose. We are looking for talented, passionate people to help us build our future at Rimini Street. Feel free to connect with us by signing up to receive updates on new jobs and opportunities! Create an account and sign up to create your job alerts! Link below: Rimini Street Career Job Alerts",
    "url": "https://riministreet.wd1.myworkdayjobs.com/riministreet/job/Remote-United-Kingdom/VP-Marketing--EMEA_R-101411",
    "created_at": "2025-01-28T20:59:32.038074+00:00"
  },
  {
    "id": "b933ddee42aa08a3de1c",
    "title": "Vice President of Revenue & Performance Marketing",
    "company": "ActiveCampaign",
    "location": "Not specified (remote status not mentioned)",
    "salary": "$232,000 - $319,000 (per year salary), excluding bonus, equity or sales incentives",
    "description": "Build and drive the marketing growth engine for ActiveCampaign, focusing on full-funnel performance investment strategy in partnership with the CMO and key GTM partners.",
    "requirements": [
      "12+ Years in Marketing and/or related field with 8+ years in people leadership",
      "SaaS Experience",
      "MarTech or adjacent industry experience",
      "led larger and diverse marketing sub-teams",
      "ability to balance a data-informed approach with the art side of the marketing craft",
      "expert knowledge of owned and paid channel strategies",
      "superb communications skills",
      "experience in both SMB and Enterprise B2B is preferred."
    ],
    "responsibilities": [
      "Managing and leading a high-performing team",
      "developing effective GTM strategies",
      "planning and optimizing growth programs",
      "driving a continuous partnership with cross-functional GTM leaders",
      "reporting on marketing performance",
      "developing integrated and creative campaigns",
      "driving an optimal customer experience",
      "acting as a culture leader within and outside of marketing."
    ],
    "about_company": "ActiveCampaign helps small teams power big businesses with the must-have platform for intelligent marketing automation. It is a global multicultural company proud of its inclusive culture which embraces diverse voices, backgrounds, and perspectives. ActiveCampaign holds the highest customer satisfaction rating among Marketing Automation, E-Commerce Personalization, Landing Page Builders, and CRM solutions on G2.com and is one of only a handful of software solutions with over 10,000 positive reviews.",
    "benefits": "Comprehensive health and wellness benefits including a High Deductible Health Plan (HDHP) fully covered by ActiveCampaign, complimentary access to telehealth and tele-mental health resources, a complimentary membership to Calm, open paid time off, generous 401(k) matching program with immediate vesting, quarterly Path Perks with options for commuter and lunch benefits or a remote home office stipend, access to professional development resources through LinkedIn Learning, after five years of service, eligibility for a four-week paid sabbatical leave and a sabbatical leave bonus.",
    "raw_content": "Skip to content As the Vice President of Revenue & Performance Marketing, you will build and drive the marketing growth engine for ActiveCampaign. In this role you will help drive our full-funnel performance investment strategy in direct partnership with the CMO, and key GTM partners. You have extensive experience in developing innovative cross-channel GTM programs in a multiple GTM strategy environment inclusive of self-serve (free or trial), sales led, and partner GTM channels. You can simultaneously drive investment strategy, execution, and continuous optimization with a growth mindset. You are an expert in effectively developing strong and influential relationships with GTM partners - understanding the importance of working hand in hand with our revenue partners to drive alignment, and business performance. You are an effective storyteller with the ability to clearly communicate marketing performance, roadmaps, trade-offs and prioritizations. You understand the importance of working in direct partnership with product marketing, brand leaders, and revenue teams to continuously optimize the customer experience through compelling, timely, resonant, and differentiated creative. You are also an authentic and conscious leader that can simultaneously drive a highly performant marketing team with a builder mindset. Managing and leading a high-performing team that you have designed and builtWorking with your brand, product marketing, and revenue peers to not only develop effective GTM strategies, but drive continuous testing and optimization of program investmentsPlanning, building, executing, and optimizing prioritized growth programs with our revenue and product partners, effectively helping to meet and exceed business objectivesDriving a continuous partnership with cross-functional GTM leaders to drive efficient and effective business performanceReporting out on marketing performance on a weekly, monthly, quarterly, and annual basisWorking closely with the CMO and other marketing executives to develop and continuously refine our program/working dollars investment strategiesDeveloping integrated and creative campaigns and programs across paid and owned channelsHelping drive an optimal customer experience throughout all customer touch points, ultimately improving conversion, performance, and brand affinityActing as a culture leader within and outside of marketing, showcasing the ActiveCampaign values in action 12+ Years in Marketing and/or related field with 8+ years in people leadershipSaaS ExperienceMarTech or adjacent industry experience Have led larger and diverse marketing sub-teams, inclusive of paid, owned, and partner marketing teamsAbility to balance a data-informed approach with the art side of the marketing craft throughout the investment and optimization strategiesA data storyteller - one that not only understands marketing investment performance - but most importantly the impact to both short-term and long-term business objectivesExpert knowledge of owned and paid channel strategies, and the integration of those throughout the entire customer life-cycle - from awareness to retentionSuperb communications skills across all mediums, and all levels of the organizationCan skillfully and succinctly communicate marketing strategies, ROI, performance, and trade-offs to all levels of the organizationAbility to successfully plan, build, execute, and optimize programs with our revenue and product partners, effectively helping to drive the entire ActiveCampaign GTM engine to successDrive a mentality of continuous optimization, growth, and performance throughout the marketing teamExperience in both SMB and Enterprise B2B is preferred Compensation: $232,000 - $319,000 (per year salary) Compensation details listed in this posting reflect the base rate only and do not include bonus, equity or sales incentives, if applicable.ActiveCampaign believes in and is committed to equitable compensation practices. The salary range provided above is a good faith estimate of the pay range determined by the location associated with the job posting. The actual salary depends on a candidate’s skills, experience, and work location. Candidates may also be eligible for other role-specific compensation such as equity, an annual performance bonus, or other incentive compensation depending on the role. About ActiveCampaign:ActiveCampaign helps small teams power big businesses with the must-have platform for intelligent marketing automation. Customers from over 170 countries depend on ActiveCampaign’s mix of pre-built automations and integrations (including Facebook, Google, WordPress, Salesforce, Shopify, and Square) to power personalized marketing, transactional emails, and one-to-one CRM interactions throughout the customer lifecycle. As a global multicultural company, we are proud of our inclusive culture which embraces diverse voices, backgrounds, and perspectives. We don’t just celebrate our differences, we believe our diversity is what empowers our innovation and success. You can find out more about our DEI initiatives here. ActiveCampaign holds the highest customer satisfaction rating among Marketing Automation, E-Commerce Personalization, Landing Page Builders, and CRM solutions on G2.com and is one of only a handful of software solutions with over 10,000 positive reviews. ActiveCampaign has also been named the Top Rated Email Marketing Software on TrustRadius. Learn more and start your free trial at ActiveCampaign.com.Perks and benefits:ActiveCampaign is an employee-first culture. We take care of our employees at work and outside of work. You can see more of the details here, but some of our most popular benefits include:-Comprehensive health and wellness benefits that includes a High Deductible Health Plan (HDHP) fully covered by ActiveCampaign, complimentary access to telehealth and tele-mental health resources, and a complimentary membership to Calm-Open paid time off-Generous 401(k) matching program with immediate vesting-Quarterly Path Perks with options for commuter and lunch benefits (for those reporting to a Hub), or a remote home office stipend-Access to professional development resources through LinkedIn Learning-After five years of service, you’ll be eligible for a four-week paid sabbatical leave and a sabbatical leave bonusActiveCampaign is an equal opportunity employer. We recruit, hire, pay, grow and promote no matter of gender, race, color, sexual orientation, religion, age, protected veteran status, physical and mental abilities, or any other identities protected by law. Our Employee Resource Groups (ERGs) strive to foster a diverse inclusive environment by supporting each other, building a strong sense of belonging, and creating opportunities for mentorship and professional growth for their members. Apply Now var trackac = document.createElement(\"script\"); trackac.defer = true; trackac.type = \"text/javascript\"; trackac.src = \"//www.activecampaign.com/_track.php?r=\"+encodeURIComponent(document.referrer)+\"&u=\"+encodeURIComponent(window.location.href); var trackac_s = document.getElementsByTagName(\"script\"); if (trackac_s.length) { trackac_s[0].parentNode.appendChild(trackac); } else { var trackac_h = document.getElementsByTagName(\"head\"); trackac_h.length && trackac_h[0].appendChild(trackac); } function setCookie(name, value, days) { var expires = \"\"; if (days) { var date = new Date(); date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000)); expires = \"; expires=\" + date.toUTCString(); } document.cookie = name + \"=\" + (value || \"\") + expires + \"; path=/\"; } var url = window.location.href; var arr = url.match(/(\\?|&)_r=([^&]*)/); if (arr) { setCookie(\"acAffiliate\", arr[2], 90); } document.addEventListener('DOMContentLoaded', function() { Sentry.onLoad(function() { Sentry.init({ environment: \"{{ if { env:APP_ENV } === 'dev' }}development{{ else }}{{ if { env:IS_STAGING } }}staging{{ else }}production{{ /if }}{{ /if }}\", denyUrls: [ /* Facebook flakiness */ /graph\\.facebook\\.com/i, /* Facebook blocked */ /connect\\.facebook\\.net\\/en_US\\/all\\.js/i, /* Woopra flakiness */ /eatdifferent\\.com\\.woopra-ns\\.com/i, /static\\.woopra\\.com\\/js\\/woopra\\.js/i, /* Chrome extensions */ /extensions\\//i, /^chrome:\\/\\//i, /* Other plugins */ /127\\.0\\.0\\.1:4001\\/isrunning/i, /* Cacaoweb */ /webappstoolbarba\\.texthelp\\.com\\//i, /metrics\\.itunes\\.apple\\.com\\.edgesuite\\.net\\//i, // Ignore Google flakiness /\\/(gtm|ga|analytics)\\.js/i ], ignoreErrors: [ /* Random plugins/extensions */ 'top.GLOBALS', /* See: http://blog.errorception.com/2012/03/tale-of-unfindable-js-error.html */ 'originalCreateNotification', 'canvas.contentDocument', 'MyApp_RemoveAllHighlights', 'http://tt.epicplay.com', 'https://distillery.wistia.com', 'Can\\'t find variable: ZiteReader', 'jigsaw is not defined', 'ComboSearch is not defined', 'http://loading.retry.widdit.com/', 'atomicFindClose', /* Facebook borked */ 'fb_xd_fragment', /* ISP \"optimizing\" proxy - `Cache-Control: no-transform` seems to / reduce this. (thanks @acdha) / See http://stackoverflow.com/questions/4113268 */ 'bmi_SafeAddOnload', 'EBCallBackMessageReceived', /* See http://toolbar.conduit.com/Developer/HtmlAndGadget/Methods/JSInjection.aspx */ 'conduitPage', // Ignore Google flakiness /\\/(gtm|ga|analytics)\\.js/i, ], blacklistUrls: [ /* Facebook flakiness */ /graph\\.facebook\\.com/i, /* Facebook blocked */ /connect\\.facebook\\.net\\/en_US\\/all\\.js/i, /* Woopra flakiness */ /eatdifferent\\.com\\.woopra-ns\\.com/i, /static\\.woopra\\.com\\/js\\/woopra\\.js/i, /* Chrome extensions */ /extensions\\//i, /^chrome:\\/\\//i, /* Other plugins */ /127\\.0\\.0\\.1:4001\\/isrunning/i, /* Cacaoweb */ /webappstoolbarba\\.texthelp\\.com\\//i, /metrics\\.itunes\\.apple\\.com\\.edgesuite\\.net\\//i, // Ignore Google flakiness /\\/(gtm|ga|analytics)\\.js/i ] }); }); }) (function () { var storageCheck = (function() { var uid = 'ACLocalStorageTest'; var result; try { localStorage.setItem(uid, uid); result = localStorage.getItem(uid) === uid; localStorage.removeItem(uid); return result && localStorage; } catch (exception) {} }()); var initGeoField = function (locationField) { if (locationField && locationField.value.match(/^([A-Z]{2})/)) { if (storageCheck && localStorage.getItem('GeoLoc') && localStorage.getItem('GeoLoc').match(/^([A-Z]{2})/)){ locationField.value = localStorage.getItem('GeoLoc'); } else { fetch('https://www.activecampaign.com/wp-content/themes/activecampaign/json/location.php') .then(res => res.json()) .then((out) => { if (storageCheck && out.location !== 'XX'){ localStorage.setItem('GeoLoc', out.location); } //console.log('Original Location: ', locationField.value); locationField.value = out.location //console.log('Updated Location: ', locationField.value); }).catch(err => console.error(err)); } } } // Elementor Forms var forms = document.querySelectorAll('.elementor-form'); if (forms) { forms.forEach(function (item) { var locationField = item.querySelector('.elementor-field-type-hidden > input[type=hidden]'); if (locationField){ initGeoField(locationField); } }); } // Blog Signup var fields = document.querySelectorAll('input[data-name=\"geoip_country\"]'); if (fields) { fields.forEach(function (locationField) { initGeoField(locationField); }); } })(); (function(){ const setSessionParams = () => { const urlParams = new URLSearchParams(location.search); const trackedParameters = [ 'cid', 'mMact', 'mMc', 'mMsta', 'mMt', 'utm_campaign', 'utm_medium', 'utm_source', 'wid' ]; if (urlParams){ trackedParameters.forEach((param) => { if (urlParams.has(param)){ sessionStorage.setItem(param,urlParams.get(param)); } }) } } //check referring domain const setReferringDomain = () => { if (sessionStorage.getItem('referring_domain') === null){ try { let url = (new URL(document.referrer)); if (url.host){ // ignore staging and live environments if (!url.host.includes('wpengine') && !url.host.includes('activecampaign')){ sessionStorage.setItem('referring_domain', url.host); } } } catch (e){ //console.log(e); } } } setReferringDomain(); setSessionParams(); })() var countVars = {\"disqusShortname\":\"activecampaign\"}; \"use strict\";var _createClass=function(){function defineProperties(target,props){for(var i=0;i<props.length;i++){var descriptor=props[i];descriptor.enumerable=descriptor.enumerable||!1,descriptor.configurable=!0,\"value\"in descriptor&&(descriptor.writable=!0),Object.defineProperty(target,descriptor.key,descriptor)}}return function(Constructor,protoProps,staticProps){return protoProps&&defineProperties(Constructor.prototype,protoProps),staticProps&&defineProperties(Constructor,staticProps),Constructor}}();function _classCallCheck(instance,Constructor){if(!(instance instanceof Constructor))throw new TypeError(\"Cannot call a class as a function\")}var RocketBrowserCompatibilityChecker=function(){function RocketBrowserCompatibilityChecker(options){_classCallCheck(this,RocketBrowserCompatibilityChecker),this.passiveSupported=!1,this._checkPassiveOption(this),this.options=!!this.passiveSupported&&options}return _createClass(RocketBrowserCompatibilityChecker,[{key:\"_checkPassiveOption\",value:function(self){try{var options={get passive(){return!(self.passiveSupported=!0)}};window.addEventListener(\"test\",null,options),window.removeEventListener(\"test\",null,options)}catch(err){self.passiveSupported=!1}}},{key:\"initRequestIdleCallback\",value:function(){!1 in window&&(window.requestIdleCallback=function(cb){var start=Date.now();return setTimeout(function(){cb({didTimeout:!1,timeRemaining:function(){return Math.max(0,50-(Date.now()-start))}})},1)}),!1 in window&&(window.cancelIdleCallback=function(id){return clearTimeout(id)})}},{key:\"isDataSaverModeOn\",value:function(){return\"connection\"in navigator&&!0===navigator.connection.saveData}},{key:\"supportsLinkPrefetch\",value:function(){var elem=document.createElement(\"link\");return elem.relList&&elem.relList.supports&&elem.relList.supports(\"prefetch\")&&window.IntersectionObserver&&\"isIntersecting\"in IntersectionObserverEntry.prototype}},{key:\"isSlowConnection\",value:function(){return\"connection\"in navigator&&\"effectiveType\"in navigator.connection&&(\"2g\"===navigator.connection.effectiveType||\"slow-2g\"===navigator.connection.effectiveType)}}]),RocketBrowserCompatibilityChecker}(); var RocketPreloadLinksConfig = {\"excludeUris\":\"\\/it\\/sales-crm|\\/br\\/marketing-automation|\\/br\\/email-marketing|\\/lp\\/sem\\/marketing-automation|\\/about|\\/es\\/marketing-automation|\\/about\\/events|\\/resources\\/customer-enablement-workshops|\\/security\\/security-package|\\/email-marketing|\\/contact|\\/search|\\/customer-experience-automation|\\/br\\/feature\\/marketing-automation|\\/br\\/glossary\\/dmarc|\\/about\\/diversity-equity-inclusion|\\/(?:.+\\/)?feed(?:\\/(?:.+\\/?)?)?$|\\/(?:.+\\/)?embed|\\/(index\\\\.php\\/)?wp\\\\-json(\\/.*|$)|\\/refer\\/|\\/go\\/|\\/recommend\\/|\\/recommends\\/\",\"usesTrailingSlash\":\"\",\"imageExt\":\"jpg|jpeg|gif|png|tiff|bmp|webp|avif|pdf|doc|docx|xls|xlsx|php\",\"fileExt\":\"jpg|jpeg|gif|png|tiff|bmp|webp|avif|pdf|doc|docx|xls|xlsx|php|html|htm\",\"siteUrl\":\"https:\\/\\/www.activecampaign.com\",\"onHoverDelay\":\"100\",\"rateThrottle\":\"3\"}; (function() { \"use strict\";var r=\"function\"==typeof Symbol&&\"symbol\"==typeof Symbol.iterator?function(e){return typeof e}:function(e){return e&&\"function\"==typeof Symbol&&e.constructor===Symbol&&e!==Symbol.prototype?\"symbol\":typeof e},e=function(){function i(e,t){for(var n=0;n<t.length;n++){var i=t[n];i.enumerable=i.enumerable||!1,i.configurable=!0,\"value\"in i&&(i.writable=!0),Object.defineProperty(e,i.key,i)}}return function(e,t,n){return t&&i(e.prototype,t),n&&i(e,n),e}}();function i(e,t){if(!(e instanceof t))throw new TypeError(\"Cannot call a class as a function\")}var t=function(){function n(e,t){i(this,n),this.browser=e,this.config=t,this.options=this.browser.options,this.prefetched=new Set,this.eventTime=null,this.threshold=1111,this.numOnHover=0}return e(n,[{key:\"init\",value:function(){!this.browser.supportsLinkPrefetch()||this.browser.isDataSaverModeOn()||this.browser.isSlowConnection()||(this.regex={excludeUris:RegExp(this.config.excludeUris,\"i\"),images:RegExp(\".(\"+this.config.imageExt+\")$\",\"i\"),fileExt:RegExp(\".(\"+this.config.fileExt+\")$\",\"i\")},this._initListeners(this))}},{key:\"_initListeners\",value:function(e){-1<this.config.onHoverDelay&&document.addEventListener(\"mouseover\",e.listener.bind(e),e.listenerOptions),document.addEventListener(\"mousedown\",e.listener.bind(e),e.listenerOptions),document.addEventListener(\"touchstart\",e.listener.bind(e),e.listenerOptions)}},{key:\"listener\",value:function(e){var t=e.target.closest(\"a\"),n=this._prepareUrl(t);if(null!==n)switch(e.type){case\"mousedown\":case\"touchstart\":this._addPrefetchLink(n);break;case\"mouseover\":this._earlyPrefetch(t,n,\"mouseout\")}}},{key:\"_earlyPrefetch\",value:function(t,e,n){var i=this,r=setTimeout(function(){if(r=null,0===i.numOnHover)setTimeout(function(){return i.numOnHover=0},1e3);else if(i.numOnHover>i.config.rateThrottle)return;i.numOnHover++,i._addPrefetchLink(e)},this.config.onHoverDelay);t.addEventListener(n,function e(){t.removeEventListener(n,e,{passive:!0}),null!==r&&(clearTimeout(r),r=null)},{passive:!0})}},{key:\"_addPrefetchLink\",value:function(i){return this.prefetched.add(i.href),new Promise(function(e,t){var n=document.createElement(\"link\");n.rel=\"prefetch\",n.href=i.href,n.onload=e,n.onerror=t,document.head.appendChild(n)}).catch(function(){})}},{key:\"_prepareUrl\",value:function(e){if(null===e||\"object\"!==(void 0===e?\"undefined\":r(e))||!1 in e||-1===[\"http:\",\"https:\"].indexOf(e.protocol))return null;var t=e.href.substring(0,this.config.siteUrl.length),n=this._getPathname(e.href,t),i={original:e.href,protocol:e.protocol,origin:t,pathname:n,href:t+n};return this._isLinkOk(i)?i:null}},{key:\"_getPathname\",value:function(e,t){var n=t?e.substring(this.config.siteUrl.length):e;return n.startsWith(\"/\")||(n=\"/\"+n),this._shouldAddTrailingSlash(n)?n+\"/\":n}},{key:\"_shouldAddTrailingSlash\",value:function(e){return this.config.usesTrailingSlash&&!e.endsWith(\"/\")&&!this.regex.fileExt.test(e)}},{key:\"_isLinkOk\",value:function(e){return null!==e&&\"object\"===(void 0===e?\"undefined\":r(e))&&(!this.prefetched.has(e.href)&&e.origin===this.config.siteUrl&&-1===e.href.indexOf(\"?\")&&-1===e.href.indexOf(\"#\")&&!this.regex.excludeUris.test(e.href)&&!this.regex.images.test(e.href))}}],[{key:\"run\",value:function(){\"undefined\"!=typeof RocketPreloadLinksConfig&&new n(new RocketBrowserCompatibilityChecker({capture:!0,passive:!0}),RocketPreloadLinksConfig).init()}}]),n}();t.run(); }()); window.lazyLoadOptions=[{elements_selector:\"img[data-lazy-src],.rocket-lazyload,iframe[data-lazy-src]\",data_src:\"lazy-src\",data_srcset:\"lazy-srcset\",data_sizes:\"lazy-sizes\",class_loading:\"lazyloading\",class_loaded:\"lazyloaded\",threshold:300,callback_loaded:function(element){if(element.tagName===\"IFRAME\"&&element.dataset.rocketLazyload==\"fitvidscompatible\"){if(element.classList.contains(\"lazyloaded\")){if(typeof window.jQuery!=\"undefined\"){if(jQuery.fn.fitVids){jQuery(element).parent().fitVids()}}}}}},{elements_selector:\".rocket-lazyload\",data_src:\"lazy-src\",data_srcset:\"lazy-srcset\",data_sizes:\"lazy-sizes\",class_loading:\"lazyloading\",class_loaded:\"lazyloaded\",threshold:300,}];window.addEventListener('LazyLoad::Initialized',function(e){var lazyLoadInstance=e.detail.instance;if(window.MutationObserver){var observer=new MutationObserver(function(mutations){var image_count=0;var iframe_count=0;var rocketlazy_count=0;mutations.forEach(function(mutation){for(var i=0;i<mutation.addedNodes.length;i++){if(typeof mutation.addedNodes[i].getElementsByTagName!=='function'){continue} if(typeof mutation.addedNodes[i].getElementsByClassName!=='function'){continue} images=mutation.addedNodes[i].getElementsByTagName('img');is_image=mutation.addedNodes[i].tagName==\"IMG\";iframes=mutation.addedNodes[i].getElementsByTagName('iframe');is_iframe=mutation.addedNodes[i].tagName==\"IFRAME\";rocket_lazy=mutation.addedNodes[i].getElementsByClassName('rocket-lazyload');image_count+=images.length;iframe_count+=iframes.length;rocketlazy_count+=rocket_lazy.length;if(is_image){image_count+=1} if(is_iframe){iframe_count+=1}}});if(image_count>0||iframe_count>0||rocketlazy_count>0){lazyLoadInstance.update()}});var b=document.getElementsByTagName(\"body\")[0];var config={childList:!0,subtree:!0};observer.observe(b,config)}},!1)function lazyLoadThumb(e){var t='<img data-lazy-src=\"https://i.ytimg.com/vi/ID/hqdefault.jpg\" alt=\"\" width=\"480\" height=\"360\"><noscript><img src=\"https://i.ytimg.com/vi/ID/hqdefault.jpg\" alt=\"\" width=\"480\" height=\"360\"></noscript>',a='<button class=\"play\" aria-label=\"play Youtube video\"></button>';return t.replace(\"ID\",e)+a}function lazyLoadYoutubeIframe(){var e=document.createElement(\"iframe\"),t=\"ID?autoplay=1\";t+=0===this.parentNode.dataset.query.length?'':'&'+this.parentNode.dataset.query;e.setAttribute(\"src\",t.replace(\"ID\",this.parentNode.dataset.src)),e.setAttribute(\"frameborder\",\"0\"),e.setAttribute(\"allowfullscreen\",\"1\"),e.setAttribute(\"allow\", \"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\"),this.parentNode.parentNode.replaceChild(e,this.parentNode)}document.addEventListener(\"DOMContentLoaded\",function(){var e,t,p,a=document.getElementsByClassName(\"rll-youtube-player\");for(t=0;t<a.length;t++)e=document.createElement(\"div\"),e.setAttribute(\"data-id\",a[t].dataset.id),e.setAttribute(\"data-query\", a[t].dataset.query),e.setAttribute(\"data-src\", a[t].dataset.src),e.innerHTML=lazyLoadThumb(a[t].dataset.id),a[t].appendChild(e),p=e.querySelector('.play'),p.onclick=lazyLoadYoutubeIframe});class RocketElementorAnimation{constructor(){this.deviceMode=document.createElement(\"span\"),this.deviceMode.id=\"elementor-device-mode\",this.deviceMode.setAttribute(\"class\",\"elementor-screen-only\"),document.body.appendChild(this.deviceMode)}_detectAnimations(){let t=getComputedStyle(this.deviceMode,\":after\").content.replace(/\"/g,\"\");this.animationSettingKeys=this._listAnimationSettingsKeys(t),document.querySelectorAll(\".elementor-invisible[data-settings]\").forEach(t=>{const e=t.getBoundingClientRect();if(e.bottom>=0&&e.top<=window.innerHeight)try{this._animateElement(t)}catch(t){}})}_animateElement(t){const e=JSON.parse(t.dataset.settings),i=e._animation_delay||e.animation_delay||0,n=e[this.animationSettingKeys.find(t=>e[t])];if(\"none\"===n)return void t.classList.remove(\"elementor-invisible\");t.classList.remove(n),this.currentAnimation&&t.classList.remove(this.currentAnimation),this.currentAnimation=n;let s=setTimeout(()=>{t.classList.remove(\"elementor-invisible\"),t.classList.add(\"animated\",n),this._removeAnimationSettings(t,e)},i);window.addEventListener(\"rocket-startLoading\",function(){clearTimeout(s)})}_listAnimationSettingsKeys(t=\"mobile\"){const e=[\"\"];switch(t){case\"mobile\":e.unshift(\"_mobile\");case\"tablet\":e.unshift(\"_tablet\");case\"desktop\":e.unshift(\"_desktop\")}const i=[];return[\"animation\",\"_animation\"].forEach(t=>{e.forEach(e=>{i.push(t+e)})}),i}_removeAnimationSettings(t,e){this._listAnimationSettingsKeys().forEach(t=>delete e[t]),t.dataset.settings=JSON.stringify(e)}static run(){const t=new RocketElementorAnimation;requestAnimationFrame(t._detectAnimations.bind(t))}}document.addEventListener(\"DOMContentLoaded\",RocketElementorAnimation.run);(function(){function c(){var b=a.contentDocument||a.contentWindow.document;if(b){var d=b.createElement('script');d.innerHTML=\"window.__CF$cv$params={r:'9089ed8b4ad6b709',t:'MTczNzk5MzMzNS4wMDAwMDA='};var a=document.createElement('script');a.nonce='';a.src='/cdn-cgi/challenge-platform/scripts/jsd/main.js';document.getElementsByTagName('head')[0].appendChild(a);\";b.getElementsByTagName('head')[0].appendChild(d)}}if(document.body){var a=document.createElement('iframe');a.height=1;a.width=1;a.style.position='absolute';a.style.top=0;a.style.left=0;a.style.border='none';a.style.visibility='hidden';document.body.appendChild(a);if('loading'!==document.readyState)c();else if(window.addEventListener)document.addEventListener('DOMContentLoaded',c);else{var e=document.onreadystatechange||function(){};document.onreadystatechange=function(b){e(b);'loading'!==document.readyState&&(document.onreadystatechange=e,c())}}}})();",
    "url": "https://www.activecampaign.com/about/careers/listing/marketing/vice-president-of-revenue-performance-marketing_a30c6d3c-7a0e-4ba0-a3d3-553678cccd93",
    "created_at": "2025-01-27T15:55:48.054360+00:00"
  },
  {
    "id": "c04521acfe9675b3fdbb",
    "title": "Senior Vice President (SVP) of Marketing",
    "company": "Hyperproof",
    "location": "Not specified (assume remote or flexible based on benefits)",
    "salary": "$250k -$275K base + variable",
    "description": "The SVP of Marketing will report to the CEO, driving Hyperproof’s revenue, brand, and overall market presence. This role involves working with key business areas to reinforce the company's position as a market leader and leading through growth.",
    "requirements": [
      "Bachelor’s degree in Marketing, Business, or a related field; MBA preferred.",
      "15+ years of marketing experience with proven leadership in SaaS environments.",
      "Extensive experience leading brand, demand generation, and product marketing functions.",
      "Track record of success in scaling marketing organizations at Series B or growth-stage companies.",
      "Mastery of marketing tools and platforms such as HubSpot, Salesforce, and Google Analytics.",
      "Strong financial acumen for managing budgets and measuring ROI.",
      "Ability to inspire teams and build a collaborative culture."
    ],
    "responsibilities": [
      "Develop and execute a comprehensive, data-driven marketing strategy that aligns with organizational goals and drives growth across brand awareness, demand generation, and customer engagement.",
      "Establish and monitor KPIs to evaluate marketing performance and ROI, continuously refining strategies based on insights and analytics.",
      "Serve as the steward of the company’s brand, ensuring consistency, authenticity, and alignment with the company’s mission and values."
    ],
    "about_company": "Not specified",
    "benefits": "Base salary $250k -$275K base + variable\nGenerous equity compensation\nAnnual compensation reviews + equity\nUnlimited PTO: strongly encouraged to unplug and recharge\nHealth: coverage for medical, dental, and vision - employee and dependents\n401K, which vests immediately, complete with a 4% company match\n12 weeks of Parental leave and 1 year free diapers and wipes with Honest\nAnnual company in-person events and quarterly in-person connects\n$500 home office stipend - at the time of hire. Any additional home office needs are requested as needed.\n$100 quarterly paid wellness stipend\nPet insurance discount\nSlack channel notifications turn off after 5 pm based on your time zone\nTwo Hypercharge weeks of rest where we close company-wide (July & Dec)",
    "raw_content": "<p>Description:</p><ul><li> As the Senior Vice President (SVP) of Marketing, you will report to the CEO, driving Hyperproof’s revenue, brand, and overall market presence.</li><li> Work with key business areas—including Sales, Partnerships, Product, Customer Success, Enablement, and Executive Leadership—to reinforce our position as a market leader and continue leading Hyperproof through its incredible growth.</li><li> Develop and execute a comprehensive, data-driven marketing strategy that aligns with organizational goals and drives growth across brand awareness, demand generation, and customer engagement.</li><li> Establish and monitor KPIs to evaluate marketing performance and ROI, continuously refining strategies based on insights and analytics.</li><li> Serve as the steward of the company’s brand, ensuring consistency, authenticity, and alignment with the company’s mission and values.</li></ul><p>Requirements:</p><ul><li> Bachelor’s degree in Marketing, Business, or a related field; MBA preferred.</li><li> 15+ years of marketing experience with proven leadership in SaaS environments.</li><li> Extensive experience leading brand, demand generation, and product marketing functions.</li><li> Track record of success in scaling marketing organizations at Series B or growth-stage companies.</li><li> Mastery of marketing tools and platforms such as HubSpot, Salesforce, and Google Analytics.</li><li> Strong financial acumen for managing budgets and measuring ROI.</li><li> Ability to inspire teams and build a collaborative culture.</li></ul><p>Benefits:</p><ul><li> Base salary $250k -$275K base + variable</li><li> Generous equity compensation</li><li> Annual compensation reviews + equity</li><li> Unlimited PTO: strongly encouraged to unplug and recharge</li><li> Health: coverage for medical, dental, and vision - employee and dependents</li><li> 401K, which vests immediately, complete with a 4% company match</li><li> 12 weeks of Parental leave and 1 year free diapers and wipes with Honest</li><li> Annual company in-person events and quarterly in-person connects</li><li> $500 home office stipend - at the time of hire. Any additional home office needs are requested as needed.</li><li> $100 quarterly paid wellness stipend</li><li> Pet insurance discount</li><li> Slack channel notifications turn off after 5 pm based on your time zone</li><li> Two Hypercharge weeks of rest where we close company-wide (July & Dec)</li></ul>",
    "url": "https://www.remoterocketship.com/company/hyperproof-io/jobs/svp-marketing-united-states",
    "created_at": "2025-01-23T13:22:00.587731+00:00"
  },
  {
    "id": "c0bf65cf3a352779e530",
    "title": "Head of Operations & Client Success",
    "company": "Mediabuyer.com",
    "location": "Remote",
    "salary": "$3k - $8k per month",
    "description": "MediaBuyer.com is seeking a Head of Operations & Client Success with a strong background in operations management, client success, or marketing-related roles. The role involves owning critical business operations, ensuring exceptional customer experiences, and building the operational backbone to scale to hundreds of active clients.",
    "requirements": [
      "Experience building and optimizing operational systems and processes",
      "Ability to prioritize and organize multiple projects",
      "Experience in digital marketing and paid advertising (Google/YouTube, Meta, TikTok, etc)",
      "Past experience managing multiple high-end clients, preferably for online businesses",
      "Perfect written and verbal communication skills",
      "Extreme attention to detail",
      "Preferable: Past experience running ads or hiring/managing media buyers",
      "Preferable: Familiar with standard recruiting practices"
    ],
    "responsibilities": [
      "Build and optimize the operational backbone needed to scale to 100+ active clients and deliver the highest level of experience to customers",
      "Handle core business operations, including team coordination, process optimization, vendor and client relationships, and billing",
      "Collaborate with leadership team to define and execute strategic initiatives for scaling operations and enhancing customer satisfaction",
      "Create documentation, SOPs and playbooks for ongoing improved efficiency and scaling operations",
      "Track and improve key customer success metrics",
      "Identify and implement efficiency improvements across the customer success",
      "Own the end-to-end client experience from onboarding to ongoing Rolls-Royce level concierge support",
      "Manage daily communication with clients and team, primarily written communication via Slack (minimal meetings)",
      "Lead client calls with leadership team, including kick-off calls, and monthly performance reviews",
      "Interface with our community and Media Buyer talent to support them when needed"
    ],
    "about_company": "MediaBuyer.com is building the world’s most advanced marketplace for verified digital advertising talent. The company connects purpose-driven companies with proven media buyers who can maximize their growth and impact. The ultimate mission is to transform advertising into a force for good by uniting purpose-driven brands with proven media buyers who can help them grow.",
    "benefits": "100% remote work\nLong-term relationships focus (5-10 years plus)\nSignificant potential for career growth\nProfit-sharing with core team members\nPromotion and hiring from within\nTight-knit online family environment",
    "raw_content": "Head of Operations & Client SuccessMediabuyer.comPart Time$3k - $8k per monthClient Success, Operations, Operations ManagementOpened 12 days ago Featured Job Promoted Job Remote Job CompanySave Client Success Operations Operations Management Head of Operations & Client SuccessOverviewMediaBuyer.com is seeking a Head of Operations & Client Success who has a strong background in operations management, client success, or marketing-related roles.If you have excellent operational and problem-solving skills or have worked with any type of paid advertising, this would be a great long-term fit for you with very high growth potential.At MediaBuyer.com, we exclusively work with large VIP clients and renowned brands spending hundreds of thousands/millions per month in paid ads, such as Google and YouTube ads, Meta and IG ads, TikTok ads, etc. Our approach centers around personalized, 1-to-1 client attention.As Head of Operations at MediaBuyer.com, you'll own critical business operations while ensuring exceptional customer experiences and building the operational backbone to scale to hundreds of active clients. You will become a very high value “connector” in the paid ads industry – collaborating with some of the best ad talent in the world to help brands maximize their reach and impact.If you’re interested, please send your resume along with a short video highlighting your favorite superhero or movie character and explaining the main reason behind your choice.RequirementsYou MUST have these skills:Experience building and optimizing operational systems and processesAbility to prioritize and organize multiple projectsExperience in digital marketing and paid advertising (Google/YouTube, Meta, TikTok, etc)Past experience managing multiple high-end clients, preferably for online businessesPerfect written and verbal communication skillsExtreme attention to detailPreferable:Past experience running ads or hiring/managing media buyersFamiliar with standard recruiting practicesResponsibilities:OperationsBuild and optimize the operational backbone needed to scale to 100+ active clients and deliver the highest level of experience to customersHandle core business operations, including team coordination, process optimization, vendor and client relationships, and billing.Collaborate with leadership team to define and execute strategic initiatives for scaling operations and enhancing customer satisfaction.Create documentation, SOPs and playbooks for ongoing improved efficiency and scaling operationsTrack and improve key customer success metricsIdentify and implement efficiency improvements across the customer successClient SuccessOwn the end-to-end client experience from onboarding to ongoing Rolls-Royce level concierge supportManage daily communication with clients and team, primarily written communication via Slack (minimal meetings)Lead client calls with leadership team, including kick-off calls, and monthly performance reviewsInterface with our community and Media Buyer talent to support them when neededWe are very close to scale mode at our company, so there is very high potential for growth and impact here. We bring on brands that you have probably heard of already. We serve well-known brands, including large celebrity influencers, major commerce brands, and people you see on TV or advertising on TV.If you’re looking to work with exciting and impactful online businesses that contribute useful products & services to humanity, we got them. As we scale, you'll have the opportunity to build teams and shape our company’s operations while growing alongside industry leaders.BenefitsAt MediaBuyer.com, we hire people to work with us for 5-10 years plus. Our main focus is fostering long-term relationships, coaching our team members and helping them grow in the company to become more valuable long-term assets.We are not looking for short-term mercenary types.We are 100% remote.You will be looked after and part of our online tight-knit family. There is also significant potential for career growth, and we offer profit-sharing with core team members. Our team leaders started in support roles, and we prioritize promoting and hiring from within! We hire based on culture first, ability to learn a fast second, and skills last.VisionWe are building the most advanced marketplace for verified digital advertising talent on the web. Though our ultimate mission is to transform advertising into a force for good by uniting purpose-driven brands with proven media buyers who can help them grow.We want to be a 1-click catalyst that enables entrepreneurs to instantly and ethically promote morally good products that contribute to humanity. Ultimately, we aspire to make advertising more truthful, informative, and entertaining.This role begins part-time with clear transition to full-time as we scale. Frequently Asked Questions What is MediaBuyer.com?MediaBuyer.com is building the world’s most advanced marketplace for verified digital advertising talent. In an industry plagued by overpromising and underdelivering, we’re creating a transparent, merit-based platform that ensures companies can reliably find trusted media buying talent to scale their advertising impact. We connect purpose-driven companies with proven media buyers who can maximize their growth and impact.Don't let this one get away. About the company Mediabuyer.com View all company's open jobs Similar Remote Jobs Similar Remote JobsAccount Manager + Designer for Shopify Dev & CRO AgencyEnvisionFull Time$3k - $6k per monthB2B Client Management, Figma, Project Management, Technical, Web DesignNew Job! Featured Job Promoted Job Remote Job Customer Support Specialist (SaaS)DialMyCallsFull Time$1.5k - $2.5k per monthAdministrative Tasks, Attention to detail, Clear Communication Skills, Customer Support, EnglishNew Job! Featured Job Promoted Job Remote Job Project ManagerFlatPlanFull Time$62.9k - $75.4k per yearExcellent Communicator, Organisational skills, Process improvement, Project Management, Project PlanningNew Job! Featured Job Promoted Job Remote Job Sales and Marketing ManagerShane HummusFull Time$80k - $150k per yearClient acquisition, Coaching, Cross Functional Collaboration, Data Driven, Excellent CommunicatorOpened 6 days ago Featured Job Promoted Job Remote Job Customer Success ManagerRankbreezeFull Time$1.5k - $3.5k per monthClient Onboarding, Customer Support, Excellent Communicator, Problem Solver, Process improvementOpened 9 days ago Featured Job Promoted Job Remote Job No related jobs found",
    "url": "https://dynamitejobs.com/company/mediabuyercom/remote-job/head-of-operations-client-success",
    "created_at": "2025-01-21T20:56:45.730077+00:00"
  },
  {
    "id": "c361739422b2d6448c7d",
    "title": "Director of Demand Generation",
    "company": "OfferFit",
    "location": "Remote with up to 10-15% travel",
    "salary": "$193,000-$233,000 per year, plus eligibility for additional bonus ranging $29,000-$35,000; Eligibility for an additional end of year performance bonus, commissions (when applicable) and/or equity options",
    "description": "Take ownership of developing and executing strategies that drive pipeline growth. Work closely with the CMO and lead a skilled, high-potential team focused on engaging prospects at the earliest stages of their journey.",
    "requirements": [
      "SaaS Extraordinaire: experience in driving demand and marketing SaaS products",
      "Problem solver: ability to recognize patterns and come up with creative solutions",
      "Structured and organized: ability to structure a plan and see it through to execution",
      "Collaborative and empathetic partner: works well with internal stakeholders",
      "Clear communicator: able to express clearly and persuasively",
      "Entrepreneurial: proactively identifies opportunities and risks",
      "Up to 10-15% travel for company-wide quarterly gatherings, team offsite workshops, customer meetings, and industry-related events",
      "Ability to primarily overlap with North America time zones",
      "Strong fluency in English, both written and verbal"
    ],
    "responsibilities": [
      "Lead strategic demand generation initiatives",
      "Optimize marketing automation systems",
      "Develop targeted nurture programs",
      "Develop process for multi-touch attribution",
      "Align sales and marketing for revenue impact",
      "Build and mentor a high-performing team"
    ],
    "about_company": "OfferFit is at the forefront of AI decisioning technology, providing a unique opportunity to work with cutting-edge solutions that are transforming the way businesses approach customer engagement and marketing. The company values innovation, learning, and continuous improvement in a fast-paced, collaborative environment.",
    "benefits": "Generous PTO (starting at 25 days PTO per year) and Parental Leave policy (12 weeks paid)\n100% remote work environment with flexible hours\nQuarterly gatherings in different cities\nWeekly team events (lunch and learns, trivia, virtual escape rooms, town hall and team health “barometer” meetings)\nAbility to learn and develop from an experienced leadership team\nDedication to building a strong culture\n[US Only] Competitive benefits (major medical, vision, dental and LTD) and 401K matching program",
    "raw_content": "<p><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">Our Marketing team is expanding, and we’re excited to bring on a Director of Demand Generation to take ownership of developing and executing strategies that drive pipeline growth. In this role, you’ll work closely with the CMO and lead a skilled, high-potential team focused on engaging prospects at the earliest stages of their journey, creating a strong foundation for long-term success and sales impact.</span></p>\n<p><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>In particular, you will:</strong></span></p>\n<ul>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Lead strategic demand generation initiatives:</strong> Define, execute, and continuously optimize multi-channel marketing campaigns (including email, paid media, content syndication, webinars, and more) to drive brand awareness, lead acquisition, and sales pipeline growth.</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Optimize marketing automation systems:</strong> Oversee the selection, implementation, and optimization of a marketing automation platform (e.g., Marketo, HubSpot) to segment audiences, deliver personalized campaigns, automate lead scoring, and track performance through comprehensive data analysis and reporting.</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Develop targeted nurture programs:</strong> Create and manage end-to-end lead nurturing strategies to engage prospects, accelerate pipeline movement, and improve conversion and win rates, ensuring a seamless transition between marketing and sales.</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Develop process for multi-touch attribution:</strong> Partner with RevOps to design and implement a multi-touch attribution model, ensuring that marketing efforts are effectively measured and aligned with sales outcomes, facilitating data-driven decision-making.</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Align sales and marketing for revenue impact:</strong> Work closely with sales and marketing leadership to ensure alignment on lead quality, timely follow-up strategies, and continuous feedback loops that optimize pipeline velocity and drive toward shared revenue targets.</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Build and mentor a high-performing team:</strong> Develop, coach, and scale the Demand Generation team, fostering a culture of accountability, creativity and results-driven performance.</span></li>\n</ul>\n<p><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Why it’s great:</strong></span></p>\n<ol>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">You'll have a direct impact on OfferFit’s revenue growth, leading a critical function that sits at the intersection of marketing, sales, and RevOps. This is a high-visibility role with the potential to shape the future of the company’s go-to-market strategies.</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">OfferFit is at the forefront of AI decisioning technology, providing a unique opportunity to work with cutting-edge solutions that are transforming the way businesses approach customer engagement and marketing.</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">You'll be joining a fast-paced, collaborative environment that values innovation, learning, and continuous improvement.&nbsp;</span></li>\n</ol>\n<p><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Who's a fit?</strong></span></p>\n<ul>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>SaaS Extraordinaire:</strong> you’ve spent time in your driving demand and marketing SaaS products (MarTech or adjacent industries a plus)!</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Problem solver:</strong> you recognize patterns, synthesize information and come up with creative, simple, and practical solutions</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Structured and organized:</strong> you can structure a plan, align stakeholders, and see it through to execution</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Collaborative and empathetic partner:</strong> you work well with internal stakeholders, understanding their needs and building solutions that match</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Clear communicator: </strong>you are able to express yourself clearly and persuasively, both in writing and speech </span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Entrepreneurial:</strong> you proactively identify opportunities and risks, work around obstacles, and always seek creative ways to improve processes and outcomes</span></li>\n</ul>\n<p><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Additional Requirements:&nbsp;</strong></span></p>\n<ul>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">Up to<strong> </strong>10-15% travel&nbsp;for company-wide quarterly gatherings, team offsite workshops, customer meetings, and industry-related events</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">Ability to primarily overlap with North America time zones</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">Strong fluency in English, both written and verbal</span></li>\n</ul>\n<p><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">The base salary range for this position in the United States is $193,000-$233,000 per year, plus eligibility for additional bonus ranging $29,000-$35,000; Eligibility for an additional end of year performance bonus, commissions (when applicable) and/or equity options may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, depending on the position offered. &nbsp;Please note that we adjust compensation for non–US countries using a relative cost of labor adjustment between the US and your country of residence.&nbsp; Applicants should apply via OfferFit’s internal or external careers site.</span></p>\n<p><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><strong>Company Benefits and Perks</strong></span></p>\n<ul>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">Generous PTO (starting at 25 days PTO per year) and Parental Leave policy (12 weeks paid)</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">100% remote work environment with flexible hours&nbsp;</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">Quarterly gatherings where we meet in person in a different city to work together, bond as a team and celebrate our progress</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">Weekly team events (lunch and learns, trivia, virtual escape rooms, town hall and team health “barometer” meetings)</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">Ability to learn and develop from an experienced leadership team (ex-Amazon, McKinsey, BCG, and IBM, among others) who are focused on building a talented, diverse, and inclusive team</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">Dedication to building a strong culture (e.g., team resource groups, weekly recognitions, major life event celebrations, mental health/sustainability days off, etc.)</span></li>\n<li style=\"font-size: 12pt; color: rgb(0, 0, 0);\"><span style=\"font-size: 12pt; color: rgb(0, 0, 0);\">[US Only]&nbsp;Competitive benefits (major medical, vision, dental and LTD) and 401K matching program</span></li>\n</ul>",
    "url": "https://boards.greenhouse.io/offerfit/jobs/4490030005",
    "created_at": "2025-01-24T10:54:39.228363+00:00"
  },
  {
    "id": "c560fd6c19ec76b7e7c3",
    "title": "VP of Growth Marketing",
    "company": "Peoplease",
    "location": "Not specified (remote status not mentioned)",
    "salary": "Competitive salary and benefits package",
    "description": "Result-driven VP of Growth Marketing to spearhead strategic marketing initiatives and drive brand growth. Reports directly to the SVP of Sales, responsible for crafting and executing marketing strategies, managing high-performing teams, and building the company’s brand presence across multiple channels.",
    "requirements": [
      "Bachelor’s degree in Marketing, Business, or related field (MBA preferred).",
      "10+ years of experience in marketing, with at least 5 years in a leadership role.",
      "Proven ability to develop and execute successful marketing strategies.",
      "Exceptional leadership and team management skills.",
      "Expertise in digital marketing, content marketing, and data analytics.",
      "Familiarity with analytics tools.",
      "Ability to analyze data and make fact-based decisions and recommendations.",
      "Strong understanding of market research and competitive analysis.",
      "Excellent communication, presentation, and interpersonal skills.",
      "Experience with CRM tools (e.g., Salesforce, HubSpot) and marketing automation platforms.",
      "Advanced skills in digital advertising platforms."
    ],
    "responsibilities": [
      "Develop and execute a comprehensive marketing strategy aligned with business objectives.",
      "Lead market positioning efforts to enhance brand visibility and competitive advantage.",
      "Set annual goals, KPIs, and budgets for the marketing department.",
      "Foster a collaborative and innovative culture within the department.",
      "Establish and oversee workflows, ensuring efficiency and scalability.",
      "Define and refine the brand voice, messaging, and positioning in the market.",
      "Ensure consistency across all marketing and communication materials.",
      "Oversee brand reputation management initiatives, including PR and crisis communication.",
      "Lead campaigns across digital and traditional channels to drive lead generation and client acquisition.",
      "Implement Search Engine Optimization (SEO/SEM), email and social media strategies to maximize ROI.",
      "Partner with Sales and Product teams to create effective go-to-market strategies.",
      "Leverage analytics to track campaign performance and inform future strategies.",
      "Conduct market research to identify opportunities, risks, and trends.",
      "Present regular performance reports to executive leadership.",
      "Work closely with internal teams (Sales, Product, Customer Success) to align marketing efforts with business goals.",
      "Cultivate relationships with external stakeholders, including agencies, vendors, and industry partners.",
      "Stay abreast of emerging marketing technologies and strategies.",
      "Identify opportunities to experiment with new channels and tools."
    ],
    "about_company": "Peoplease is a leading Professional Employer Organization (PEO) providing solutions to small and medium-sized businesses in the blue and gray-collar industries. They offer world-class service and administrative solutions in payroll, human resources, benefits, and risk management. The company fosters a culture of inclusion and belonging, driven by core values: Engagement, Integrity, Tenacity, Curiosity, Happiness, and a Service-obsessed mindset.",
    "benefits": "Be part of an innovative and growth-oriented company in the PEO industry.\nOpportunity to drive meaningful impact and lead a high-performing team.\nCompetitive salary and benefits package.",
    "raw_content": "<h4>About Peoplease</h4><p>Peoplease is a leading Professional Employer Organization (PEO) providing solutions to small and medium-sized businesses in the blue and gray-collar industries. We enable our clients and partners to achieve their aspirations by offering world-class service and administrative solutions in payroll, human resources, benefits, and risk management. At Peoplease, we foster a culture of inclusion and belonging, driven by our core values: Engagement, Integrity, Tenacity, Curiosity, Happiness, and a Service-obsessed mindset.   </p><h4>Position Summary  </h4><p>We are seeking a result-driven VP of Growth Marketing to spearhead strategic marketing initiatives and drive brand growth. This position will report directly to the SVP of Sales and will be responsible for crafting and executing marketing strategies, managing high-performing teams, and building the company’s brand presence across multiple channels. The ideal candidate will be a strategic thinker with a data-driven mindset, strong leadership capabilities, and a deep understanding of modern marketing principles.&nbsp;  </p><h4>Key Responsibilities  </h4><ul>  <li>Develop and      execute a comprehensive marketing strategy aligned with business      objectives.  </li><li>Lead market      positioning efforts to enhance brand visibility and competitive advantage.  </li><li>Set annual goals,      KPIs, and budgets for the marketing department.  </li><li>Foster a      collaborative and innovative culture within the department.  </li><li>Establish and      oversee workflows, ensuring efficiency and scalability.  </li><li>Define and      refine the brand voice, messaging, and positioning in the market.  </li><li>Ensure      consistency across all marketing and communication materials.  </li><li>Oversee brand      reputation management initiatives, including PR and crisis communication.  </li><li>Lead campaigns      across digital and traditional channels to drive lead generation and client      acquisition.  </li><li>Implement Search      Engine Optimization (SEO/SEM), email and social media strategies to      maximize ROI.  </li><li>Partner with      Sales and Product teams to create effective go-to-market strategies.  </li><li>Leverage      analytics to track campaign performance and inform future strategies.  </li><li>Conduct market      research to identify opportunities, risks, and trends.  </li><li>Present regular      performance reports to executive leadership.  </li><li>Work closely      with internal teams (Sales, Product, Customer Success) to align marketing      efforts with business goals.  </li><li>Cultivate      relationships with external stakeholders, including agencies, vendors, and      industry partners.  </li><li>Stay abreast of      emerging marketing technologies and strategies.  </li><li>Identify      opportunities to experiment with new channels and tools. </li></ul><h4>Qualifications&nbsp;  </h4><ul><li>Bachelor’s degree in Marketing, Business, or related field (MBA preferred).  </li><li>10+ years of experience in marketing, with at least 5 years in a leadership role.  </li><li>Proven ability to develop and execute successful marketing strategies.  </li><li>Exceptional leadership and team management skills.  </li><li>Expertise in digital marketing, content marketing, and data analytics.  </li><li>Familiarity with analytics tools.</li><li>Ability to analyze data and make fact-based decisions and recommendations.</li><li>Strong understanding of market research and competitive analysis.  </li><li>Excellent communication, presentation, and interpersonal skills.  </li><li>Experience with CRM tools (e.g., Salesforce, HubSpot) and marketing automation platforms.  </li><li>Advanced skills in digital advertising platforms.  </li></ul><p><br></p><ul></ul><h4>Physical demands and Work Environment&nbsp;  </h4><p>The role requires regular communication and occasional travel to support the distributed workforce. The role will primarily function indoors but may involve working in varying temperatures or outdoor environments as needed.</p><h4>Why Join Us?  </h4><ul><li>Be part of an innovative and growth-oriented company in the PEO industry.   </li><li>Opportunity to drive meaningful impact and lead a high-performing team.  </li><li>Competitive salary and benefits package.</li></ul>",
    "url": "https://peopleasellc.prismhr-hire.com/job/887609/vp-of-growth-marketing?s=inp",
    "created_at": "2025-01-28T20:43:00.677378+00:00"
  },
  {
    "id": "c989fa640da4efafa7a8",
    "title": "Sales and Marketing Manager",
    "company": "Shane Hummus",
    "location": "Remote",
    "salary": "$80k - $150k per year",
    "description": "We’re seeking a Sales and Marketing Manager to scale our premium coaching program, Content Growth Engine (CGE). This role involves leading a high-performing team and collaborating across the Shane Hummus brand to leverage a proven system that helps business owners scale to $100K+/month through YouTube.",
    "requirements": [
      "Proven success managing high-ticket phone sales teams",
      "solid experience in the coaching or info product space",
      "strong data-driven mindset",
      "exceptional communication and organizational skills",
      "expertise in designing high-converting funnels and marketing campaigns",
      "hands-on experience with CRM platforms and marketing tools."
    ],
    "responsibilities": [
      "Lead and manage a high-ticket phone sales team",
      "develop sales scripts and closing frameworks",
      "monitor KPIs",
      "collaborate with marketing to align YouTube and CGE sales funnels",
      "optimize webinars and email sequences",
      "ensure high-touch client experiences",
      "develop retention and upsell strategies",
      "collaborate with copywriters and designers",
      "use data to identify growth opportunities",
      "stay updated on industry trends."
    ],
    "about_company": "At Team Hummus, we specialize in helping business owners build scalable businesses through YouTube. Our flagship program, Content Growth Engine (CGE), transforms YouTube channels into automated customer acquisition machines. We have a proven track record of helping clients achieve significant revenue growth through our Hybrid Personal Brand model.",
    "benefits": "Competitive salary with performance-based bonuses, full-time remote work, access to personal development resources and coaching programs, be part of a dynamic and passionate team delivering transformative results for clients.",
    "raw_content": "Sales and Marketing ManagerShane HummusFull Time$80k - $150k per yearClient acquisition, Coaching, Cross Functional Collaboration, Data Driven, Excellent CommunicatorOpened 7 days ago Featured Job Promoted Job Remote Job CompanySave Client acquisition Coaching Cross Functional Collaboration Data Driven Excellent Communicator KPIs Leadership Marketing Marketing Funnels Sales strategy Sales and Marketing ManagerRole OverviewWe’re seeking a Sales and Marketing Manager to scale our premium coaching program, Content Growth Engine (CGE). If you understand the power of high-ticket offers and thrive in scaling impactful businesses, this role is for you.You’ll lead a high-performing team and collaborate across the Shane Hummus brand, leveraging a proven system that helps business owners scale to $100K+/month through YouTube.This role is ideal for someone who has previously worked in the coaching or info product industry, understands the nuances of premium client acquisition, and thrives in a high-performance environment.📌 About UsAt Team Hummus, we specialize in helping business owners build scalable businesses through YouTube. Our flagship program, Content Growth Engine (CGE), transforms YouTube channels into automated customer acquisition machines.We live by what we teach. In our first year, we generated $600,000 in revenue, and our journey proves a powerful truth: YouTube success isn’t about subscriber count—it’s about strategy. From growing my main channel (Shane Hummus) to over 1 million subscribers, where I help people explore remote jobs, to building a separate channel focused on scaling businesses, I’ve turned my expertise into a $350K+/month business by solving the problem everyone kept asking me about:\"How do you actually make money on YouTube?\"💡 The Results Speak for Themselves:17+ entrepreneurs scaled to 7-figures, with 4 breaking through to 8-figures per yearMultiple clients hitting $100K+/month within 90 daysOne client went from 85 subscribers to $85K/monthAnother scaled from $1K/month to $186K/month on YouTubeWhat sets us apart is our Hybrid Personal Brand model. Unlike those who chase vanity metrics, we teach our clients how to turn small, targeted audiences into thriving businesses.We've proven this model works across multiple niches. While my main channel helps millions find remote jobs, I've built a separate channel specifically focused on teaching business owners how to scale through YouTube. This dual success demonstrates how to turn viewers into customers in any market.Our sales YouTube funnel consistently brings in 50-100 qualified leads per month - a mix of remote job seekers who witnessed our channel's explosive growth and business owners who, after discovering us through our remote jobs content, want to replicate our YouTube success for themselves.We're looking for exceptional sales leaders who understand the power of high-ticket offers and can spot opportunities at scale.Thanks to our proven track record and massive YouTube presence, you'll be working with leads who already know, like, and trust us.📌 Key ResponsibilitiesHigh-Ticket Sales LeadershipLead, manage, and optimize the performance of a high-ticket phone sales team.Develop and implement effective sales scripts, closing frameworks, and objection-handling techniques tailored for premium offers.Monitor KPIs, provide actionable feedback, and conduct training to ensure consistent achievement of revenue targets.Oversee KPIs, coach the team, and hire top-performing salespeople to build a winning culture.Marketing and Funnel StrategyPartner with marketing to align YouTube and CGE sales funnels, leveraging Shane Hummus’ massive YouTube presence.Help optimize webinars, VSLs, and email sequences to convert 50-100 qualified leads/month into high-ticket clients.Align sales strategies with our proven Hybrid Personal Brand model to maximize conversions across niches.Client AcquisitionEnsure high-touch client experiences throughout the sales cycle.Develop and implement retention and upsell strategies to maximize client lifetime value.Streamline lead qualification, focusing on prospects who align with CGE’s mission.Cross-Team Collaboration & Other ResponsibilitiesWork closely with the team to qualify leads, ensure a seamless handoff to sales, and nurture client relationships.Collaborate with copywriters and designers to develop high-converting marketing materials.Use data and KPIs to identify opportunities for growth in both sales and marketing.Stay updated on industry trends, competitor strategies, and best practices in high-ticket sales and marketing.🔎 What We’re Looking For (Non-Negotiables)Proven success managing high-ticket phone sales teams, with consistent results in hitting ambitious targets.Solid experience & understanding of the coaching, personal development, or info product space, with a deep understanding of the high-ticket sales cycle.Strong data-driven mindset with the ability to analyze metrics and implement improvements based on insights, with proficiency in CRM systems, sales automation tools, and marketing platforms.Exceptional communication, collaboration, and organizational skills.(Preferred Experience and Qualifications)Expertise in designing high-converting funnels, webinars, and VSLs for premium offers.leading high-ticket phone sales teams, ideally within the coaching or info product space.Demonstrated success in designing and implementing high-converting funnels and marketing campaigns. Expertise in creating and optimizing sales funnels, webinars, and VSLs for premium offers.Hands-on experience with tools like CRM platforms, webinar software, and email marketing systems.📌 Why Join Us?Competitive salary with performance-based bonuses.Full-Time Remote: Enjoy the flexibility to work from home.Be part of a dynamic and passionate team, delivering life-changing results for clients.Access to personal development resources and coaching programs.Be part of a business & play a pivotal role in scaling a business that’s delivering transformative results for clients worldwide.This role is ideal for a strategic thinker and proactive leader who thrives in a fast-paced, results-driven environment. If you have strong high-ticket phone sales team experience and a passion for working with coaching programs or info products, we’d love to hear from you.P.S. If this opportunity isn't quite the match for you feel free to share this job post with someone in your network who is ready to make a significant impact and scale our high-ticket coaching product to new heights.Shane Hummus asks respectfully to only apply through the application form and not email/apply to them directly. Recruiters and Agencies please do not contact Shane Hummus directly.Don't let this one get away. About the company Shane Hummus View all company's open jobs Similar Remote Jobs Similar Remote JobsSales Development Representative (SDR)TrottoFull Time$1.5k - $2k per yearBooking Appointments, Business Acumen, Cold-Calling, Excellent Communicator, Lead GenerationOpened 8 days ago Featured Job Promoted Job Remote Job Account ExecutiveMcKinney-Vento.orgFull Time$3k - $6k per monthAccount management, Building Relationships, Business Development, Clear Communicator, Client ManagementCloses in 14 days Featured Job Promoted Job Remote Job Senior Growth MarketerMatsuiFull Time$90k - $120k per yearDigital Marketing, Marketing Strategy, Growth Marketing, Email Marketing, Google adsOpened 6 days ago Featured Job Promoted Job Remote Job Marketing Manager For Digital Marketing AgencyFlowCandyFull Time$2.5k - $5k per monthContent Creation, Copywriting, Digital Marketing, Email Marketing, GohighlevelOpened 8 days ago Featured Job Promoted Job Remote Job No related jobs found",
    "url": "https://dynamitejobs.com/company/shanehummus/remote-job/sales-and-marketing-manager",
    "created_at": "2025-01-22T12:22:47.691057+00:00"
  },
  {
    "id": "f6b4af3f68d267d4a898",
    "title": "Organic Acquisition Strategist",
    "company": "Reverse Tech",
    "location": "Not specified (Remote status not mentioned)",
    "salary": "Not specified",
    "description": "Lead strategies to increase brand presence and reach a wider audience through organic channels, including content marketing, SEO, lifecycle/CRM, social media, affiliates, reputation/PR, and community-building efforts.",
    "requirements": [
      "Around 10 years of experience in digital marketing with strong experience in organic acquisition strategies.",
      "Demonstrated success in driving organic traffic growth, preferably in the health and wellness sector.",
      "Strong expertise in at least one of the areas described above that you will own.",
      "Excellent analytical and data skill, with the ability to interpret data and drive actionable insights.",
      "Proven leadership experience in building and mentoring teams.",
      "Creative problem-solver with a strong understanding of user behavior and market trends.",
      "Experience with automation, including no-code tools, coding, implementing platforms, or using tools like Zapier or ITTT."
    ],
    "responsibilities": [
      "Develop and execute a comprehensive organic acquisition strategy aligned with the company’s growth objectives.",
      "Own areas of marketing including SEO, Email Marketing / CRM / Lifecycle, Social Media Organic / Communities, Affiliates, Reputation / PR.",
      "Analyze traffic and engagement metrics to draw insights and optimize organic channels.",
      "Collaborate with product and marketing teams to create cohesive campaigns that drive organic growth.",
      "Stay tech-savvy and on top of industry trends and algorithm changes to ensure effective organic strategies.",
      "Build and lead a high-performing organic acquisition team, fostering a culture of innovation and accountability."
    ],
    "about_company": "Reverse Tech is dedicated to creating, launching, and scaling digital product brands in the health and wellness space. With the goal of helping 10 million people improve their health by 2026, they focus on hyper-targeted, mass-scale brands and a subscription-based business model. The team thrives on data-driven decisions, continuous learning, and innovation without the burden of big egos.",
    "benefits": "Not specified",
    "raw_content": "<p>Description:</p><ul><li> About Reverse Tech</li><li> At Reverse Tech, we are dedicated to creating, launching, and scaling digital product brands in the health and wellness space. With the goal of helping 10 million people improve their health by 2026, we focus on hyper-targeted, mass-scale brands and a subscription-based business model. Our team thrives on data-driven decisions, continuous learning, and innovation without the burden of big egos.</li><li> About the Role</li><li> Are you a growth-oriented leader with a passion for driving organic traffic and user engagement? You'll spearhead our strategies to increase our brand presence and reach a wider audience without relying on paid media. You will have the opportunity to shape our content marketing, SEO, lifecycle/ CRM social media, affiliates, reputation/PR and community-building efforts. All in all, everything that isn't paid acquisition through bidding on advertising platforms.</li><li> Your Responsibilities:</li><li> Develop and execute a comprehensive organic acquisition strategy that aligns with the company’s growth objectives. You will own the following areas of marketing:</li><li> SEO</li><li> Email Marketing / CRM / Lifecycle</li><li> Social Media Organic / Communities (and links partially to customer service)</li><li> Affiliates (it's paid acquisition, but supports link building, PR or influencers)</li><li> Reputation / PR</li><li> Analyze traffic and engagement metrics to draw insights and optimize organic channels.</li><li> Collaborate with product and marketing teams to create cohesive campaigns that drive organic growth.</li><li> Tech savvy and on top of industry trends and algorithm changes to ensure effective organic strategies.</li><li> Build and lead a high-performing organic acquisition team, fostering a culture of innovation and accountability.</li></ul><p>Requirements:</p><ul><li> Around 10 years of experience in digital marketing with strong experience in organic acquisition strategies.</li><li> Demonstrated success in driving organic traffic growth, preferably in the health and wellness sector.</li><li> Strong expertise in at least one of the areas described above that you will own. You must know about the others, but we would like you to excel at least in one of them.</li><li> Excellent analytical and data skill, with the ability to interpret data and drive actionable insights.</li><li> Proven leadership experience in building and mentoring teams. Creative problem-solver with a strong understanding of user behavior and market trends.</li><li> Experience with automation. If you are use to automate processes with no-code tools, coding (even if with AI), implement platforms or make the most of tools like Zapier or ITTT, this is a great bonus.</li></ul><p>Benefits:</p><ul></li></ul>",
    "url": "https://www.remoterocketship.com/company/reverse-tech/jobs/head-of-growth-marketing-spain",
    "created_at": "2025-01-24T12:09:45.892464+00:00"
  }
]